{
    "filename": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0010 Proposal Title: Dynamic, Interactive Knowledge Graph Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: InspiRD, Inc Address: Website: UEI: DUNS: CAGE: 24261 Chrisanta Dr, Mission Viejo, CA 92691-4003 http://inspird.com D859W8HNHD86 054205491 6DC34 SBA SBC Identification Number: 001317907 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 12 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_001317907 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_001317907.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [X] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [ ] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [X] Asian [ ] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Sandeep Mehta Signature Sandeep R Meht Title CTO a Business Name Date InspiRD, Inc 06/19/2020",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?NO VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: We will deliver a comprehensive toolset for dynamic and interactive updates to Knowledge Graphs (KGs).\nWe will address very large KGs comprising of a variety of entities, including objects, events, situations, or concepts.\nOur solution features an intuitive user interface designed to allow users to review and update KGs without requiring specialized training.\nWe will help the USAF maintain an up-to-date and robust KG, enabling comprehensive insights and data-driven decision-making.\nOur situational awareness experience with the AFNWC will drive usability and commercialization.\nWe will implement cutting-edge algorithms to dynamically update KGs for manual KG modifications or automatic anomaly detection.\nThe KG correction algorithm will efficiently propagate changes across the KG, without disrupting its overall integrity.\nKG Completion will correct for missing entities or relationships to improve accuracy.\nSchema Reshaping will automatically adjust the ontology to accommodate data changes.\nEntity disambiguation algorithms will be implemented to correct ambiguous or duplicate nodes after changes.\nOur custom Technical Language Processing (TLP) toolkit will underpin the KG toolset and provide the necessary accuracy, reliability, and performance.\nA set of encoder LLMs will enable Graph Neural Networks (GNNs) and Graph Language Models (GLMs).\nWe will also consider Generative AI (Decoder) assisted automation.\nIn Phase I, we will collaborate with AFRL to identify dynamic KG toolset use cases, define requirements, and generate associated workflows.\nWe will build and deliver a Proof of Concept (POC) of the dynamic KG toolset.\nThe POC will demonstrate key components, including automated KG correction, graph neural networks, graph language models, and vector database.\nWe will build on our proven codebase over 5 years of LLM productization experience.\nOur AI models have been validated on COTS products and on DARPA, MDA, and USAF SBIRs.\nOur deep USAF operational and veteran experience will ensure usability, reliability, and accuracy.\nOur decade-long track record of technology transition and delivering exceptional value will ensure success.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development:",
        "5": "Knowledge Graphs (KGs) enable a comprehensive approach that improves decision-making and enhances mission success in various defense and intelligence applications.\nDynamic KGs are transformative tools that enhance situational awareness, pattern-of-life analysis, threat detection, targeting operations, and more.\nHence, the proposed dynamic KG toolset has broad applicability across the Department of Defense (DoD), including the Army, Navy, Missile Defense Agency (MDA), Space Force, and others.\nAdditionally, it will appeal to various government sectors, such as the Department of Homeland Security and the Department of Energy.\nLocal and state governments, law enforcement agencies, and public safety organizations will also benefit from this system.\nIn the commercial sector, dynamic KGs will revolutionize how businesses manage and use data.\nThe proposed toolset will attract industries ranging from e-commerce to healthcare.\nPhase I will deliver a POC that proves efficacy and drives stakeholder engagement.\nPhase II will mature technologies demonstrated in Phase I and integrate them into a TRL 6 prototype.\nWe will define detailed test cases and perform comprehensive validation.\nWe will obtain an Interim Authority to Test (IATT) from AFRL ITS and deploy the prototype in AFRL environment.\nPhase II will prove the dynamic KG toolset’s efficacy using representative conditions and realistic data.\nPhase II will be followed by commercialization in Phase III.\nWe will establish partnerships and collaborations with relevant stakeholders.\nWe will mature the dynamic KG toolset to TRL 8.\nPhase III work will include development of help files and how-to videos to ensure fast adoption of the dynamic KG toolset.\nWe will work with the AFRL ITS to obtain an Interim Authorization to Operate (IATO).\nWe will deploy the dynamic KG toolset in AFRL environment and test using real data.\nWe will leverage our robust TRL 9 codebase to accelerate development.\nWe will jumpstart development in each phase from our latest code repositories.\nIn Phase III, we will transition the dynamic KG toolset code to COTS development practices.\nWe will support users and maintain the dynamic KG toolset using our mature COTS agile development processes.\nWe will support three configurations for delivering the dynamic KG toolset.\nA low-cost cloud-based SaaS will attract small businesses.\nTo drive adoption, we will offer a free trial subscription to students and not-for-profit organizations.\nFor enterprise and government clients, we will provide an on-premise installation with high security and guaranteed performance.\nWe have established marketing and sales processes to aid commercialization, using both direct and indirect sales strategies.\nWe participate in conferences and publish papers to reach a wide audience.\nOur COTS software will serve as a beachhead for sales.\nOur industry partners, existing customer base, and executive relationships will ensure successful commercialization and jumpstart sales.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.",
        "6": "Addition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: Knowledge Graphs, LLM, GNN, Graph Language Models VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\n3.\nDuring the performance of the contract, the research/research and development will be performed in the United States.\n67.2% 32.8% YES YES 4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\n8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES YES NO NO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES",
        "7": "certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\n15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nYES NO 16.\nWhat percentage of the principal investigators total time will be on the project?\n25% 17.\nIs the principal investigator socially/economically disadvantaged?\n18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES NO Partners: Partner Name Vanderbilt Univesity Partner Type University Point of Contact Tyler Derr VOL I - Contact Information Principal Investigator Name: Dr.\nSandeep Mehta Phone: (818) 694-3944 Email: smehta@inspird.com Address: 24261 Chrisanta Ave , Mission Viejo, CA 92691 - 1111 Corporate Official Name: Dr.\nSandeep Mehta Phone: (818) 694-3944 Email: smehta@inspird.com Address: 24261 Chrisanta Ave , Mission Viejo, CA 92691 - 1111 Authorized Contract Negotiator Name: Dr.\nSandeep Mehta Phone: (818) 694-3944 Email: smehta@inspird.com Address: 24261 Chrisanta Ave , Mission Viejo, CA 92691 - 1111 Form Generated on 10/28/2024 04:03:20",
        "8": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph 1 Identification and Significance of Problem In an era where data is abundant yet fragmented, the need for cohesive analytical frameworks has never been more critical.\nKnowledge Graphs (KGs) have emerged as a transformative solution for the Air Force, facilitating situational awareness, pattern of life analysis, threat detection, targeting operations, and more.\nBy integrating diverse data sources into a unified schema, KGs allow for comprehensive analytics of complex scenarios.\nHowever, as operational landscapes evolve, so too must the KGs.\nPeriodic updates — ranging from user addressing corrections to inconsistencies, identifying information gaps, and refining the underlying ontology —are essential to maintain KGs.\nConventional approaches for KG maintenance are labor­ intensive, computationally expensive, and need custom information extraction tools.\nFigure 1: Illustrative User Interface for Dynamic, Interactive KG The integration of Large Language Models (LLMs) has the potential to enable dynamic and adaptive KGs.\nEntities and relationships in KG tuples can be represented as text.\nLLMs (both encoders and decoders) excel at processing and interpreting vast amounts of text, allowing them to extract relevant entities and relationships that can be continuously incorporated into Knowledge Graphs.\nThese dynamic knowledge graphs (DKGs) enable continuous updates, determine knowledge gaps, and update connections, or suggest corrections.\nHence, DKGs improve accuracy and agility, ultimately leading to improved situational awareness and operational effectiveness.\n[blue text are hyperlinks to references] However, despite their transformative potential, the adoption of LLMs has been slow, with only 5% of organizations integrating them into products.\nKey barriers to LLM adoption include inadequate security, accuracy, and reliability.\nSecurity is challenging because LLMs are known to have vulnerabilities such as sensitive data leakage or data poisoning.\nAccuracy is impacted by limitations in processing domain­specific jargon.\nReliability is impacted by biases such as hallucinations (grammatically correct but factually false text).\nAdditional tools are required to protect information or higher classification levels due to data aggregation.\nApproaches are needed to help LLMs access external sources of data, when needed.\nTable 1: Summary of Proposed Innovations, Team Capabilities, and Commercialization Plan Proposed Innovations Inspird Differentiators • World­record Technical Language Processing (jargons) • LLM Graph Language Models and Graph Neural Networks • LLM Encoders for secure KG processing and updates • AI Specialized Language Model for Gen AI KG processing • AI Agents for accessing dynamic data and computations • 5+ years of LLM expertise & proven codebase • Direct AFRL/RI KG development experience • Direct AF situational awareness experience • 10+ years building complex enterprise apps • Successful DoD ITS code review and ATO Commercialization • Track record of high­SBIR value delivery and tech transition • Detailed commercialization plan and existing customer relationships • Mature commercial agile development processes and AI implementation pipeline Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume 1",
        "9": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph We will leverage our proven technologies and over 5 years of LLM productization experience to address these challenges.\nProf.\nTyler Derr is leading KG expert and has direct experience working on KGs at AFRL/RI.\nMr.\nDePierre is a USAF veteran and former AF Nuclear Weapons Center operational officer.\nOur expertise and experience will ensure usability, reliability, accuracy, and performance (Table 1).\n2 Technical Objectives Interactive Knowledge Graph Application We will deliver a comprehensive toolset (Figure 2) for dynamic and interactive updates to Knowledge Graphs (KGs).\nWe will address very large KGs comprising of a variety of entities, including objects, events, situations, or concepts.\nOur solution features an intuitive user interface designed to allow users to review and update KGs without requiring specialized training.\nWe will help the USAF maintain an up­to­date and robust KG, enabling comprehensive insights and data­driven decision­making.\nOur situational awareness experience with the AFNWC will drive usability and commercialization.\nDynamic Knowledge Graph Updates Correction, Completion, & Schema Reshaping Figure 2: Dynamic Interactive KGs Toolset AI Technical Language Processing Finetuning & Packaging Agents Key functionalities will include automatic KG updates and change propagation for entity or relationship modification and periodic automated updates for inconsistencies and information gaps (Figure 2).\nOur algorithms will be exercised iteratively to dynamically propagate changes across the KG, keeping the ontology synchronized and consistent (Objective 1).\nOur custom Technical Language Processing (TLP) toolkit (Objective 2) will underpin the toolset and provide the necessary accuracy, reliability, and performance.\nA set of encoder LLMs will enable Graph Neural Networks (GNNs) and Graph Language Models (GLMs).\nWe will also consider Generative AI (Decoder)­assisted automation.\nTLP LLMs will integrate proven fine­tuning approaches to improve accuracy and minimize biases.\nWe tailor LLMs to use USAF terminology and abbreviations.\nInnovative algorithms will satisfy security requirements (e.g., IL­5) and eliminate vulnerabilities such as data leakage or data poisoning that plague our competition.\nAdvanced packaging algorithms will ensure performance and enable containerization.\nIn future phases, Agents will support access to dynamic data sources and facilitate extensibility.\nWe will also optimize LLMs for temporal and geospatial information processing.\nWe will explore Vision Language Models and Large Multimodal Models for improving the support for different types of entities.\nOur proven codebase and 5+ years of LLM productization experience will ensure success (Table 1).\nWe will deliver a state­of­the­art cloud­capable application (Objective 3).\nWe will build a web portal with a GUI to facilitate intuitive user interactions.\nA robust server will provide access to the toolset and connect with other AF tools.\nOur state­of­the­art vector databases will provide reliable storage for the KG.\nOur extensive codebase and enterprise applications experience will ensure success (Table 1).\nSubsections below provide details of technical objectives, our innovations, and their feasibility.\nIn Phase I, we will collaborate with AFRL/RI to identify use cases, define requirements, and generate associated workflows.\nWe will build and deliver a Proof of Concept (POC) of the DKG toolset demonstrating feasibility and efficacy.\nWe will leverage the publicly available NBATransactions dataset for the POC.\nWe will translate each capability demonstration to USAF utility.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume 2",
        "10": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph KG Correction KG Completion Schema Reshaping Dynamic Embedding Update Graph Language Models Vector Databases Graph Neural Networks TLP Encoder GenAI KG Completion TLP Specialized LM Objective 1: Dynamic Knowledge Graph Updates Figure 3: Dynamic Knowledge Graph Updates Innovations We will implement cutting­edge algorithms to dynamically update KGs for manual KG modifications or automatic anomaly detection (Figure 3).\nThe KG correction algorithm will efficiently propagate changes across the KG (Figure 4), without disrupting its overall integrity.\nKG Completion will correct for missing entities or relationships to improve accuracy.\nSchema Reshaping will automatically adjust the ontology to accommodate data changes.\nEntity disambiguation algorithms will be implemented to correct ambiguous or duplicate nodes after changes.\nUpdating large­scale knowledge graphs dynamically poses significant computational hurdles.\nTraditional graph algorithms often require recomputing the entire graph structure when changes occur, which is computationally expensive for large graphs.\nIntegrating new information from diverse sources while preserving existing knowledge is complex.\nDetecting and resolving inconsistencies or conflicts introduced by updates requires sophisticated mechanisms.\nHandling the temporal nature of dynamic updates adds another layer of complexity.\nUpdating embeddings without full retraining is difficult, as changes can significantly affect the learned representations.\nWe will integrate KGs with LLMs to enable accurate, scalable, and reliable KG updates (Figure 3).\nWe will represent the KG with embeddings ­ head, relation, and tail.\nWe will use LLMs to initialize embeddings of textual nodes with inherent semantics.\nThe KG embeddings will be generated using message passing to exchange and aggregate information from neighbors.\nWe will utilize GNN­and GLM­based approaches to compute KG embeddings and underpin KG updates.\nLLMs will also be employed to improve disambiguation.\nAdditional algorithms will be implemented for efficient embedding updates.\nSubsections below describe our innovations, their feasibility, and Phase I deliverables.\nInnovations KG Correction We will develop an innovative correction mechanism for KG updates that utilizes GNNs and GLMs.\nBoth approaches capitalize on the powerful transformer self­attention mechanism to capture dependencies within graph data and effectively reason over graph structures while providing a systematic process for updating the KG.\nWe will develop these approaches to specifically target situations where nodes or relationships are modified (Figure 4).\nThe workflow begins by accepting an analyst’s modification, followed by extraction of a subgraph surrounding the affected node or relationship.\nOnce the subgraph is extracted, it will be passed through Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume 3",
        "11": "Change Add tuple Dequeue Change Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph Legend: Entity in text Relationship in text Entity encoded Relationship encoded KG Local Subgraph Extraction Local KG Subgraph Global KG Encoded Local KG w/o change Encoded Local KG w/ change i s g n d d e b m E o t t x e T M L L d e n u t ­ e n F i … Tree of Changes Add All entity pairs & scores GNN­based Relationship Scoring All entity pairs & scores Add Remove … … (e.g., Low to High (& no edge) → Add ) High to Low (& edge) → Remove ) (e.g., … KG Update Queue Enqueue initial user analyst change: Add Update the Tree of Changes, Global KG, and Queue Enqueue: Add & Remove Note: We collapse all relationships to just one here for visualization simplicity, but scoring is a distribution across all relationship types.\nFigure 4: KG Correction Given an Analyst’s Modification our fine­tuned LLM encoder to convert the text representations of the entities and relationship names (and possibly additional context) into node and edge representations.\nThereafter, two versions of the subgraph will be formed, one that includes the change and one without.\nBoth will be passed through a GNN­based model to obtain relationship scores/probabilities for all pairs of nodes within the subgraphs.\nThese will then be used to determine inconsistencies between the subgraph with and without the change.\nAs seen in Figure 4, if an edge had a high score before the change within the local subgraph and then had a low score, this suggests that the likelihood that this relationship within the KG is no longer valid (e.g., pair e3, e2).\nSimilarly, if a previously non­linked pair of entities had a low score before the change and then has their score significantly increase (e.g., pair e1, e3), it suggests that this relationship is likely an addition to be made/suggested to the KG analyst.\nOnce the set of modifications are identified, they are added to a queue that will investigate each potential change independently recursively following the workflow in Figure 4.\nThe suggested changes made to the KG analyst will be presented in the form of a Tree of Changes.\nThis will provide the logical flow of changes starting from those that are one hop away and increasing iteratively throughout this process.\nWhile in Figure 4 we show a two­hop neighborhood subgraph extraction, we will also explore more advanced techniques.\nFor example, once the subgraph is extracted, it will be converted into a tree, with the modified node or relationship placed as the root.\nThe tree structure will be simplified by removing cycles, eliminating multi­parent connections, and flattening complex edges.\nThis conversion transforms the graph into a hierarchical structure, making it easier to analyze the impact of the KG updates.\nTo correct anomalies, we will apply recursive message passing techniques (GNNs) and relative position matrices (GLMs), starting with one­hop suggested changes.\nFor deeper relationships (e.g., a two­hop change), the model will recursively suggest updates further down in the tree.\nThe recursive nature of this process allows for hierarchical suggestions, where the impact of one­hop changes informs subsequent updates.\nFor instance, if a two­hop change is highly probable based on the one­hop update, it will be Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume 4",
        "12": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph ranked higher than a less likely one­hop change.\nThis ranking can be determined by multiplying edge weights along the path, where the overall probability of a change is the product of the weights from the root to the specific node.\nThis approach also allows for expert intervention.\nAfter the model suggests changes and ranks them, human experts can manually inspect the tree and prune branches containing unnecessary updates.\nThis combination of automated GNN­driven suggestions and manual oversight ensures that only the most relevant updates are retained, enhancing both the accuracy and practicality of the system.\nIn Phase I, we will assume that updates are independent—meaning changes to different parts of the tree are treated separately.\nHowever, in future phases, models will be adapted to handle dependencies between updates, where the likelihood of one change affects others in the graph.\nThis more advanced model will account for interrelated updates and improve the overall consistency of the KG.\nIn Phase I, we develop and evaluate KG correction tools.\nWe will deliver at least one candidate tool for integration in to the POC and for full development in Phase II.\nKG Completion We will implement a robust method for KG completion using pre­trained encoder LLMs.\nSpecifically, we will treat entities, relations, and triples as textual sequences, transforming the task of KG completion into a sequence classification problem.\nBy representing these components as text, we will be able apply GLMs/GNNs to the problem.\nGLMs/GNNs will predict the plausibility of a given triple or relation.\nThis approach is expected to deliver strong performance across various knowledge graph completion tasks, leveraging the power of language models to understand and predict the structure of the graph.\nIn Phase I, we research and evaluate KG completion methods for efficacy and integrability with our KG update stack.\nWe will deliver a report outlining results and a list of methods for development in Phase II.\nKG Schema Reshaping We develop and evaluate an innovative schema reshaping algorithm that updates the predefined KG schema into a more data­oriented version, eliminating blank nodes while still preserving crucial elements from the original domain schema.\nIn future phases, we will develop a query reshaping module that adapts queries written for one KG schema to function seamlessly with the reshaped KG schema.\nThis ensures a uniform querying experience, regardless of schema variations.\nThe resulting KG will be both more efficient and user­friendly due to their optimized structure.\nBy eliminating blank nodes, our tools will reduce storage and processing overhead and accelerate querying.\nIn Phase I, we will research and evaluate schema reshaping algorithms for efficacy in our KG update tech stack.\nWe will deliver a report outlining results and a list of methods for development in Phase II.\nDynamic Embedding Updates This process of updating embeddings for KG changes is time­consuming and often necessitates retraining downstream models that rely on these embeddings.\nWe explore methods for updating embeddings that eliminate the need for complete retraining.\nWe will focus on strategies that position newly introduced nodes using local information.\nWe design approaches for continuing the training of the existing embedding, while interspersing it with epochs dedicated solely to optimizing the newly added or removed nodes and edges.\nWe will ensure that the new approach produces higher­quality embeddings faster than full retraining, enabling more efficient dynamic KG environments.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume 5",
        "13": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph In Phase I, we will research dynamic embedding update algorithms for efficacy in our KG update stack.\nWe will deliver a report outlining results and a list of methods for development in Phase II.\nGraph Neural Networks We will implement GNNs that incorporate encoder LLMs (transformers), often referred to as Graph Transformers (GTs), to under pin KG update methods.\nThese models combine the strengths of GNNs in capturing local graph topology with the transformer's ability to model long­range dependencies.\nGTs typically extend the self­attention mechanism to operate on graph­structured inputs, allowing nodes to attend to their neighbors or even the entire graph.\nWe will overcome limitations of traditional GNNs, such as over­smoothing and over­squashing.\nIn Phase I, we will leverage our TLP stack (Objective 2) to build a GNN optimized for the POC.\nOur 5+ years of LLM development experience will ensure success.\nGraph Language Models (GLMs) We will explore the application GLM architecture for KG updates.\nGLMs synergize the strengths of both LLMs and GNNs while overcoming their respective weaknesses.\nPublished results show that GLM consistently outperforms traditional LM and GNN baselines, highlighting its versatility and effectiveness across various scenarios.\nIn Phase I, the GLM will be initialized with parameters from a pretrained TLP Encoder, allowing for a deeper comprehension of individual graph entities and relations.\nFurthermore, the GLM's architecture will be enhanced to integrate graph­specific biases, optimizing the representation and flow of knowledge throughout the graph.\nAs a result, GLMs can seamlessly process graphs, textual data, and hybrid inputs consisting of both.\nWe will integrate the GLM in Phase I POC and demonstrate efficacy.\nGen AI Knowledge Graph Completion Depending on challenges faced by encoder­based algorithms we will explore innovative methods to use generative AI and decoder LLMs.\nWe will integrate structural data into decoder LLMs, with the primary objective of enabling structure­aware reasoning.\nWe will utilize LLM techniques such as in­context learning and instruction tuning and foundational approaches for injecting structural information into LLMs.\nWe will incorporate a specialized structural pre­training phase, which will enable the model to grasp complex entities and relationships within KGs and encode them as structural embeddings.\nThese structural embeddings will drive KG updates through schema reshaping, relationship predictions, and KG completions.\nWe will leverage TLP SLMs for GenAI KG completion – improving accuracy, security, memory footprint, and performance.\nIn Phase I, we will research Generative AI­based KG update algorithms for efficacy in our KG update stack.\nWe will deliver a report outlining results and a list of methods for development in Phase II.\nFeasibility and Efficacy Professor Derr is a leader in AI KG toolset development and has direct experience working on KG at AFRL/RI.\nWe will leverage this expertise and experience to ensure success.\nWe have identified several published peer­reviewed techniques for each KG update tool and also accessed associated permissive open­source code.\nWe will leverage Inspird’s proven in­house codebase and over 5 years of LLM productization experience to integrate and deliver these technologies.\nAdditionally, we have a history of high SBIR value delivery.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume 6",
        "14": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph Objective 2: Technical Language Processing (TLP) Toolkit TLP Encoder Our custom TLP toolkit (Figure 5) will underpin the interactive, dynamic knowledge graph application.\nTLP provides a full stack of synergistic AI models that enable advanced KG updates and scalability.\nOur world­record TLP Encoder will enable GLMs and GNNs.\nOur state­of­the­art Specialized Language Models (SLMs) will provide an alternate KG update technology path.\nComprehensive fine­tuning approaches will be integrated to optimize models for graph updates and package them for use in the DKG toolset.\nIn future phases, agents will integrate external sources of data.\nFigure 5: TLP Toolkit Underpins the DKG TLP Specialized LM Finetuning & Packaging AI Dictionary Vector Databases Agents The TLP toolkit overcomes challenges faced by traditional LLM tools in meeting requirements of the dynamic, interactive KG toolset.\nConventional LLMs need enormous compute resources and server farms to deploy, often requiring high­speed internet access, which raises information security concerns.\nThe TLP toolkit is designed to support network isolation and secure operation.\nFurthermore, conventional LLM vocabularies model only a small subset of domain­specific terms.\nIn fact, these vocabularies contain only ~20,000 of the ~400,000 English words.\nWhile the LLM tokenizer’s subword formulation allows high­level answers using non­vocabulary words, the quality of text processing declines significantly.\nAnother challenge is the limited availability of data to train domain­specific and objective­specific models.\nSubsections below describe our innovations, their feasibility, and Phase I deliverables.\nInnovations TLP Encoder TLP Encoder will generate numeric representations of KG tuples and text semantics when available.\nThese embedding vectors support KG update approaches such as GLM and GNN.\nTLP Encoder begins with a state­of­the­art Encoder Large Language Model, whose vocabulary is modified to integrate domain terms identified by the AI TLP dictionary.\nUnsupervised fine­tuning will help TLP Encoder learn domain context.\nSupervised fine­tuning approaches will be implemented to enhance KG processing and update accuracy.\nNovel semantic densification and adaptive masking algorithms address the training data scarcity.\nTLP Encoder is inherently secure against information leakage and robust against biases such as hallucinations or myopia.\nTLP Encoder achieved world record performance on benchmarks (CoLA, QQP, and MNLI).\nIn Phase I, we will deliver one TLP Encoder optimized for the dynamic KG POC.\nOur proven codebase and experience will ensure development success.\nTLP Specialized Language Models (SLM) Domain­optimized AI TLP SLMs will enable KG updates.\nThe SLM will exceed the accuracy of very large LLMs (e.g., ChatGPT­4) for the target domain by eliminating unnecessary skills (e.g., multilingual support).\nMore importantly, SLMs will integrate with the rest of the TLP toolkit to enhance security and reliability, while minimizing resource needs.\nWe will build SLMs by updating their vocabulary with the TLP Dictionary.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume 7",
        "15": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph Unsupervised and supervised fine­tuning will enhance accuracy for KG updates.\nIn future phases, a suite of SLMs will be developed, each optimized for different aspects of KG updates.\nIn Phase I, we will demonstrate the ability to optimize SLMs for the dynamic KG application.\nOur proven codebase and 5+ years of LLM productization experience will ensure success.\nLLM Fine­tuning and Packaging Robust algorithms will be implemented to fine­tune and optimize LLMs used in the TLP stack for KG use.\nFine­tuning LLMs is complex because it can lead to the model forgetting pretrained knowledge.\nTLP Encoder and SLMs will be built by updating the base LLM vocabulary with the TLP Dictionary discovered terms.\nUnsupervised fine­tuning with domain­specific repositories will accurately model semantics in the selected domain.\nAdditional supervised fine­tuning will optimize TLP for KG updates.\nBase LLM Training Corpus Domain Data Pre­ training Unsupervised Finetuning Supervised Finetuning Accurate TLP LLM r e f s n a r T i g n n r a e L r e f s n a r T i g n n r a e L Technical Dictionary Figure 6: Proven TLP Fine­tuning Approach Parameter efficient fine­tuning and Low Rank Adaptation (LoRA) will accelerate fine­tuning.\nNovel algorithms will ensure fine­tuning does not destroy foundational model learning.\nApproaches such as Direct Preference Optimization (DPO) will improve content quality and reduce user curation load.\nSynthetic data generation will maximize the benefit from any authoritative data or domain­specific text.\nA variety of compression methods will be integrated to decrease model memory footprint and increase inference speed, while minimizing accuracy loss.\nThese methods include distillation, quantization, and structured and unstructured pruning.\nQuantization will reduce model memory footprint and performance without greatly impacting accuracy.\nUnstructured and structured pruning will construct sparse models and reduce model size.\nReduced model size will ensure adequate performance on portable devices.\nIn Phase I POC, we will leverage our mature codebase and demonstrate Encoder fine­tuning and quantization.\nIn future phases, we will implement a full suite of compression and optimization tools.\nAI Dictionary Generating LLM vocabularies manually is cost prohibitive, especially with evolving terminologies.\nTLP will automatically generate a dictionary (Figure 7) of any domain’s terminology and abbreviations.\nTLP will ingest available dictionaries and glossaries and automatically discover additional terms by scanning available repositories.\nFrequently used terms will be integrated into the LLM vocabularies to improve accuracy.\nThe dictionary will allow different expansions for the same abbreviation.\nFor example, depending on context, the term LOC may mean location, local, line of control, line of contact, etc.\nIn Phase I POC, we will leverage our mature codebase and demonstrate dictionary generation for representative USAF data.\nIn future phases, we will optimize AI models for the dynamic KG application.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume 8",
        "16": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph Agents Figure 7: Inspird's Proven AI Dictionary In future phases, LLM agents will be implemented to support tool usage.\nTools will allow simple integration of external data sources and streaming data into the knowledge graph.\nIn future phases, agent Reflection will be implemented to evaluate and improve update quality.\nFeasibility and Efficacy We will ensure successful development of KG update toolset using proven in­house codebase, robust open­source code, and over 5 years of LLM productization experience.\nWe have a mature codebase for the TLP Encoder and vector database.\nTLP Encoder achieved world record performance on three benchmarks (CoLA, QQP and MNLI) – beating industry giants such as Google and Microsoft with models 10X larger.\nWe have developed unique approaches for updating, fine­tuning and deploying generative AI SLMs.\nWe have built a trusted in­house curated training corpus to train TLP.\nOur training corpus eliminates vulnerabilities such as data poisoning.\nOur commercial tools implement a full ML pipeline that includes data collection, LLM fine­tuning, testing, validation and integration.\nWe have COTS TLP products (Figure 10) for building an Authoritative Source of Truth for global aviation and medical device regulations.\nWe have demonstrated the ability to semantically process tens of millions of lines in less than 1 second on desktop­class computers.\nWe initially developed TLP under a USAF Digital Airworthiness SBIR.\nTLP was further matured under commercial funding.\nTLP was proven under DARPA Smart Model Repository and MDA Authoritative Source of Truth SBIRs.\nOur codebase, skills, and experience will ensure successful delivery of Objective 1.\nObjective 3: Interactive Knowledge Graph Update Application Our KG update solution will be delivered as a modern web­based and cloud­capable tool (Figure 8).\nA user web portal will allow intuitive access to artifacts.\nAn AI search engine will be integrated to help users quickly navigate to the node of interest.\nAn administration web portal will enable security, access control and maintenance of the toolset.\nA server will provide secure access to the data.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume 9",
        "17": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph All data will be stored in an industry­standard database with a robust, extensible schema.\nThe database will support compartmentalization and segregating data into distinct compartments based on the principle of least privilege.\nWe will architect the database for multi­level security and ensure that the database does not contain data that exceed classification rulesets by compilation.\nWeb Portals REST API Server AI Dynamic KG Updates Network TLP Fine­tuning Packaging Vector Databases Compute & Storage In Phase I, we will design a web portal to demonstrate user interaction with the knowledge graph.\nWe will design a state­of­the­art vector database to support the POC and store the open­source data.\nWe will design the application for prototype development in Phase II.\nWe leverage over a decade of experience developing enterprise applications, data curation, security, and access control, along with our proven codebase to ensure success.\nFigure 8: KG Update Toolset Architecture 3 Phase I Statement of Work Phase I will define use cases and architectures, identify candidate AI models, and validate usability.\nWe will build a POC, demonstrate feasibility, and engage AFRL/RI stakeholders in prototype design for Phase II development.\nSubsections below provide details: Tasks 1 2 3 4 5 6 Task 1: Develop use cases and design Phase 1 demo Task 2: Develop dynamic KG update tools (Objective 1) Task 3: Demonstrate the TLP stack (Objective 2) Task 4: Build the Phase 1 strawman proof­of­concept Task 5: Design the software for Phase II development Task 6: Program + risk management and commercialization Milestones: Reports and Deliverables Task 1: Develop use cases and design Phase 1 demo Figure 9: Phase I Schedule ♦ ♦ We will define a set of use cases for the dynamic interactive KG toolset.\nWe will build on our team member Kyle DePierre’s experience as a veteran USAF officer to address user needs.\nWe will perform a literature review to identify leading­edge frameworks and add to use cases.\nWe will work Prof.\nDerr, a leader in the field of knowledge graph.\nWe will work with the TPOC to refine use cases.\nIf desirable for AFRL/RI, we will survey stakeholders to identify user needs.\nWe will aggregate use cases and build related workflows.\nThese use cases and associated workflows will drive Phase I tasks.\nWe will design a demonstration POC around the use cases and workflows that prove dynamic KG update feasibility and efficacy in Phase I.\nWe will build training and demonstration data repository to support the POC (NBATransactions).\nWe will work to gather additional representative open­source data, if necessary.\nWe will generate synthetic data to supplement open­source data, if required.\nWe will incorporate any AFRL/RI info, if available.\nWe will develop realistic evaluation sets to measure and prove KG update effectiveness in actual use.\nThese evaluation sets will prove accuracy, reliability, bias mitigation, and safety.\nDevelopment of Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume 10",
        "18": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph evaluation sets is a critical, hard, and frequently overlooked task in LLM tool development.\nWe will strategically incorporate human evaluation to improve efficacy.\nWe will develop comprehensive sets of metrics to measure accuracy, reliability, and quality.\nPerformance metrics will include latency, throughput, time per output token, etc.\nThe deliverables for this task will include use cases, workflows, training data, evaluation sets, and metrics.\nWe will also deliver a report outlining progress and lessons learned.\nTask 2: Develop dynamic KG update tools (Objective 1) We will collaborate with AFRL/RI to refine dynamic KG update requirements, if needed.\nWe will develop cutting­edge algorithms to dynamically update KGs for manual KG modifications or automatic anomaly detection.\nWe will leverage Vanderbilt’s R&D and peer­reviewed work.\nWe will implement algorithms for subgraph extraction based on user modification.\nWe will use GNN/GLM to identify inconsistencies in the modified KG and identify suggested changes using recursive message passing (GNNs) and relationship matrices (GLMs).\nWe will demonstrate subgraph to tree conversion to visually present proposed changes to the user.\nThe deliverables will include a set of candidate models for the POC (Task 4).\nWe will select and optimize GNNs and GLMs for KG correction.\nWe will utilize our proven TLP stack (Task 3).\nThe TLP encoder will underpin Graph Transformers for both the GNN and GLM­based approaches.\nWe will update, fine­tune and optimize the TLP encoder for each approach (Task 3).\nThe deliverables will include In Phase I, we research and evaluate several algorithms for efficacy and integrability with our KG update stack.\nThese algorithms will include KG Completion, KG Schema Reshaping, Dynamic Embedding Updates, and Gen AI KG Completion.\nThe deliverables for this research will be a set of candidate models for development in Phase II (Task 5).\nWe will also deliver a report outlining progress, lessons learned, and requirements for Phase II prototype development.\nFigure 10: TLP Toolkit Enables Inspird's COTS Authoritative Source of Truth (ASoT) Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume 11",
        "19": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph Task 3: Demonstrate the TLP stack (Objective 2) We will collaborate with AFRL/RI to refine Dynamic KG LLM requirements, if needed.\nWe will select candidate AI models that best satisfy user needs defined in Task 1 and technical requirements in Task 2.\nWe will leverage our proven codebase and use well­supported open­source models with permissive licenses as a backup.\nWe will develop and evaluate USAF domain specialization approaches.\nWe will demonstrate dictionary generation and vocabulary formulation.\nWe will update selected TLP Encoder with the vocabulary.\nWe will implement approaches to rapidly fine­tune TLP Encoder.\nWe will perform supervised fine­tuning.\nWe will optimize TLP Encoder to produce 90% precision and recall for retrieval.\nWe will optimize SLM for text quality metrics defined in Task 1.\nWe will evaluate and select approaches for packaging AI models for use in the dynamic KG toolset.\nWe will identify approaches to build an ML pipeline that can automate AI model fine­tuning and packaging in Phase II.\nOur proven codebase and 5+ years of LLM productization experience will ensure success.\nThe deliverables for this task will be a set of fine­tuned models for the POC (Task 4).\nWe will also deliver a report outlining progress, lessons learned, and requirements for Phase II prototype development.\nTask 4: Build the Phase 1 strawman proof ­of­concept Under this task, we will integrate various elements of the dynamic KG toolset to demonstrate the efficacy of technologies developed in Phase I.\nWe will leverage available KG visualization components for the Phase I POC.\nWe will deploy the POC on our servers and show the ability to satisfy user needs defined in Task 1.\nWe will perform extensive testing and generate metrics.\nWe will demonstrate effectiveness against evaluation sets.\nWe will document lessons learned and plan further development in Phase II.\nWe will leverage Mr.\nKyle DePierre’s direct USAF work experience to translate POC results into situational awareness benefit.\nWe will review results with AFRL/RI stakeholders and industry partners and incorporate their feedback in Phase II development plan (Task 5).\nThe deliverables will include the POC and a report.\nTask 5: Design the software for Phase II development We will design the dynamic KG toolset for prototype development in Phase II.\nWe will ensure that the dynamic KG toolset design satisfies all use cases identified in Task 1.\nWe client and an will design a mobile leverage administration portal.\nWe will frameworks such as D3.js to design best­in­ class GUIs (Figure 11).\nWe will design a state­ of­the­art vector database to support the POC.\nWe will leverage our extensive data curation, knowledge base development, security, and access control, along with our extensive codebase to ensure success.\nFigure 11: Inspird's Cutting­edge COTS GUI We will design a cloud­friendly secure server.\nThe server will be designed to be extensible, scalable, and with cybersecurity/IA necessary to run in the DoD intranet (DEVSECOPS 2.0).\nInspird’s proven client Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume 12",
        "20": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph and server code will provide an effective foundation for the dynamic KG toolset development.\nWe will leverage the Phase I POC to gain stakeholder feedback and incorporate it into the prototype design.\nWe will integrate ITS into the development plan with gradual progression from Interim Authority to Test (IATT) to Interim Authority to Operation (IATO) and full Authority to Operate (ATO).\nInspird has successfully gone through a full DoD IT security source code review for our COTS software and received an ATO.\nThe lessons learned will ensure successful software delivery and commercialization.\nThe deliverables for this task will include Phase II prototype requirements and metrics to demonstrate the dynamic KG toolset value.\nWe will also deliver a report outlining progress and lessons learned.\nTask 6: Program + risk management and commercialization We will undertake tasks of technical project management.\nWe will ensure adherence to the project schedule and fulfillment of contract requirements.\nThe program manager will have intimate knowledge of all aspects of the dynamic KG toolset development.\nWe do not anticipate extraordinary risks in Phase I.\nWe have identified alternate technology development paths and published research that we can leverage in Phase I.\nWe will use agile development methods to enhance development and minimize risks.\nWe have an active DD­2345 from the DLA and processes in place to control CUI and ITAR information.\nWe will work with AFRL/RI stakeholders for commercialization.\nWe will gain participation from additional DoD agencies in Phase II.\nWe will engage with our industry partners on the dynamic KG toolset commercial needs.\nWe will define broader use cases in large defense, automotive, and public safety industries (See the Commercialization section for details).\n4 Related Work Inspird has been building state­of­the­art applications that integrate AI and Engineering for over a decade.\nOur ongoing R&D and competencies (Figure 12) are directly applicable to the proposed effort.\nTechnical Language Processing For over 5 years, we have been developing technologies for accurate semantic processing of text with jargon and abbreviations.\nWe have launched COTS TLP products to build an authoritative source of truth for global airworthiness regulations (Figure 10).\nWe have developed tools to automatically build a tech terminology dictionary.\nOur COTS products use AI to parse PDFs and extract document structure.\nWe have developed small, robust, and secure SLMs for use in technical text generation.\nfrom We are developing TLP products to answer questions such as papers, repositories publications, and patents.\nWe are developing AI models to build, extend, and enhance ontologies and knowledge graphs.\nWe have built accurate AI text, AI classifiers technical summarizers for large technical documents and simulations, and AI meta­analysis tools to summarize numerical data.\nOur TLP tools have been proven on USAF, MDA, Navy, and DARPA SBIRs.\ncategorizing for Efficient Web Portals Intuitive Data Visualization Secure Servers Big Data Tools Deep Learning Cloud Computing Figure 12: Inspird Core Competencies Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume 13",
        "21": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph Vision Language Models (VLMs) and Large Multimodal Models (LMMs) We have been researching VLMs combine visual (images, videos) and textual data to enable tasks like visual question answering and semantic image retrieval.\nIntegration of VLMs into the dynamic KG toolset will improve its utility, decision­making, and contextual understanding.\nDigital Engineering R&D We have been developing COTS tools to manage Digital Engineering Ecosystems for over a decade.\nOur R&D on cross­enterprise collaboration is directly applicable to the proposed effort.\nWe have extensive experience with managing multidimensional taxonomies and have helped many large organizations develop portfolio architectures.\nWe will leverage our practical experience to accelerate development.\nAnother active area of R&D for us is the use of AI to accelerate Digital Engineering.\nWe are developing AI methods to enhance model reuse and accelerate analytics under DARPA Semantic Model Reasoning Technologies and MDA Innovative Automated Analytics SBIRs.\nSoftware Development Competencies We have over a decade of experience developing enterprise software.\nOur COTS products are supported by broad software development competencies including big data, cloud computing, and secure servers.\nOur software is used by diverse users including DoD primes such as Northrop Grumman.\nWe are actively developing innovative web portals.\nWe continue to make significant investments in data science for intuitively presenting complex information in a decision­ready format.\nWe have successfully obtained a DoD ITS ATO and deployed our COTS tools on the DoD intranet.\nWe will use our COTS agile development and ensure successful development and long­term supportability.\nVanderbilt University Network and Data Science Lab The Network and Data Science (NDS) lab is a leader in knowledge graphs (KGs) and question answering.\nNDS also developed an LLM­based KG traversal agent to intelligently retrieve question­relevant contexts by navigating the constructed KG.\nThe agent was fine­tuned to adaptively traverse the most promising neighbors within the surrounding subgraph, based on the context of already collected information and what it deemed necessary to complete the question answering task.\nThis work earned the Best Paper Award at NeurIPS 2023.\nIn their acclaimed work, “Knowledge Graph Prompting for Multi­Document Question Answering,” NDS introduced methods for constructing knowledge graphs from sets of documents.\nNDS’s research on “Augmenting Textual Generation via Topology Aware Retrieval” offered a new perspective on RAG frameworks, moving beyond local proximity­based retrieval.\nNDS equipped retrievers with topological awareness and structural role­based similarity.\nAdditionally, the NDS lab has conducted numerous works in collaboration with industry partners, including Adobe Research, Snap Inc., The Home Depot, and Visa Research, especially in recommender systems.\nIn “Knowledge Graph­based Session Recommendation with Session­Adaptive Propagation,” which constructs a KG according to historical user behavioral data paired with e­commerce domain knowledge to develop a heterogeneous graph transformer­based architecture.\nThis work will be applicable to the proposed effort in providing improved context to an adaptive retriever.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume 14",
        "22": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph Past 2025 2026 2027 2028 2029 Future Dynamic KG Phase I Interactive Dynamic KG Phase II.\nTech Maturation, Integration, Prototype Dev, IATT Interactive Dynamic KG Phase III Transition to PoR, Industry Participation, IATO, ATO COTS Support & Upgrades SBIRs COTS Dev TRL 5 Tech Seminal Transition Event (TRL 6) Seminal Transition Event (TRL 8) TRL 9 Figure 13: Interactive Dynamic Knowledge Graph Toolset Roadmap and Commercialization Plan 5 Relationship with Future Research or Research & Development Figure 13 shows the roadmap and transition plan for the dynamic KG toolset.\nPhase I POC will be followed by prototype development in Phase II, where we will mature technologies and integrate them into a TRL 6 prototype.\nWe will refine the use cases defined in Phase I to cover a broader range of scenarios and questions.\nWe will refine and mature the dynamic KG toolkit.\nPhase II will prove the dynamic KG toolset usability with more realistic KGs and more comprehensive AI models.\nWe will adapt KG correction to handle dependencies between updates, where the likelihood of one change affects others in the graph.\nThis more advanced model will account for interrelated updates and improve the overall consistency of the KG.\nWe will implement a robust method for KG completion using pre­trained encoder LLMs.\nWe implement innovative schema and query reshaping algorithm, that updates the predefined KG schema into a more data­oriented version.\nWe will implement a full suite of LLM compression and optimization tools.\nWe will design agents to support access to dynamic data sources and facilitate extensibility.\nWe will also optimize LLMs for temporal and geospatial information processing.\nWe will explore Vision Language Models (VLMs) and Large Multimodal Models (LMMs) for improving the support for different types of entities.\nWe will optimize the AI dictionary for dynamic KG application.\nWe will implement robust servers, databases, and administration portals to support the dynamic KG toolset in Phase II.\nWe will incorporate DEVSECOPS into the prototype development.\nWe will obtain an Interim Authorization to Test (IATT) to test the dynamic KG toolset prototype in the AFRL/RI IT environment.\nWe will perform extensive testing and validation to ensure the prototype's reliability and effectiveness.\nWe will refine the user interface and experience based on iterative feedback from users.\nPhase II will be followed by commercialization in Phase III.\nWe will establish partnerships and collaborations with relevant stakeholders.\nWe will mature the dynamic KG toolset to TRL 8.\nPhase III work will include development of help files and how­to videos to ensure fast adoption of the dynamic KG toolset.\nWe will work with the AFRL/RI ITS to obtain an Interim Authorization to Operate (IATO).\nWe will deploy the dynamic KG toolset in AFRL/RI environment and test using real data.\nWe will leverage our robust TRL 9 codebase to accelerate development.\nWe will jumpstart development in each phase from our latest code repositories.\nIn Phase III, we will transition the dynamic KG toolset code to COTS development practices.\nWe will support users and maintain the dynamic KG toolset using our mature COTS agile development processes.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume 15",
        "23": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph 6 Commercialization Military and Commercial Application KGs enable a holistic data approach that not only improves decision­making but also enhances mission success and safety across a range of defense and intelligence applications.\nKGs are transformative tools for enhancing situational awareness, pattern of life analysis, threat detection, targeting operations, and more.\nBy integrating diverse data sources—such as sensor outputs, communication logs, geospatial data, and human intelligence—into a semantically rich and interconnected structure, KGs enable a deeper understanding of complex and dynamic environments.\nFor situational awareness, they provide real­time contextualization by linking entities, events, and relationships to offer a comprehensive operational picture.\nIn pattern of life analysis, KGs reveal behavioral patterns and deviations, helping analysts identify unusual activities and assess potential threats.\nThey support threat detection by cross­referencing multiple data points to flag suspicious entities or actions.\nIn targeting operations, KGs facilitate precision by mapping out key assets, affiliations, and locations, helping decision­makers prioritize and assess risks effectively.\nHence, the proposed dynamic KG toolset has broad applicability across the Department of Defense (DoD), including the Army, Navy, Missile Defense Agency (MDA), Space Force, and others.\nAdditionally, it will appeal to various government sectors, such as the Department of Homeland Security and the Department of Energy.\nLocal and state governments, law enforcement agencies, and public safety organizations will also benefit from this system.\nKGs have found widespread commercial applications across various industries, revolutionizing the way businesses handle and utilize data.\nKGs have become an integral part of LLM­based Retrieval Augmented Generation (RAG) tools.\nIn e­commerce, companies like eBay and Amazon have implemented KGs to enhance product recommendations, improve search functionality, and create more personalized shopping experiences.\nSearch engines like Google, Yahoo, and Microsoft have integrated KGs into their platforms to provide more accurate and contextually relevant search results.\nIn the cybersecurity sector, KGs are employed to map system endpoints, identify vulnerable areas, and fill security gaps, thereby strengthening overall network protection.\nThe healthcare industry has also benefited from KGs, using them to establish connections between healthcare professionals, publications, leading to clinical trials, and events, improved patient care and research outcomes.\nAdditionally, KGs are being relationship customer utilized management to gain deeper insights into consumer product behavior, relationships, and marketing strategies.\nOur dynamic, interactive KG tool will have a broad applicability to these segments.\no Document Generation o Automated Engineering o ASoTs and Search o Defense: situational awareness, threat detection, targeting,… RAG Tools $1B – 45% CAGR Figure 14: Market Segments Addressed Knowledge Graph Tools o Business analytics and Intelligence $0.9B – 18% CAGR Problems Segment in Market Size and Marketing Plan This SBIR is developing technologies that target the market segments for KG tools (Figure 14).\nKGs are also applicable to the fast­growing RAG market segment.\nIn 2023, the total market for KG was $2B and is expected to grow to $13B by 2030.\nA key driver for this growth is the availability of LLM tools.\nWe will Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume 16",
        "24": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph target high complexity and accuracy niche within this market.\nWe estimate that the current size of this niche is $50M and growing fast.\nWe will support three configurations for delivering the dynamic KG toolset software.\nA low­cost ($100 per month per user) cloud­based SaaS will attract small businesses and emerging economies.\nTo drive adoption, we will offer a free trial subscription to students and not­for­profit organizations.\nFor enterprise and government clients, we will provide an on­premise installation with high security and guaranteed performance.\nPricing will depend on the specific configuration but is expected to range between $100,000 and $400,000.\nWe have established marketing and sales processes to aid commercialization, using both direct and indirect sales strategies.\nWe participate in conferences and publish papers to reach a wide audience.\nOur COTS software will serve as a beachhead for sales, and our existing customer base will help optimize transition and jumpstart sales.\nBusiness Plan and Funding Requirements Figure 13 illustrates the roadmap and commercialization plan for the dynamic KG toolset.\nThe section on Relationship with Future Research or Research & Development provides a detailed description of the roadmap.\nThe proposed dynamic KG toolset presents a compelling business case, especially with its synergies with our RAG product portfolio (Figure 15).\nWe anticipate needing $1­2M in Phase III funding and expect a timeline of 18­24 months.\nOver the following 5­year period, our goal is to generate over $25M in revenue from government and industry sectors.\nWe plan to supplement these revenues with venture funding, which will help us scale quickly, attract talent, build market presence, and enhance our marketing and sales efforts.\nOur AI subsidiary, tlp.ai, will be instrumental in securing venture funding and driving transition.\nFigure 15: Inspird's Synergistic LLM/RAG Product Portfolio Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume 17",
        "25": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph Company Background and Competition We develop and supply software tools to government and industry alike.\nOur AI RAG tools (Figure 15) are synergistic and complementary to the dynamic KG toolset.\nWe have a proven track record of commercialization, high value delivery, and have generated commercial revenues since the company’s inception in 2012.\nThe DoD has designated Inspird a critical capability provider to secure the Defense Industrial Base and included us in the Trusted Capital Marketplace.\nInspird was recognized by Gartner, a leading IT analysis firm, as a cool vendor in R&D.\nOur customers include military organizations such as the Assistant Secretary of Defense for Research & Engineering and DoD primes such as Northrop Grumman.\nWe have successfully obtained an ATO from DoD and deployed our tools on the DoD intranet.\nWe have extensive experience packaging software and delivery.\nWe have mature processes for agile development and for Cybersecurity Maturity Model Certification (CMMC) / DEVSECOPS 2.0 compliance.\nWe have secure methods for delivering and updating software.\nWe have experience building help files, developing user forums, and deploying support channels.\nWe also have expertise developing training programs and providing implementation services.\nMany organizations, such as Anthropic, Cohere, Google, Meta, and OpenAI are focused on general­ purpose AI.\nOthers are addressing smaller market niches.\nFor example, Contextual is developing general­ purpose RAG and Aitomatic focuses on domain knowledge capture.\nInspird is unique in its integration of accurate, secure, and trusted technical language processing in specialized domains.\nWe are differentiated by our world­record AI models, deep know­how, and patent protection.\nTo drive commercialization, we have a strategic alliance with Chromologic, a company that has generated $3 in non­SBIR revenue for each $1 in SBIR funding.\nChromologic also has an extensive track record of delivering exceptional value to AFRL/RI.\n7 Key Personnel Dr.\nSandeep Mehta will lead the development of the dynamic KG toolset.\nMr.\nKyle DePierre, a USAF veteran, will provide user perspective.\nOverview of their expertise is below and CVs are attached.\nData scientists and software developers from our team will support this effort as necessary.\nDr.\nSandeep Mehta, Principal Investigator Dr.\nMehta brings over 35 years of software development experience, including 5+ years of leading­ edge LLM and 10+ years of AI/ML development.\nHe led the development of the TLP stack that holds world records on three benchmarks.\nHe has also developed innovative new AI tools such as ontologically­ assisted analytics and hierarchical classification.\nHis doctoral research focused on advanced methods including Bayesian statistics and probabilistic optimization that are directly applicable to AI.\nDr.\nMehta has been the PI on ten AI and DE SBIR efforts funded by Army, DARPA, MDA, Navy, and USAF.\nDr.\nMehta has held a wide variety of leadership positions in large organizations including Northrop Grumman and Boeing.\nAt Price Waterhouse Consulting, he helped many customers with diverse challenges from strategic planning to supply­chain management.\nOver his career, he has cultivated a deep professional network of technologists and executives that can help drive tech transition and commercialization.\nHe has extensive experience with best practice business process implementation and drives agile software development at Inspird.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume 18",
        "26": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph Dr.\nMehta has received several prestigious awards, such as Outstanding Contribution to the Engineering Profession from the American Society of Mechanical Engineers.\nHe received an M.B.A.\nfrom the Anderson School of Management at UCLA and an M.S.\nand Ph.D.\nin engineering from Vanderbilt University.\nDr.\nMehta has published more than 15 technology and management articles.\nHe is an inventor on 5 patents.\nProf.\nTyler Derr, Knowledge Graph­assisted RAG Expert, Vanderbilt University Dr.\nDerr is an Assistant Professor in the Department of Computer Science, Teaching and Affiliate Faculty in the Data Science Institute, and Faculty Fellow in the Frist Center for Autism and Innovation at Vanderbilt University.\nTyler directs the Network and Data Science (NDS) lab, which focuses on data mining and machine learning.\nHe has been prolific in the area of graph neural networks (GNN), a newer class of deep learning methods that leverage graph­structured data to improve predictions.\nHis work focuses on developing robust methods to overcome real­world data quality challenges, such as imbalanced, biased, and noisy data.\nIn one notable project, Prof.\nDerr introduced a GNN­based approach using zero­shot learning and a knowledge graph to enhance classifiers.\nProf.\nDerr has published multiple works at the intersection of graph and text mining, including “Knowledge Graph Prompting for Multi­Document Question Answering,” which won the Best Paper Award at the Graph Learning Frontiers.\nHe has led the development of tools that construct a knowledge graph from a set of PDF documents at various levels of granularity (e.g., sentence, page, and also from complex table data).\nHe has leveraged a novel LLM­based knowledge graph traversal agent to retrieve the relevant context from the KG and improve performance on multi­document question answering.\nProf.\nDerr has received numerous awards including the NSF Career Award.\nHe was part of the Visiting Faculty Research Program (VFRP) of The Air Force Research Laboratory’s Information Directorate (AFRL/RI).\nHe received his PhD from Michigan State University and MS from the Pennsylvania State University.\nHe has published over 50 papers in highly ranked journals and conference proceedings.\nKyle DePierre, AFNWC Operational Expertise and System Architect Kyle DePierre has over 18 years of Aerospace and Defense experience, including 8 years of System Engineering experience for DOD and Intelligence programs.\nHe has held positions as chief architect for National Space Defense Center and Joint Space Operations Center ground software programs, ICBM, Aircraft and Army ground vehicles.\nHe has held various senior systems engineering roles at Northrop Grumman and Booz Allen Hamilton.\nHe has active USAF/USSF Top Secret clearance with SCI eligibility and counter intelligence polygraph.\nMr.\nDePierre is an Air Force veteran and former acquisition officer at the Space and Missile Systems Center.\nHe has relevant experience in architecting multi­level security architectures, to include architecting databases that do not contain data that exceed classification rulesets by compilation.\nHe received a Bachelor of Science in Systems Engineering from the United States Air Force Academy and his M.B.A from the Wharton School at University of Pennsylvania.\nRich Cormier, Principal Engineer Richard Cormier is Inspird’s Vice President for Engineering and Support.\nMr.\nCormier brings over 30 years of experience in all aspects of Information Technology, including 13 years as a Chief Information Officer (CIO) at a Fortune 500 company.\nMr.\nCormier has an outstanding track record for planning, Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume 19",
        "27": "Proposal: F244­0001­0010/ Topic: AF244­0001 Dynamic, Interactive Knowledge Graph analyzing, and managing enterprise systems implementation initiatives across global organizations such as Chevron, Monsanto, and Edwards Lifesciences.\nMr.\nCormier is a seasoned executive who has blended disciplined program management with broad business acumen to deliver technology­enabled value creation.\nAt Edwards, Mr.\nCormier delivered a custom R&D Portal with data mining capabilities that provided easy access to a wide variety of engineering information, including requirements, specs, CAD drawings, etc., for both engineers and management.\n8 Foreign Citizens None.\n9 Facilities/Equipment No significant purchases will be required to support this contract.\nInspird will utilize existing internal compute resources to develop and demonstrate the dynamic KG toolset in Phase I.\n10 Subcontractors/Consultants Vanderbilt University (Prof.\nTyler Derr) is a subcontractor.\nVanderbilt will provide expertise and codebase for Knowledge Graphs.\n11 Prior, Current, or Pending Support of Similar Proposals or Awards None.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume 20",
        "28": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Duns Cage F244-0001-0010 AF244-0001 Dynamic, Interactive Knowledge Graph 10/28/2024 04:03:17 AM InspiRD, Inc 24261 Chrisanta Dr, Mission Viejo, California, 92691 http://inspird.com D859W8HNHD86 054205491 6DC34 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 20%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) $139,937.76 $139,937.76 $0.00 $0.00 $0.00 $72,560.00 $0.00 $0.00 $0.00 $0.00 $0.00 $14,512.00 $87,072.00 $42,500.00 $42,500.00 -$0.00 $10,365.76 $139,937.76 $0.00 $0.00",
        "29": "Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 20%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Computer and Information Research Scientist/ Principal Investigator (Sandeep Mehta) Engineers, All Other/ USAF Operations Expert (Kyle DePierre) Computer and Information Research Scientist/ Senior Data Scientist Software Developer/ Full Stack Developer Subtotal Direct Labor (DL) Labor Overhead (rate 28%) x (DL) Total Direct Labor (TDL) Subcontractor Costs Subcontractor- Vanderbilt University Vanderbilt University Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC1) G&A (rate 20%) x Base (TDL+TOH) Cost Sharing Profit Rate (8%) $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $125.00 240 25 $7500.00 $37,500.00 $100.00 64 $75.00 98 $50.00 32 25 25 25 $1600.00 $8,000.00 $1837.50 $9,187.50 $400.00 $2,000.00 $56,687.50 $15,872.50 $72,560.00 $42,500.00 $42,500.00 $42,500.00 $14,512.00 -$0.00 $10,365.76",
        "30": "Total Estimated Cost TABA Year 2 Direct Labor Costs $139,937.76 $0.00 Category / Individual-TR Computer and Information Research Scientist/ Principal Investigator (Sandeep Mehta) Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $125.00 0 25 $0.00 $0.00 Subtotal Direct Labor (DL) Labor Overhead (rate 28%) x (DL) Total Direct Labor (TDL) Subcontractor Costs Subcontractor- Vanderbilt University Vanderbilt University Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC1) G&A (rate 20%) x Base (TDL+TOH) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Sandeep Mehta Phone: (818) 694-3944 Phone: smehta@inspird.com Title: Proposal Owner If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: No Select the Type of Payment Desired: Partial payments",
        "31": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Computer and Information Research Scientist Principal Investigator PhD Engineers, All Other USAF Operations Expert Master's Degree Computer and Information Research Scientist Senior Data Scientist PhD Software Developer Full Stack Developer Bachelor's Degree 35 18 4 8 240 $125.00 25 $37,500.00 64 98 32 $100.00 25 $8,000.00 $75.00 25 $9,187.50 $50.00 25 $2,000.00 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nStandard rates Direct Labor Cost ($): Year2 $56,687.50 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Computer and Information Research Scientist Principal Investigator PhD 35 0 $125.00 25 $0.00 Are the labor rates detailed below fully loaded?\nProvide any additional information and cost support data related to the nature of the direct labor detailed above.\nPhase I is six months only.\nAll work will be performed in base year.\nDirect Labor Cost ($): NO $0.00",
        "32": "Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) Overhead Comments: Overhead Cost ($): Year2 Labor Cost Overhead Rate (%) Overhead Comments: Overhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Subcontractor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\n$56,687.50 28 $15,872.50 28 $0.00 $15,872.50 20 YES YES NO $14,512.00 20 YES YES",
        "33": "Apply G&A Rate to Subcontractor Costs?\nNO Please specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Sum of all G&A Costs is ($): Subcontractor/Consultants Base Subcontractor/Consultant: Vanderbilt University $0.00 $14,512.00 Budget Contact Name Budget Contact Title Budget Contact Phone Budget Contact Email Dr.\nTyler Derr Assistant Professor (717) 644-7601 tyler.derr@vanderbilt.edu Do you have a letter of commitment from the subcontractor/consultant?\nDocument uploaded for the letter of commitment: • Vanderbilt_LOA _Signed.pdf Are you able to provide detailed budget information for this subcontractor/consultant?\nTotal Cost($) : Do you provide the authority to the Government to contact this Budget Contact?\nYear2 Subcontractor/Consultant: Vanderbilt University YES NO $42,500.00 YES Budget Contact Name Budget Contact Title Budget Contact Phone Budget Contact Email Dr.\nTyler Derr Assistant Professor (717) 644-7601 tyler.derr@vanderbilt.edu Do you have a letter of commitment from the subcontractor/consultant?\nYES",
        "34": "Document uploaded for the letter of commitment: • Vanderbilt_LOA _Signed.pdf Are you able to provide detailed budget information for this subcontractor/consultant?\nTotal Cost($) : Do you provide the authority to the Government to contact this Budget Contact?\nNO $0.00 YES Total Subcontractors/Consultants Cost ($): $42,500.00 Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Total Proposed Amount ($): -$0.00 8 $10,365.76 - 8 $10,365.76 $139,937.76",
        "35": "SBIR Company Commercialization Report Inspird Inc.\nDISCLAIMER: Information provided herein is privileged and confidential, and not subject to disclosure, pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nThis information shall only be used or disclosed for evaluation purposes.\nPrivileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/07/2022 Page 1/3",
        "36": "SBIR Company Commercialization Report Total Investments: Total Sales: Total Patents: $500,000.00 Company Information Address: $0.00 0 24261 Chrisanta Ave Mission Viejo, CA 92691-4003 United States Government Designated Phase III Funding: $0.00 SBC Control ID: SBC_001317907 Company Url: http://inspird.com Company POC Title: Dr.\nFull Name: Sandeep Mehta Phone: Email: 8186943944 smehta@inspird.com Additional Company Information % Revenue for last fiscal year from SBIR/STTR funding: 75.0% Year Founded: 2011 Commercialization POC Title: Dr.\nFull Name: Sandeep Mehta Phone: Email: (818) 694-3944 smehta@inspird.com Total revenue for last fiscal year: $500,000 - $999,999 # Employees Currently: 12 Year first Phase I award received: # SBIR/STTR Phase I Awards: 2018 6 Year first Phase II award received: # SBIR/STTR Phase II Awards: 2020 1 # Employees at first Phase II award: Mergers and Acquisition within past 2 years: 5 No Spin-offs resulting from SBIR/STTR: IPO resulting from SBIR/STTR | Year of IPO: No No | N/A Patents resulting from SBIR/STTR | #Patents: List of Patents: No | N/A Woman-Owned: No HUBZone-Certified: No Additional Investment From DoD contracts/DoD subcontracts Angel Investors Venture Capital Self Funded Private Sector Other Federal Contracts/Grants Other Sources Additional Investment Total Investment Socially and Economically Disadvantaged: Yes SBC majority-owned by multiple VCOC, HF, PE firms | By what percent (%): No | N/A Last Submitted Version (-) Current Version - - - - - - - - - $0.00 $0.00 $0.00 $500,000.00 $0.00 $0.00 $0.00 $0.00 $500,000.00 Page 2/3 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/07/2022",
        "37": "SBIR Company Commercialization Report Phase III Sales To DoD or DoD prime contractors Private Sector Export Markets Other Federal Agencies Additional commercialization by 3rd Party Revenue Other Customers Additional Sales Total Sales Government Phase III Contracts Funding Obligated Commercialization Narrative Commercialized Awards Last Submitted Version (-) Current Version - - - - - - - - $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Last Submitted Version (-) $0.00 Current Version $0.00 Listed below are the sales revenue and investment details resulting from the technology developed under these SBIR/STTR awards.\nAccelerated Modifications using Physics-substantiated Safety Arguments (AMPS) 1 of 1 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase I/2018 Subsidiaries No | N/A tlp.ai Topic #: AF181-025 Contract/Grant #: FA8650-18-P-2121 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards Awarded Phase II (Contract FA864920C0022) and led to the commercialization.\nUsed in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $500,000.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $500,000.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/07/2022 Page 3/3",
        "38": "Sandeep Mehta, InspiRD, Inc Oct 28, 2024 Oct 28, 2025"
    },
    "images": [
        {
            "page": 8,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page8_img1.png",
            "hash": "f0e003f01f9e1f0f",
            "position": "Top Left"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page8_img3.png",
            "hash": "88f3744c1b6c74b5",
            "position": "Top Center"
        },
        {
            "page": 9,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page9_img1.png",
            "hash": "f0e003f01f9e1f0f",
            "position": "Top Left"
        },
        {
            "page": 10,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page10_img1.png",
            "hash": "f0e003f01f9e1f0f",
            "position": "Top Left"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page11_img1.png",
            "hash": "f0e003f01f9e1f0f",
            "position": "Top Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page12_img1.png",
            "hash": "f0e003f01f9e1f0f",
            "position": "Top Left"
        },
        {
            "page": 13,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page13_img1.png",
            "hash": "f0e003f01f9e1f0f",
            "position": "Top Left"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page14_img1.png",
            "hash": "f0e003f01f9e1f0f",
            "position": "Top Left"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page15_img1.png",
            "hash": "f0e003f01f9e1f0f",
            "position": "Top Left"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page16_img1.png",
            "hash": "f0e003f01f9e1f0f",
            "position": "Top Left"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page16_img2.png",
            "hash": "c5130b675949667b",
            "position": "Top Center"
        },
        {
            "page": 17,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page17_img1.png",
            "hash": "f0e003f01f9e1f0f",
            "position": "Top Left"
        },
        {
            "page": 18,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page18_img3.png",
            "hash": "c55b6e50707c7872",
            "position": "Bottom Center"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page19_img2.png",
            "hash": "e16c181b5e39c979",
            "position": "Bottom Right"
        },
        {
            "page": 20,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page20_img2.png",
            "hash": "901a59e961e567e6",
            "position": "Bottom Right"
        },
        {
            "page": 20,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page20_img4.png",
            "hash": "b71785a9e0aaa699",
            "position": "Bottom Right"
        },
        {
            "page": 20,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page20_img8.png",
            "hash": "cc139b6e23f824a7",
            "position": "Bottom Right"
        },
        {
            "page": 20,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page20_img10.png",
            "hash": "a0685782d7969f96",
            "position": "Bottom Center"
        },
        {
            "page": 20,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page20_img12.png",
            "hash": "913f4668d873392d",
            "position": "Bottom Center"
        },
        {
            "page": 20,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page20_img14.png",
            "hash": "85575fe81645fa21",
            "position": "Bottom Right"
        },
        {
            "page": 24,
            "image_file": "docNAC01FB7453538b859814f18435f8d724b9373d5221eda6597b686c2922fbf8eea40d10eceef2_page24_img2.png",
            "hash": "c4134a6f0fb5a5c9",
            "position": "Bottom Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "inspird.com",
        "name": "N/A",
        "phone": "N/A"
    }
}