{
    "filename": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0093 Proposal Title: WEAVER: An Intelligent System For Interactive Knowledge Graph Maintenance Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: Kitware Address: Website: UEI: DUNS: CAGE: 1712 Route 9 Suite 300, Clifton Park, NY 12065-3104 http://www.kitware.com DK6LPWMS5LP5 010926207 1DKA7 SBA SBC Identification Number: 000001978 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 200 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_000001978 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_000001978.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [ ] White [ ] Black or African American [X] Do not wish to Provide 14.\nEthnicity of the offeror: DO NOT WISH TO PROVIDE 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud- NO related crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Title Business Name Date Charles Weatherford Charles Weathe Contracts Administrat Kitware 12/17/2019 rford or",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?\nWas your accounting system approved by the auditing agency?\nWas a rate agreement negotiated with the auditing agency?\nWas an overhead and/or cost audit performed?\nYES Last Audit Date: 11/13/2012 YES Last Update Date: 11/13/2012 YES Last Update Date: 01/03/2024 YES Date of Overhead Audit: 06/29/2021 Date of Cost Audit: 06/29/2021 Are the rates from the audit agreement used for this firms proposal?\nYES Firm Information: Agency Firm: Address: Point of Contact (POC) Name: POC Phone: POC Email: Upload a copy of the audit information: • FinalDODReport_Kitware_2020.pdf Defense Contract Audit Agency 375 Saratoga Road Glenville , New York 12302 Matthew Fischer (571) 448-4685 matthew.d.fischer5.civ@mail.mil VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: As the size of these modern dynamic knowledge graphs grows, new methods are needed to facilitate analyst’s upkeep of these data structures.\nKitware is proud to propose this Phase 1 SBIR for the development of a system to achieve dynamic knowledge",
        "5": "graph management.\nOur system, WEAVER, studies user interaction with a dynamic knowledge graph and suggests additional necessary changes to the graph in support of faster, more effective situational awareness, pattern of life analysis, threat detection, and targeting operations in time-constrained environments.\nWe build upon extensive ongoing work with graph convolutional neural networks, foundational models, and LLMs for the creation, search, and maintenance of knowledge graphs.\nOur approach decomposes the problem into two main tasks.\nFirst, we conduct a coarse-grain search of the knowledge graph for areas that are relevant to recent user interaction.\nWe then use an LLM to make fine grained recommendations to nodes and edges in both the graph and schema, leveraging the prioritized sub-graph queue.\nThe WEAVER system will incorporate a UI that works with users in a human-machine teaming paradigm to adjudication system suggestions.\nThese suggestions will be leveraged to refine future system behavior and align the WEAVER models with the goals of the analyst.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: Our research will deliver a prototype system for rapidly curating updates to large, dynamic knowledge graphs through human- machine collaboration.\nThis innovation will enable warfighters to maintain realtime situational awareness, analyze patterns of life, detect threats, and make targeting decisions in timesensitive environments by keeping intelligence graphs tactically relevant.\nA Phase I feasibility study will guide our Phase II development and beyond.\nWith government feedback, we will refine our methods and establish a framework for expanded validation in Phase II.\nOpen source release, pending permission, will occur at the appropriate security level.\nBeyond Phase II, our work will move toward commercialization, with initial applications for the intelligence community and eventual expansion into the civilian market.\nKitware’s experience in technology transition supports our commitment to bring this solution through the full commercialization process, making it a pivotal addition to our defense systems portfolio.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: 1 2 3 4 5 6 7 8 9 12 13 14 15 16 17 18 List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: Knowledge Graphs, Large Language Models, Graph Neural Networks, Human-Machine Teaming, Iterative Prompt Refinement, ATR, UIUX",
        "6": "VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 100% 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES 3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES YES 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO",
        "7": "16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n15% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES VOL I - Contact Information Principal Investigator Name: Daniel Davila Phone: (518) 371-3971 Email: daniel.davila@kitware.com Address: 1712 Route 9 Suite 300, Clifton Park, NY 12065 - 3104 Corporate Official Name: Mary Key Phone: (518) 371-3971 Email: mary.key@kitware.com Address: 1712 Route 9 Suite 300, Clifton Park, NY 12065 - 3104 Authorized Contract Negotiator Name: Mary Key Phone: (518) 371-3971 Email: mary.key@kitware.com Address: 1712 Route 9 Suite 300, Clifton Park, NY 12065 - 3104 Form Generated on 11/05/2024 10:41:35 PM",
        "8": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nThis proposal includes data that shall not be disclosed outside the Government and shall not be duplicated, used, or disclosed-in whole or in part-for any purpose other than to evaluate this proposal.\nIf, however, a contract is awarded to this offeror as a result of-or in connection with-the submission of this data, the Government shall have the right to duplicate, use, or disclose the data to the extent provided in the resulting contract.\nThis restriction does not limit the Government’s right to use information contained in this data if it is obtained from another source without restriction.\nThe data subject to this restriction are contained in pages 1-9, 12-18.\n1 Identiﬁcation and Signiﬁcance of the Problem or Opportunity In modern Air Force analyst workﬂows, accurate Knowledge Graphs (KGs) play a key role in intelligence product development.\nFor example, in target development, analysts rely on large knowledge graphs to analyze enemy disposition of forces, critical capabilities, and other factors that feed into targeting and strike decision-making.\nAs the situation on the ground is ever-changing, these graphs must be meticulously maintained by the warﬁghters to provide up-to-date situational awareness regarding both friendly and enemy status.\nThis process is already time-consuming, but exacerbating the problem is the complexity of modern knowledge graphs underpinning these systems.\nA modern Knowledge Graph (KG) can have many millions of nodes and edges [1, 2].\nEach of these is an instantiation of a vast collection of fundamental data types deﬁned by the schema.\nThrough the course of analyst workﬂows, they may update nodes and edges in the graph, but also the schema itself.\nTools are needed to ensure that, as these updates take place the warﬁghter is equipped to rapidly introduce downstream changes related to the initial update.\nHowever, we cannot expect a user to manually sort through every possible node in order to check that there are no implied secondary or tertiary updates to the graph.\nAutomation is needed to isolate graph components of relevance to the user’s objectives and then present the user with a prioritized list of updates to adjudicate, thereby maximizing the value of precious analyst time on task.\nKitware is proud to propose WEAVER, a system for rapidly curating updates to knowledge graphs based on user interactions.\nFigure 1 shows our concept of operations.\nWe will use Artiﬁcial Intelligence (AI) to automatically compare user activity on speciﬁc nodes of the graph to other areas of the data structure.\nWEAVER will automatically identify other candidate nodes and edges that may also need updating and suggest appropriate updates.\nThese updates include updating the graph’s underlying ontology/schema, inferring additional edges between nodes, highlighting conﬂicting information in the graph, highlighting information gaps, and suggesting additional changes to the graph because of the user’s modiﬁcations.\nIn order to reason about the massive number of edges and nodes, we decompose the problem into two parts.\nThe ﬁrst is a CNN-based sub-graph ranking module which implements coarse-grained search of potential regions that may require updating or may inform future user edits.\nThis module encodes features on relatively small subgraphs in a way that we can later use this encoding to rapidly align user activity in one area of the graph with elements elsewhere in the structure.\nOnce this coarse-grained alignment is achieved, our LLM system will make ﬁne-grained suggestions to updates on nodes and edges within both the graph and schema.\nA limiting factor in modern LLMs is their general lack of introspective ability, they don’t know what they do and do not do well.\nAdditionally, LLMs have limited context windows with which they can operate.\nWe cannot rely on the LLM to accurately self-moderate its conﬁdences in this task.\nGiven these limitations, the key to our approach is an Interactive Prompt Reﬁnement (IPR) module, which will accomplish two things.\nFirst, it will study user adjudication decisions in order to learn, in real time, which areas of reﬁnement the LLM is getting correct and which should not be trusted.\nThis will enable us to calibrate LLM suggestion conﬁdence and ensure that valuable analyst cycles are spent looking at the high-probability graph updates ﬁrst.\nSecond, it will produce reﬁnements to the LLM prompts in order to better align the LLM performance with the user’s goals and values.\nKitware is uniquely positioned to achieve the objectives laid out in this proposal.\nWe’ve tackled some of industry’s toughest AI problems, including those dealing with generating, manipulating, and searching graphical data using deep learning methods.\nWe build off an extensive portfolio of LLM research [3–5] and knowledge graphs [6].\nRecently, we have gained particular experience in automated knowledge graph generation and management for DoD/IC use cases.\nWe have active work in this area with customers in the Air Force (AFRL Wingman - Section 4.1), Army (SBIR Tech Marketplace - Section 4.2), and NIH (KG Gener- ation for Metabolomics - - Section 4.4).\nThe Kitware AI team has a heritage in developing and transitioning systems for analysts and warﬁghters, with many systems deployed to end users today and maintained by Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n1",
        "9": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nFigure 1: Concept of Operations for the WEAVER system.\nWe propose using a 2-tiered approach to solving the problem of taking user graph edits and suggesting updates to relevant nodes elsewhere in the graph.\nFirst, we recognize that production DoD/IC graphs are too large for any single model to fully reason over.\nThis includes both graph CNN and Large Language Models.\nOur ﬁrst step is to extract features on subgraphs, using a combination of node-level embeddings and local subgraph embedding models, to form a vector search space over our graph.\nWhen a user updates nodes or schema elements, we will use this set of features to rank order the subgraphs that are most relevant to the user update (bottom left).\nOnce we have these, a Graph LLM will be employed to perform ﬁne-grained reasoning about speciﬁc ﬁelds and elements that should be updated at the node level (bottom middle).\nThese are provided to the user via the WEAVER UI (top right), which enables the user to rapidly accept, reject, or modify suggestions.\nThese user decisions are captured by the system and then used for iterative prompt reﬁnement, inﬂuencing future LLM behavior when assigning node priority (bottom right).\nKitware engineers and researchers.\nWe have a deep heritage of open source software and open architecture design [7–12].\nWe will provide all software with unlimited rights to the government.\nWith permission, we will release this software as open source into our existing open source repositories.\nReleasing open source software promotes greater adoption and commercialization of our work under Kitware’s business model, which results in further investment in software beneﬁting the government.\n1.1 Challenges and Innovations Figure 1 summarizes our proposed approach, which addresses the following challenges through key inno- vations: Challenge 1: When editing a production graph, manually checking graph and schema elements for poten- tial updates (as is currently done in many CONOPs) is an inefﬁcient use of warﬁghter time.\nInnovation: We propose WEAVER, a system which accelerates graph editing by learning which nodes and subgraphs align with the intent of a user as they interact with the graph.\nIt then provides the user a rank ordered list of recommended changes in a UI which allows them to quickly accept, reject, or edit the recommendations.\nOur method combines the best of classical search methods (based on CNN encoders Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n2",
        "10": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nand graph neural networks) with the power of ﬁne-grained reasoning capabilities from large language models (LLMs).\nSee Section 3.1.\nChallenge 2: Production-grade knowledge graphs in the DoD//IC are extremely large.\nIt is computation- ally intractable to directly perform user queries against these entire graphs.\nThe breadth of the graphs is beyond the receptive ﬁeld of even deep graph neural networks and well outside the context window of current LLMs.\nInnovation: We decompose our recommendation engine into two stages- related sub-graph search, and edit recommendation.\nIn the ﬁrst stage, we will extract coarse node and sub-graph level features using language embedding and graph neural network models.\nThis compresses the large graph into a set of encoded vectors that can be used to search semantic concepts related to the user interaction.\nIn stage two, ﬁne-grained sub-graph edit suggestions can then be made on more computationally tractable, limited but related sub-graphs using LLMs.\nSee Section 3.1.3, Section 3.1.4.\nChallenge 3: The scale of production graphs means that there will likely be many suggested updates across the nodes and edges when a user interacts with the graph.\nEven with machine guidance, the user may be overwhelmed by a prioritized list of potential edits.\nInnovation: Our system will continuously re-prioritize graph and schema update suggestions based on edits the user has already made.\nWe will include the user adjudication history in our LLM prompt which suggests the next most relevant edits.\nThis will ensure we maximize the impact of analyst time on task.\nSee Section 3.1.5.\nChallenge 4: Fine tuning or prompt engineering an LLM to produce prioritized graph graph and schema update suggestions requires training data related to the particular graph being processed.\nSystems that require training data ahead of time for each kind of graph a user may edit will not readily generalize to new kinds of graphs or new user preferences.\nInnovation: WEAVER will adapt to each new graph type and user through use of Iterative Prompt Reﬁne- ment (IPR).\nWe will model, quantitatively, LLM success and failures across different areas of the knowledge graph according to user feedback on its suggestions.\nIPR will automatically tune our LLM prompts [13] to improve the LLM’s graph edit suggestions and suggestion relevance predictions.\nAs the user works with WEAVER they will naturally create training data which drive continuous system improvement.\nThis vir- tuous cycle will make ever more efﬁcient use of limited analyst adjudication time the more WEAVER is used.\nSee Section 3.1.6.\n2 Phase I Technical Objectives Since Phase I is a feasibility study, our objective in Phase I is to study the practicality, accuracy, and failure modes of our proposed approach.\nWe will focus experiments in Phase I on proving out the algorithmic components of our architecture.\nPhase I will not involve human subjects research due to the Phase’s limited budget and duration.\nSimulated human oracles will be used to make edits and curate WEAVER suggestions in Phase 1.\nExperimentation plans are discussed further in Section 3.2.\nBy running these experiments in Phase I, we aim to answer the following questions: 1.\nHow effectively will classical CNN and GNN approaches propose coarse-grained sub-graphs which relate to user graph edits?\nWe will use measures such as graph edit distance to compare our retrieved sub-graphs to an exhaus- tive scan.\nUsing this approach we can also compare the time complexity of an exhaustive search vs.\nour GNN based related sub-graph suggestions.\n2.\nHow effectively will off-the-shelf LLMs prioritize ﬁne-grained graph edits using graph agnostic hand-engineered prompts?\nWe will compare suggested additional graph edits to ground-truth graph edits made in response to user interaction.\nWe will measure how frequently the suggested additional graph edits match ground truth edits.\n3.\nHow much will Iterative Prompt Reﬁnement improve ﬁne-grained graph edit suggestions over graph agnostic hand-engineered prompts?\nWe will compare IPR and hand-engineering for suggesting graph edits by executing the graph edits Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n3",
        "11": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nin priority order and measuring the resulting graph edit distance to ground-truth ﬁnal graphs.\nThis will provide an objective measure of the performance of IPR over baseline approaches.\n4.\nHow much will the full WEAVER system improve ﬁnal graph quality vs.\nan LLM or other method working only on the local region near the user’s graph edit?\nWe will set up an experiment where we have simulated users make suggestions on a large graph and adjudicate responses.\nWe will look to measure rates of convergence (in terms of iterations) on key metrics such as graph completeness, suggestion accuracy, suggestion ranking, and more.\n3 Phase I Work Plan Phase I work required to achieve the stated objectives is described below.\nSection 3.1 covers the technical details of the proposed approach.\nSection 3.2 describes the data to be used and methods for evaluating performance.\nSection 3.3 explains our use of and contribution to open source software.\nSection 3.4 is a work plan that outlines speciﬁc tasks, milestones, and deliverables, and provides a schedule for their completion.\n3.1 Technical Approach Figure 2: System architecture of WEAVER.\n(1) We begin by processing the full graph at the sub-graph level (possibly down to the single node) in order to build up a compressed, searchable, vector database representing the graph.\n(2) We encode sub-graphs edited by the user to our database of sub-graph signatures.\nThis produces a rank order list of sub-graphs for the LLM to consider when budgeting decision capacity for update suggestions.\n(3) We use an LLM to recommend ﬁne-grained updates to the sub-graphs, down to ﬁelds of individual nodes.\nWe pass these recommendations to the user via the WEAVER UI, which allows them to quickly accept, reject, or modify the changes.\nThis user feedback is integrated into future LLM prompts via Iterative Prompt Reﬁnement to align the LLM with the user goals.\nOur technical approach follows the ﬂow chart in Figure 2.\nFirst, we solve the problem of representing very large production-grade knowledge graphs in a compressed and semantically searchable format.\nWe achieve this by partitioning the graph into sub-graphs, from which we extract descriptor vectors using node-level encoders and sub-graph level Graph Neural Networks (section 3.1.2).\nWhen a user later modiﬁes a node or edge, we compare the features for the local sub-graph with all the signatures in our database in order to rank-order other sub-graphs in terms of similarity to the modiﬁed content (section 3.1.3).\nFrom this list, we have a starting point to explore ﬁne-grained node and edge updates.\nWe accomplish this with the Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n4",
        "12": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nuse of an LLM, which reasons about the exact ﬁelds and values updated by the user and suggests node and edge modiﬁcations elsewhere in the graph, working its way through the ordered list of related sub-graphs (section 3.1.4).\nThe priority LLM outputs are presented to the user via the WEAVER UI, which will enable them to rapidly curate the recommended graph operations, focusing on their limited time on task to the high priority updates ﬁrst (section 3.1.5).\nLastly, we propose a novel method of aligning the LLM behavior to the goals of the user in the loop.\nWe do this via Interactive Prompt Reﬁnement (IPR), which is achieved by feeding information about the user adjudication results back to the LLM to inﬂuence future inferences (section 3.1.6).\nTo achieve our feasibility assessment, each of these methods will be validated against a large, representative graph structure using the appropriate baseline performance metrics (section 3.2).\n3.1.1 Prior Results Figure 3: Real result from prototype capability showcasing SOTA LLM-based graph maintenance.\nHere we show a graph that has been updated by a user (shown in orange) and then presented to an LLM which makes recommendations on further updates (shown in green).\nThis prototype was built on the Army Tech Marketplace program.\nKitware is currently working on multiple efforts which sit at the intersection of Knowledge Graphs and deep learning systems.\nIn an effort with the Army SBIR ofﬁce (see section 4.2), we are building a system to prompt LLMs from unstructured text sources to create knowledge graphs.\nIn Figure 3, we conduct a quick experiment with our prototype WEAVER system to demonstrate the capabilities of LLMs with simple prompts (not optimized via IPR for the task of update suggestion).\nThis graph contains 10 nodes Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n5",
        "13": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nand 50 edges detailing several technology companies.\nIn our experiment, we add a single node for the company Netﬂix and then connect several edges to nodes \"Information Technology\" and \"United States of America\".\nWith a simple prompt to an LLM, we elicit the recommendations to add connectivity between the pre-existing \"OpenAI\" node and the node \"United States of America\".\nThe LLM inferred that the user was interested in tracking country of incorporation, based on the recent interaction adding this relationship to the \"Netﬂix\" node, and appropriately recommended that this relationship also be created from the \"OpenAI\" node.\nWe also see that the LLM suggested that we create a relationship between \"OpenAI\" and \"artiﬁcial intelligence\", the latter of which is a novel node in the graph.\nThis demonstrates an example of the LLM inferring that the user cares about product offerings, and suggesting new information that is baked into the internal world model of the LLM itself, rather than existing in an authoritative source.\nBoth these recommendations, in the WEAVER system, will be passed to a user for adjudication.\nWe can learn via study of user feedback which of these types of updates to trust more in the future.\nAdditionally, we can modify future prompts to bias for or against each kind of suggestion.\nThe following sections detail our plan for achieving this behavior.\n3.1.2 Sub-graph Representation When a user makes updates to a particular node or edge of a graph (or schema), we want to search the rest of the graph for similar nodes that might also need updating.\nDue to the very large nature of production graphs, using any machine learning method directly on the graph to perform node relevance classiﬁcation / regression is computationally intractable.\nClassic deep learning methods, such graph CNNs and GNNs, will be incapable of ﬁtting the entire graph into its receptive ﬁeld.\nLLM methods are bound by token limits, which will be far exceeded by the amount of information in a graph.\nInstead, we propose to decompose the problem of update recommendations into two main parts.\nFirst, we compute multi-level features of the full graph.\nFigure 4 shows the proposed workﬂow.\nWe extract node-level features by encoding ﬁeld-value information with a classical text embedding network, such as BERT [14].\nWe could also use the encoder stage of LLM methods that are specialized on structured, json-like data.\nUltimately, each node is converted to a feature vector which encodes the semantic meaning of the ﬁelds and relationships (inclusive of edge connections) for that node.\nThen, we agglomeratively combine node features across local sub-graphs using a graph convolutional network (GNN), such as GCNN [15], which results in a single vector encoding features for the many sub-graphs that comprise our global graph.\nWe will use the graph convolutional kernels to aggregate features over a pyramid of graph distances.\nThis is due to the fact that we cannot know a priori how many adjacent nodes of features are informative to the coarse graph search.\nWith these node-level and sub-graph-level feature vectors, we now have an efﬁciently searchable representation of our graph that can be used to compare nodes across vast distances for semantic similarity.\nThis will be critical when we are searching for nodes and edges that align with user graph interactions, detailed more in section 3.1.3 below.\n3.1.3 Sub-graph Similarity Searching When users manipulate a node, edge, or other element of the graph or schema, we want to identify related elements of the global graph that may also require updates or could inform updates and then make rec- ommendations to the user accordingly.\nIn the last section, we detailed how we can represent the global graph as an efﬁciently searchable vector space, within which we encode semantic meaning of different sub-graphs.\nWe can exploit these representations to prioritize sub-graphs over which we run LLM-driven, ﬁne-grained search for node-level updates.\nIn this manner, we perform slew-to-cue between the coarse- grained sub-graph similarity search and the ﬁne-grained LLM node update recommend.\nWe will take the sub-graph embeddings of user-edited nodes and search for similar sub-graphs within the vector database.\nThis search often uses a simple distance measure, such as euclidean or cosine distance, between vectors.\nThe distance in this vector space relates directly to the semantic overlap of two sub- graphs.\nThere is a design tradeoff related to the size of sub-graph that we encode for this vector search.\nChoosing smaller graph sizes will increase the speciﬁcity of our result and likely yield better matches, at the cost of increased compute in terms of vectorization and search time.\nOn the other hand, encoding larger sub-graphs results in less embedding compute costs and lookup time, while degrading the speciﬁcity of each vector.\nThis is due to the embedding vector having to encode in feature space a much larger amount of data for larger sub-graphs.\nWe will explore this tradeoff as part of our investigation.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n6",
        "14": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nFigure 4: Workﬂow to convert sub-graphs into multi-level vector representations.\nThese representations will be compared to one another via simple vector space distance measurements to assess semantic similarity between nodes and sub-graphs.\nThis is critical to enable quick lookup of related sub-graphs as we attempt to limit the scope of decisions that the ﬁne-grained graph update module (powered by LLMs) has to make.\nWhat results from this sub-graph similarity search is a ranked list of sub-graphs, ordered by their se- mantic relevance to the node which was originally updated by the user.\nWith this list, we can now run very focused prompts against our LLM to recommend updates to these related sub-graphs, given the ﬁne- grained user-generated updates to their node.\nThis is detailed in section 3.1.4 below.\n3.1.4 LLM-Driven Sub-graph Update Recommendation The previous sections detailed how we take user activity on a graph and produce a rank-ordered list of related sub-graphs that should be investigated for updates or may inform updates.\nThese modules solved the problem of drilling down into the massive production graph for smaller areas that are semantically related to the original node update.\nWe still need to go the ﬁnal step and recommend speciﬁc modiﬁcations to nodes, edges, and schema elements based on the speciﬁc user interaction.\nFor this, we propose to use an LLM, which excels at ﬁnding complex relationships between entities in the text domain.\nGiven the user updates a speciﬁc sub-graph that is identiﬁed as a candidate for ﬁne-grained search, we will prompt an LLM to make speciﬁc ﬁeld-value recommendations to the sub-graph.\nWe can prompt the model in such a way that it produces recommendations for additions, removals, and modiﬁcations of nodes or schema elements.\nThis can happen in a single prompt to the LLM.\nFigure 5 shows what a typical prompt for such a complex task looks like.\nThis prompt is what was used to produce the result show in our prior work demonstration in Figure 3.\n3.1.5 WEAVER UI for Rapid Recommendation Adjudication While not the primary focus of this investigation, a bare-bones UI/UX will be implemented which allows us to prototype user interaction with the system.\nAs shown in our concept ﬁgure, this UI will enable users to inspect the node prioritization queue.\nThey can quickly move through node update recommendations and adjudicate the suggestions made by the modules described above.\nPotential actions could include accepting a recommendation, rejecting, or modifying a recommendation in place before conﬁrming.\nThese adjudications will be stored and exploited over time to modify the behavior of the system, as detailed in section 3.1.6 below.\nThis interface will likely be implemented in a low-code open source UI mock-up tool, such as Gradio [16] or Trame [17].\n3.1.6 Interactive Prompt Reﬁnement As observed in our experiment in Figure 3, the LLM will tend to make recommendations on the graph that are valid according to its own internal world model, but perhaps uninteresting or irrelevant to the entities and relationships being captured in our mission-speciﬁc knowledge graph.\nIn order to ﬁlter these nuisance Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n7",
        "15": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nFigure 5: Example prompt from our prototype system described in Section 3.1.1 using a modern LLM for a complex task such as Knowledge Graph generation and node update recommendation.\nResults from this prompt are show in our prior work demonstration Figure 3.\nrecommendations over time, we propose a novel Iterative Prompt Reﬁnement (IPR) module.\nWe will aggre- gate user adjudications of our system recommendations and take several steps to align the recommender with the user objectives.\nFirst, we will feed user activity directly into the prompt in order to inﬂuence fu- ture decisions.\nThis feedback can be injected as show in our example prompt in Figure 5.\nSeveral methods will be explored in order to incorporate user feedback in this prompt.\nOne option is to inject, explicitly, every point of user feedback into the prompt as shown in our example.\nLikely, a middle step of feedback summarization will beneﬁt the model performance.\nFor example, we might use an LLM as a middle step to encode the user feedback into a much more concise summary of the types of updates the user is making.\nWe could also take a classical approach, using topic density representations to encode user decision history.\nAn additional feature we propose to explore is training a meta-learner that sits on top of the LLM and decides which recommendations to trust.\nThis can be achieved with our node and sub-graph level features that we extracted for our coarse-grained graph search.\nUsing user adjudications as labels, we can train this meta learner which types of recommendations the LLM is getting wrong according to the user, even despite consecutive rounds of prompt reﬁnement.\nWe can also learn whether there are entire areas of the global Identifying graph that the LLM struggles with, which could be the case for out of distribution topics.\nthese areas will inform efforts to ﬁne-tune the LLM over time, or to develop other methods of making recommendations on these hard topics.\n3.2 Data and Evaluation In Phase I, we will focus on existing data sets which are well-suited to support the various aspects of our feasibility study.\nSpeciﬁcally we will consider the data sets in the table below.\nThese data will allow us to stand up a low-side equivalent to production grade knowledge graphs used in the intelligence communi- ties, particularly in terms of size and complexity.\nAlso present in these graphs are very large amounts of highly esoteric data, which will allow us to quantify WEAVER performance on knowledge bases that are far outside of the distribution for the everyday data that NLP and LLM methods tend to be trained on.\nThis will be critical in order to assess the degree to which we should expect our methods to struggle on the jargon present in production military and intelligence community ontologies.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n8",
        "16": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nKnowledge Graph Millions of Nodes Millions of Edges Size Last Updated Wikidata [18] Freebase [19] DBPedia [20] YAGO 4.5 [21] 114 72 60 49 1570 306 850 109 1.4 TB 2024 250 GB 2015 374 GB 2024 142 GB 2023 Table 1: Available open-source large knowledge graphs.\nTo evaluate the recommendations provided by our LLM system, we will compare the graph constructed via the application of the LLM recommendations to a known ground-truth graph.\nWe will obtain these ground-truth graphs by taking sub-graphs of an existing knowledge graph and modifying it through some sequence of updates, thus obtaining both the complete ground truth graph and the modiﬁed graph to feed to the LLM.\nThis will yield both a suggested set of edits made by the LLM that can be compared to the ground-truth chosen updates to produce the modiﬁed graph, as well as the updated graph constructed from the LLM edits that can be compared to the original ground-truth graph.\nFor comparison of the LLM suggested edits to the ground-truth updates, we can evaluate the LLM’s efﬁcacy using precision (to measure how often a suggestion is correct) and recall (to measure the frequency that ground-truth edits are suggested).\nMeasuring both precision and recall for the LLM’s suggestions allows us to prioritize a system that is both consistently correct in its suggestions without recommending superﬂuous edits.\nAdditionally, we can further evaluate the ranking of the LLM suggestions against the ground-truth edits via ranking metrics such as Normalized Discount Cumulative Gain (NDCG) [22], which prioritizes recommending highly relevant graph edits.\nFor the evaluation of the graph produced by the LLM’s edits, we can compare this graph to the orig- inal unedited ground-truth graph via graph-theoretic similarity metrics.\nThese include metrics such as adjacency spectral distance [23], which measures the vector distance between the spectra of the adjacency matrices of the two graphs, which decreases with similarity in graph topology.\nAnother graph-theoretic metric to use is the graph edit distance [24], which measures the minimal amount of edits that must be made to one graph to transform it into another one.\nThis metric would serve as a proxy of calculating the number edits that must be removed and added to the LLM’s suggestions.\nAdditionally, as we will have a sub-graph vector representation model (Section 3.1.3), we can encode both the ground-truth and LLM generated graphs as vectors and then directly compare them through our chosen vector similarity metric.\n3.3 Open Source Kitware is a company with deep roots in building, using, and customizing open source software [7,8,12,25].\nWe prosper by applying our expertise in scientiﬁc and software development to create and enhance open source software for our customers and then share these enhancements when possible, thus creating new collaborations and new customers.\nOur open source model provides us key beneﬁts such as sustainability and credibility.\nIt makes sure that the government investment is well utilized, well tested, and recognized by the wider community.\nTo this end, all software, datasets, models, and other artifacts resulting from the work on this effort will be released to the government with unlimited rights.\nThis will allow our customers to re-use the products of this SBIR in follow-on work, as well as other beneﬁting efforts and programs.\nIf permitted by the government, Kitware typically requests an effort be made to open source the products of our work to the wider community outside of the DoD/IC.\nIn the DoD/IC space, our open source policy translates into a business model where we deliver R&D services to produce capabilities that we then deliver to a restricted community in an open source manner.\nTypically all work done is delivered to the government with unlimited rights, and we strive to provide the source data, model, code, and seek publication of our results at the appropriate security level.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n9",
        "17": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\n3.4 Statement of Work 3.4.1 Scope Kitware will research techniques for enabling a user to interact with a dynamic knowledge graph and sug- gest additional necessary changes to the graph in support of faster, more effective situational awareness, pattern of life analysis, threat detection, and targeting operations in time-constrained environments.\nAs part of this investigation, methods will be explored and evaluated for their ability to solve the problem of traversing large production knowledge graphs for key nodes and subgraphs of relevance to recent user interaction.\nKitware will investigate methods of suggesting speciﬁc changes to these relevant nodes based on user feedback.\nThe investigation will span methodologies for both knowledge graph and schema man- agement.\nA feasibility assessment will be compiled which documents the performance of these methods against the appropriate baseline performance metrics, as well as documentation of the developed tech- niques.\n3.4.2 Task Outline Task 1: Investigate methods for compressed sub-graph representation.\nKitware will research methods to perform feature encoding of individual nodes and edges in a graph and schema, as well as sub-graphs.\nMethods such as BERT encodings and graph convolutional neural networks, or similar methods, will be considered.\nTask 2: Investigate LLM-based graph update recommendation system.\nKitware will research various methods of using LLMs to recommend graph updates.\nThese may include approaches such as processing user activity logs, as well as identifying relevant sub-graphs to enable making recommendations on nodes, edges, and schema elements to update.\nTask 3: Investigate interactive prompt reﬁnement.\nKitware will research methods on the efﬁcacy of iterative prompt reﬁnement for the task of presenting the user with relevant graph nodes, edges, and schema elements to update.\nThese may include methods such as dynamic prompt reﬁnement in order to align LLM behavior with user goals.\nTask 4: Obtain baseline performance metrics.\nKitware will evaluate the methods under investigation against the appropriate baseline evaluation met- rics.\nThe results will be included in the feasibility study.\nPerformance metrics may include graph edit distance to ground truth graph edits created as part of this study or gathered from existing datasets.\nTask 5: Management and reporting.\nKitware will manage project execution in an iterative, agile manner.\nStatus reports will be prepared quarterly (or as required) as well as a ﬁnal report with which details the ﬁndings of our investigation.\n3.4.3 Milestone Schedule In Figure 6 we show the anticipated schedule and deliverables for this effort.\nAny software and models developed to support Phase 1 research will be research prototypes and not production-ready code.\n10",
        "18": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nFigure 6: Program Schedule.\n3.4.4 Deliverables 1.\nFinal written report documenting our feasibility assessment and developed prototype software and models.\n11",
        "19": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\n4 Related Work The following sections discuss our related work.\nA table of contact information and end dates for programs discussed below is provided in Section 4.5.\n4.1 AFRL Redforce Kitware is a long time performer on the AFRL RI red- force program, which deals generally with production- izing deep learning models within an ecosystem of apps, including FuelAI (a data annotation platform) and WingmanAI (an MLOPs platform).\nWe have de- ployed dozens of models to IL5, SIPRnet, and JWICs over the course of this effort in support of warﬁghter and researcher needs.\nRecently, the team deployed the ﬁrst open source LLM model to the high side via Wing- manAI [26].\nThis model supports AF DCGS operations and ships many modern features of an LLM system in- cluding chat history, RAG, and more.\nWe have gained extensive experience in manipulating the prompts of LLMs and VLMs to elicit the desired behavior from these models.\n4.2 Army Tech Marketplace On the Army Tech Marketplace program, we are part of a team that seeks to build a platform for enhanc- ing government PM situational awareness around re- search topics of interest.\nThe primary goal is to support program planning activities, networking, and learning.\nKitware is working to exploit the capabilities of mod- ern LLM models to ingest highly unstructured data and compute a Knowledge Graph of entities and relation- ships.\nThis can then be used to inform PM searches of certain topics, enabling them to make in formed de- cisions about resource allocation, deconﬂict program overlaps, enable connectivity between participants on the platform (including PMs, vendors, requirements shops), and more.\nWe are also exploring methods sup- port direct search against large knowledge graphs con- taining data related to performer history, state of the art research, and other topics.\n4.3 DARPA Learning with Less Labeling Under the DARPA Learning with Less Labeling (LwLL) effort, we solved DoD-relevant, supervision-denied problems with our Label-Efﬁcient Active Resilient Net- work (LEARN) framework.\nProf.\nTrevor Darrell was the PI of the project with Kitware subcontracting.\nWe employed unsupervised and self-supervised learning on unlabeled [29–31] data to develop optimal base rep- resentations, which were reﬁned by ﬁne-tuning related tasks (“transfer learning”) [32].\nRelated tasks were found based by training data similarity (with or with- out labels), and/or available metadata or task speciﬁca- tions [33–36].\nSee 9 for our few-shot detection results.\nFigure 7: Our open source LLM chat engine which we have deployed to operations throughout the AF DCGS.\nFigure 8: We are building a backend system for the Army Tech Marketplace program which ingests un- structured data (such as contracts, news articles, pa- pers, etc...) and produces Knowledge Graphs.\nThis is done with promptable LLMs.\nFigure 9: Our LwLL few-shot results showing how two of our unsupervised pertaining algorithms (De- treg [27] and CutLER [28] improve detection.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n12",
        "20": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nAn independent evaluator measured success by accuracy or mAP score on multiple unknown datasets.\nThese same methods, which generally exploit foundational models to extract feature-rich vectors, will be used on WEAVER to characterize nodes and sub-graphs for efﬁcient graph compression and search.\n4.4 KG Generation for Metabolomics Under the NIH KG for Metabolomics program, Kitware is working to apply Knowledge Graphs to the task of automatic extraction of SME knowledge from authoritative sources such as text books, papers, and lec- ture notes.\nThis information is encoded into a Knowledge Graph via direct prompt of a Large Language Model.\nWe achieve this via Retrieval-Augmented Generation (RAG), which enables the LLM to pull di- rectly from the source material when extracting and linking entities into the Knowledge Graph, according to a schema of possible relationships which is also provided.\nThe goal is to use this knowledge graph to provide timely SME-level advice for researchers and practitioners, accessible via a natural language inter- face provided by an additional LLM that can reason about the KG and answer user questions.\nThere is no current plan to investigate ﬁne-tuning the graphs on in-domain data, but this may be a focus on Phase 2 and beyond.\n4.5 Related Work Contacts Individual contacts and end dates for the programs discussed above are found in the table below.\nProgram Program Manager Contact End Date Mr.\nMorgan Bishop AFRL redforce Mr.\nPaul Reid Army Tech Marketplace DARPA Learning with Less Labels Bruce Draper NIH KG for Metabolomics Wiriya Rutvisuttinunt (315) 795-6290 Oct 2025 Nov 2025 - Oct 2022 - Sep 2025 - 5 Relationship with Future Research or Research and Development The anticipated result of the proposed approach, if successful, is a proof of concept prototype of a system that can generate graph and schema update suggestions and allow a user to rapidly curate these changes in support of a highly dynamic mission.\nThe experiments in Phase I and feedback from the government will help revise the directions for Phase II research.\nWe will determine which approaches are most promising to continue and establish an experimental framework for validating results into Phase II.\nThe software we develop in Phase I will directly lay the foundation for improvements in Phase II.\nWe will use the results of the Phase I study to design and implement a larger scale, more integral system in Phase II.\nFurther development beyond Phase II will lead directly to the commercialization of our system, initially for the DoD and intelligence community and subsequently for the civilian market; this is detailed further in Section 6.\nKitware has a history of technology transition, and is committed to seeing this program move through the commercialization process as a central product within our defense systems portfolio.\nKitware has successfully transitioned software for Angel Fire to the Air Force Research Laboratory (AFRL), which was deployed operationally.\nIn addition, Kitware’s full-frame, frame-rate WAMI tracker was operationally deployed to Afghanistan as part of the Air Force’s Blue Devil system.\nOther systems like TeleSculptor and VIGILANT are currently being evaluated and approved for transition into operation.\nWe have also transitioned multiple algorithms to deployment via the FuelAI and WingmanAI platforms.\nShould Phase II and beyond require algorithm evaluation on classiﬁed data.\nKitware is fully prepared for this.\nWe have classiﬁed processing facilities (Section 9) and cleared personnel (Section 7).\n6 Commercialization Strategy Kitware’s commercialization strategy is built on a service-based, open source business model.\nOpen source software attracts customers who prefer applications tailored to their needs.\nWith permission, we will re- lease all general-purpose software developed for this SBIR under permissive BSD licenses, and we plan to generate revenue via customization, support, training, and research contracts.\nKitware has extensive expe- rience customizing existing technology for government, research, and commercial organizations and will leverage existing relationships and software deployments.\nOur business model, reﬁned over two decades, has enabled us to serve as prime contractor and project lead on numerous federally and commercially funded endeavors, as illustrated in the Company Commercialization Report (Volume 4).\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n13",
        "21": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\n6.1 Overview and Value Proposition Our solution, WEAVER, will have immediate military applications for situational awareness, pattern of life analysis, threat detection, and targeting operations in time-constrained environments.\nThe same soft- ware will be equally useful for a variety of commercial domains including health care, ﬁnance, banking and manufacturing.\nWith the government’s permission, Kitware intends to work with a variety of com- mercial companies to offer the framework as part of their product packages to end users.\nThe costs for implementing the software portion of this commercialization strategy are absorbed into the development of the technology and Kitware’s operating expenses; no additional costs will be incurred to commercialize the software.\nThe project will be developed and produced with SBIR funding.\nThe actions necessary to im- plement the commercialization strategy are primarily networking and business development, conference attendance to promote the technology, and additional marketing and communications efforts provided by Kitware’s highly experienced in-house Business Development Team, which are covered in Kitware’s oper- ating expenses.\n6.2 Market and Competitive Advantage The demand for technologies such as WEAVER is anticipated to grow as organizations seek advanced tools for data integration and analysis.\nThe defense sector, in particular, is investing in solutions that en- hance operational efﬁciency and decision-making capabilities.\nCompanies developing interactive dynamic knowledge graph technologies are well-positioned to meet these needs, offering signiﬁcant opportunities in both defense and cybersecurity markets.\nIn cybersecurity, knowledge graphs are employed to model com- plex relationships between entities, aiding in threat intelligence and situational awareness.\nThey enable the integration of diverse data sources, facilitating advanced analytics and decision-making [37].\nBeyond defense and cybersecurity, interactive dynamic knowledge graphs are increasingly adopted across various commercial sectors to enhance situational awareness, pattern-of-life analysis, and decision- making in time-sensitive environments [38]: • Healthcare: In healthcare, knowledge graphs integrate diverse medical data, facilitating real-time pa- tient monitoring, anomaly detection, and personalized treatment plans.\nThey support rapid decision- making by providing comprehensive views of patient histories and potential health risks.\nThe global healthcare analytics market, which includes knowledge graph applications, was valued at approxi- mately $44.83 billion in 2024 to $133.19 billion by 2029, reﬂecting a compound annual growth rate (CAGR) of 24.3% [39].\nThis growth is driven by the increasing need for data integration and real-time analytics to enhance patient care and operational efﬁciency.\n• Finance and Banking: Financial institutions utilize knowledge graphs for fraud detection, risk assess- ment, and compliance monitoring, and are investing in advanced analytics to navigate complex regu- latory environments and mitigate risks effectively.\nBy mapping complex relationships between trans- actions and entities, they can identify suspicious patterns and respond swiftly to potential threats.\nThe global ﬁnancial analytics market was valued at $8.78 billion in 2023 and is projected to grow from $9.68 billion in 2024 and reach $23.04 billion by 2032, with a CAGR of 11.5% [40].\nIncreasing adoption of pervasive computing devices, rising advanced storage capabilities, and growing innovation of new analytical tools are providing new opportunities to market participants, which is driving the growth of the global ﬁnancial analytics market.\n• Manufacturing: In manufacturing, knowledge graphs assist in monitoring production processes, pre- dicting equipment failures, and optimizing maintenance schedules.\nThey enable quick responses to operational anomalies, reducing downtime and improving productivity.\nThe global manufacturing analytics market, leveraging knowledge graphs for process optimization and predictive maintenance, was valued at $12.8 billion in 2023.\nIt is projected to grow to $60.5 billion by 2032, with a CAGR of 18.2% [41].\nThe adoption of Industry 4.0 practices and the emphasis on operational efﬁciency con- tribute to this expansion.\nThe adoption of interactive dynamic knowledge graphs across these sectors underscores their versatility in enhancing situational awareness and decision-making in complex, time-constrained environments.\nThe competitive landscape features key players such as Neo4j, Stardog, Ontotext, Linkurious, and DataWalk.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n14",
        "22": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nAll of these commercially oriented competitors offer closed-source products with licensing and subscription costs (with the exception of Neo4j; however its advanced features and enterprise-level support are available only in their commercial editions).\nKitware’s open source business model provides many competitive ad- vantages: free and open source software accessible on any budget; local data processing for higher security; technology that is optimized for military applications; and highly modular software that is swappable and plug-in friendly for maximum customizability.\nKitware has successfully commercialized similar tools in the past.\nBased on an assessment of current contracts for our services and a historical analysis of projects similar in scale and duration, we anticipate revenue from the following sources: • Collaborative Research Contracts: Our close ties to the research community typically lead to numer- ous opportunities to collaboratively pursue research funding.\n• Custom Solutions Contracts: Federal and commercial organizations often approach Kitware to pro- vide custom software and R&D services to more efﬁciently tailor our solutions to their speciﬁc needs.\n• Support Contracts: Dedicated resources for answering questions, customized training courses, and debugging assistance.\nOur business model sets us apart from competing offerings, as it provides the ability to improve the platform in-house and promotes partnerships and collaborations freely with no licensing or maintenance fees.\nThese elements will give Kitware a competitive advantage in the targeted markets.\n6.3 Commercialization Schedule We expect yearly revenues from the developed technology to start at $190K upon completion of this effort and grow to approximately $1.56M per year over the next 5 years, as shown in Table 2.\nRevenue Source Research Contracts ($50K-$500K each) Custom Solutions Contracts ($50K-$500K each) Support Contracts ($10K-$20K each) Gross Revenues Table 2: Anticipated revenues.\n# Revenue # Revenue # Revenue 2029 1 2028 1 $250K $250K 2027 0 $0K 1 2031 2 $500K 6 $900K 8 4 2 $160K $80K $40K $190K $610K $930K $1.12M $1.56M 2 $150K $300K $600K 3 $60K 2030 1 $250K 5 $750K 6 $120K 4 7 Key Personnel Daniel Davila, PI, U.S.\nCitizen, TS/SCI Daniel Davila is a Technical Leader at Kitware, joining in 2019.\nA career research engineer, he has over 8 years of experience in the Energy, Space, and Defense Industries.\nMr.\nDavila’s expertise lies applied deep learning systems development and deployment, systems engineering, and project leadership.\nHe serves as Principal Investigator on multiple ongoing Air Force Research Laboratory (AFRL) programs including FuelAI, redforce, Wingman, and TAKML.\nOn FuelAI and Wingman, his team focuses on the AI lifecycle considerations within the MLOPs platform, as well as the development and deployment of LLMs and VLMs to the WingmanAI chat feature.\nThis project team recently deployed the ﬁrst open source high side model to analysts within the AF DCGS.\nOn another program, Mr.\nDavila leads the development of a LLM- based knowledge graph generation tool for the Army SBIR ofﬁce.\nThis work is focused on improving the quality of literature review for government PMs in the program planning stage.\nDuring his time at Kitware, Mr.\nDavila has also served as PI or tech lead on various programs related to distributed ATR and tracking systems, including for the C5ISR MMP program, the DARPA URSA tracking program, and efforts for customers at NGA, Air Force, Navy, DARPA, and IARPA.\nMr.\nDavila received his master’s and bachelor’s degrees in Electrical Engineering from the Georgia Institute of Technology.\nRecent Publications: [4], [5], [42], [43].\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n15",
        "23": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\nBrian Clipp, Artiﬁcial Intelligence SME, U.S.\nCitizen, TS/SCI Brian Clipp, Ph.D.\nis an Assistant Director on the Computer Vision Team.\nHe leads R&D projects across a range of areas including ﬁne-grained attributed-based object classiﬁcation; zero-shot object detection; and satellite image segmentation.\nHe has led projects for NGA, DARPA, AFRL, IARPA, and C5ISR.\nDr.\nClipp has published over 20 articles in peer-reviewed artiﬁcial intelligence, computer vision and robotics conferences and journals [44, 45] and holds three U.S.\npatents.\nHe has served as workshop chair for CVPR 2025, on organizing committees for WACV 2024 and 2025, as an area chair (CVPR,ECCV, and WACV) and as a reviewer for numerous top-tier computer vision conferences and journals.\nDr.\nClipp earned his Ph.D.\nin 2010 from UNC Chapel Hill.\n8 Foreign Citizens There will not be any foreign nationals working on this effort.\n9 Facilities and Equipment Kitware’s ofﬁces in Clifton Park, NY, Carrboro, NC, Minneapolis, MN, and Arlington, VA all meet federal, state, and local environmental laws and regulations.\nThe proposed work will be performed primarily in the Clifton Park, NY ofﬁce, with support from staff in other ofﬁces.\nKitware has a mixed environment of personal and shared computing platforms.\nEmployees average three computers per person (desktop, lap- top, and/or home system), with each computer typically equipped with multiple multi-core processors, high-performance graphics cards, and dual monitors.\nPersonal systems run a mix of Windows, MacOS, and Linux operating systems.\nShared resources include compilation and testing farms as well as worksta- tions running a variety of alternative operating systems for testing purposes (e.g.\nWindows, CentOS, and Ubuntu).\nKitware hosts several special-purpose, high-end workstations and GPU systems, and maintains several servers to provide public access to the open source systems (VTK, CMake, etc.), as well as support- ing internal software development efforts.\nKitware has both a Secret and a Top Secret facility clearance, with certiﬁcation for storage and processing at the Secret level.\nOver 50 members of the team have clear- ances, with over two dozen members of the vision group have TS clearances, and several of them have SCI clearances.\nWe have access to TS level processing facilities at two of our four ofﬁces, including the Clifton Park and Carrboro locations.\nWhere applicable, the proposed performance locations meet environmental laws and regulations of Federal, state, and local Governments for, but not limited to, airborne emissions, waterborne efﬂuents, external radiation levels, outdoor noise, solid and bulk waste disposal practices, and handling and storage of toxic and hazardous materials.\nThere is no requested hardware budget on this program.\nWe anticipate that all compute and data storage needs are covered by our existing infrastructure.\n10 Subcontractors/Consultants There will be no subcontractors on this effort.\n11 Prior, Current, or Pending Support of Similar Proposals or Awards No prior, current, or pending support for proposed work.\nReferences [1] L.\nWang, Y.\nXiao, B.\nShao, and H.\nWang, “How to partition a billion-node graph,” in 2014 IEEE 30th International Conference on Data Engineering, 2014, pp.\n568–579.\n[2] M.\nNickel, K.\nMurphy, V.\nTresp, and E.\nGabrilovich, “A review of relational machine learning for knowledge graphs,” Proceedings of the IEEE, vol.\n104, no.\n1, pp.\n11–33, 2016.\n[3] B.\nHu, B.\nRay, A.\nLeung, and A.\nBasharat, “Language models are alignable decision-makers: Dataset and application to the medical triage domain,” in Proceedings of the 2024 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (Volume 6: Industry Track), 2024.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n16",
        "24": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\n[4] D.\nDavila, J.\nAnderson, M.\nBernstein, L.\nMarino, D.\nBowen, M.\nBishop, and S.\nFee, “Large pretrained models (lptm) for multimodal data curation and annotation,” in Proceedings of the National Security Sensor and Data Fusion Committee (NSSDF), 2024.\n[5] D.\nDavila, J.\nAnderson, and M.\nBernstein, “Large pretrained models (lptm) for unstructured data search and data annotation,” in Naval Applications of Machine Learning (NAML), 2024.\n[6] D.\nDu, A.\nShringi, A.\nHoogs, and C.\nFunk, “Reconstructing humpty dumpty: Multi-feature graph autoencoder for open set action recognition,” in 2023 IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2023.\n[7] Kitware, “Cmake - the cross-platform, open-source build system,” http://www.cmake.org/.\n[8] Kitware, “KWIVER – Kitware Image and Video Exploitation and Retrieval,” http://www.kwiver.org/.\n[9] Kitware, “TeleSculptor: Aerial photogrammetry application powered by kwiver,” https://github.\ncom/Kitware/TeleSculptor/.\n[10] Kitware, “Super3D – super resolution and dense depth estimation,” https://github.com/kitware/ super3d.\n[11] Kitware, “VIBRANT – Video and Image-Based Retrieval and Analysis Toolkit,” https://github.com/ kitware/vibrant.\n[12] Kitware, “VTK – the visualization toolkit,” http://www.vtk.org.\n[13] Y.\nZhou, A.\nI.\nMuresanu, Z.\nHan, K.\nPaster, S.\nPitis, H.\nChan, and J.\nBa, “Large Language Models Are Human-Level Prompt Engineers,” Mar.\n2023, arXiv:2211.01910.\n[Online].\nAvailable: http://arxiv.org/abs/2211.01910 [14] J.\nDevlin, M.-W.\nChang, K.\nLee, and K.\nToutanova, “Bert: Pre-training of deep bidirectional the Association for https://api.semanticscholar.org/CorpusID: transformers for language understanding,” in North American Chapter of Computational Linguistics, 2019.\n52967399 [Online].\nAvailable: [15] T.\nKipf and M.\nWelling, “Semi-supervised classiﬁcation with graph convolutional networks,” ArXiv, vol.\nabs/1609.02907, 2016.\n[Online].\nAvailable: https://api.semanticscholar.org/CorpusID:3144218 [16] A.\nAbid, A.\nAbdalla, A.\nAbid, D.\nKhan, A.\nAlfozan, and J.\nZou, “Gradio: Hassle-free sharing and testing of ml models in the wild,” arXiv preprint arXiv:1906.02569, 2019.\n[17] P.\nAvery, S.\nJourdain, and P.\nO’Leary, “trame: an Open Source Framework for Efﬁciently Building Interactive Visualization and Analysis Applications,” Microscopy and Microanalysis, vol.\n30, no.\nSupplement_1, p.\nozae044.1100, 07 2024.\n[Online].\nAvailable: https://doi.org/10.1093/mam/ozae044.\n1100 [18] D.\nVrandeˇci´c and M.\nKrötzsch, “Wikidata: a free collaborative knowledgebase,” Commun.\nACM, vol.\n57, no.\n10, p.\n78–85, Sep.\n2014.\n[Online].\nAvailable: https://doi.org/10.1145/2629489 [19] K.\nBollacker, C.\nEvans, P.\nParitosh, T.\nSturge, and J.\nTaylor, “Freebase: a collaboratively created graph database for structuring human knowledge,” in Proceedings of the 2008 ACM SIGMOD International Conference on Management of Data, ser.\nSIGMOD ’08.\nNew York, NY, USA: Association for Computing Machinery, 2008, p.\n1247–1250.\n[Online].\nAvailable: https://doi.org/10.1145/1376616.1376746 [20] J.\nLehmann, R.\nIsele, M.\nJakob, A.\nJentzsch, D.\nKontokostas, P.\nN.\nMendes, S.\nHellmann, M.\nMorsey, P.\nvan Kleef, S.\nAuer, and C.\nBizer, “Dbpedia - a large-scale, multilingual knowledge base extracted from wikipedia,” Semantic Web, vol.\n6, pp.\n167–195, 2015.\n[Online].\nAvailable: https://api.semanticscholar.org/CorpusID:1181640 [21] F.\nM.\nSuchanek, M.\nAlam, T.\nBonald, L.\nChen, P.-H.\nParis, and J.\nSoria, “Yago 4.5: A large and clean knowledge base with a rich taxonomy,” in Proceedings of the 47th International ACM in Information Retrieval, ser.\nSIGIR ’24.\nNew SIGIR Conference on Research and Development York, NY, USA: Association for Computing Machinery, 2024, p.\n131–140.\n[Online].\nAvailable: https://doi.org/10.1145/3626772.3657876 [22] K.\nJärvelin and J.\nKekäläinen, “Cumulated gain-based evaluation of ir techniques,” ACM Trans.\nInf.\nSyst., vol.\n20, no.\n4, p.\n422–446, Oct.\n2002.\n[Online].\nAvailable: https://doi.org/10.1145/582415.582418 [23] I.\nJovanovi´c and Z.\nStani´c, “Spectral distances of graphs,” Linear Algebra and its Applications, vol.\n436, no.\n5, pp.\n1425–1435, 2012.\n[Online].\nAvailable: https://www.sciencedirect.com/science/article/pii/ S0024379511006021 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n17",
        "25": "Topic AF244-001 Proposal F244-0001-0093 Kitware, Inc.\n[24] A.\nSanfeliu and K.-S.\nFu, “A distance measure between attributed relational graphs for pattern recog- nition,” IEEE Transactions on Systems, Man, and Cybernetics, vol.\nSMC-13, no.\n3, pp.\n353–362, 1983.\n[25] Kitware, “Paraview,” https://www.paraview.org.\n[26] Kitware, “WingmanAI – AFRL GOTS Tool for Full ML Model Lifecycle Management,” https:// wingmanai-mission.odin.dso.mil/.\n[27] A.\nBar, X.\nWang, V.\nKantorov, C.\nJ.\nReed, R.\nHerzig, G.\nChechik, A.\nRohrbach, T.\nDarrell, and A.\nGlober- son, “Detreg: Unsupervised pretraining with region priors for object detection,” in CVPR, 2022.\n[28] X.\nWang, R.\nGirdhar, S.\nX.\nYu, and I.\nMisra, “Cut and learn for unsupervised object detection and instance segmentation,” in Conference on computer vision and pattern recognition, 2023, pp.\n3124–3134.\n[29] C.\nJ.\nReed et al., “Self-supervised pretraining improves self-supervised pretraining,” in WACV, 2022.\n[30] T.\nXiao, C.\nJ.\nReed, X.\nWang, K.\nKeutzer, and T.\nDarrell, “Region similarity representation learning,” in International Conference on Computer Vision, 2021, pp.\n10 539–10 548.\n[31] T.\nXiao, X.\nWang, A.\nA.\nEfros, and T.\nDarrell, “What should not be contrastive in contrastive learning,” in International Conference on Learning Representations, 2020.\n[32] K.\nSaito, P.\nHu, T.\nDarrell, and K.\nSaenko, “Learning to detect every thing in an open world,” in ECCV.\nSpringer, 2022, pp.\n268–284.\n[33] Y.\nChen, Z.\nLiu, H.\nXu, T.\nDarrell, and X.\nWang, “Meta-baseline: exploring simple meta-learning for few-shot learning,” in ICCV, 2021, pp.\n9062–9071.\n[34] X.\nWang, T.\nE.\nHuang, T.\nDarrell, J.\nE.\nGonzalez, and F.\nYu, “Frustratingly simple few-shot object detection,” in International Conference on Machine Learning, 2020, pp.\n9919–9928.\n[35] H.\nXu, X.\nSun, E.\nTzeng, A.\nDas, K.\nSaenko, and T.\nDarrell, “Revisiting few-shot activity detection with class similarity control,” arXiv preprint arXiv:2004.00137, 2020.\n[36] X.\nYue, Z.\nZheng, S.\nZhang, Y.\nGao, T.\nDarrell, K.\nKeutzer, and A.\nS.\nVincentelli, “Prototypical cross- domain self-supervised learning for few-shot unsupervised domain adaptation,” in CVPR, 2021, pp.\n13 834–13 844.\n[37] Sikos, L.F., https://link.springer.com/article/10.1007/ “Cybersecurity knowledge graphs,” s10115-023-01860-3, 2023.\n[38] Wisecube, “20 Real-World Industrial Applications of Knowledge Graphs,” https://www.wisecube.ai/ blog/20-real-world-industrial-applications-of-knowledge-graphs/, 2022.\n[39] MarketsandMarkets, “Healthcare Analytics Market by Type: Growth, Size, Share, and Trends,” https: //www.marketsandmarkets.com/Market-Reports/healthcare-data-analytics-market-905.html, 2024.\nhttps://www.\n“Financial Analytics Market [2024-2032],” [40] Fortune Business Insights, fortunebusinessinsights.com/ﬁnancial-analytics-market-107948, 2024.\n[41] IMARC Reports, “Manufacturing Analytics Market Report [2024-2032],” https://www.imarcgroup.\ncom/manufacturing-analytics-market, 2024.\n[42] D.\nDavila, D.\nMelamed, D.\nDepauw, and J.\nAnderson, “Multi-atr fusion and ontological deconﬂic- tion for geospatial imagery,” in Proceedings of the National Security Sensor and Data Fusion Committee (NSSDF), 2023.\n[43] D.\nDavila, D.\nDu, B.\nLewis, C.\nFunk, J.\nVan Pelt, R.\nCollins, K.\nCorona, M.\nBrown, S.\nMcCloskey, A.\nHoogs et al., “Mevid: Multi-view extended videos with identities for video person re-identiﬁcation,” in Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision, 2023, pp.\n1634–1643.\n[44] C.\nJ.\nReed, R.\nGupta, S.\nLi, S.\nBrockman, C.\nFunk, B.\nClipp, S.\nCandido, M.\nUyttendaele, and T.\nDarrell, “Scale-mae: A scale-aware masked autoencoder for multiscale geospatial representation learning,” in International Conference on Computer Vision, 2023, pp.\n4088–4099.\n[45] R.\nYu, D.\nDu, R.\nLaLonde, D.\nDavila, C.\nFunk, A.\nHoogs, and B.\nClipp, “Cascade transformers for end-to-end person search,” in CVPR, 2022.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n18",
        "26": "Daniel Davila daniel.davila@kitware.com Technical Leader - AI Group Core Skills ● AI, Machine Learning, Deep Learning ● Large Language Models, Graph Neural Networks, Knowledge Graphs ● Automated target recognition, reid, tracking ● Project Management & Business Development ● Leadership, Team Development ● Torch, Keras, Caffe ● Python, C++ ● Docker, Distributed Computing, AWS ● TS/SCI Cleared Experience Technical Leader Kitware, Inc - Carrboro, NC Working within the core computer vision team as a principal investigator, product owner, and applied researcher.\nDeveloping cutting edge AI systems for customers in Defense and the Environmental Sciences.\nJuly 2019 - Present ● Principal Investigator for multiple deployed ATR and tracking systems ● Lead developer on multi-sale, multi-person detection & tracking algorithms for multi-platform RGB/IR sensing ● Lead remote and drone sensing AI/ML efforts, typically involving real-time edge sensing ● Serve as SCRUM master and product owner for several low-to-high TRL development efforts Research Engineer Southwest Research Institute - San Antonio, TX Worked alongside industry leaders in the Oil & Gas, Space, and Aerospace industries to integrate modern intelligent algorithms into legacy and cutting-edge systems.\nJune 2015 - May 2019 ● Lead engineer and project manager for $3MM Smart Leak Detection Program, a multi-platform (ground and sUAS) edge sensor for automated crude oil and methane gas leak detection ● Program manager for spaceflight analytics component ● Principal Investigator on effort to develop spacecraft embedded AI algorithms for sensor exploitation ● Promoted analytics capabilities through conference publications and presentations Education BS, MS, Electrical Engineering, Georgia Tech, Atlanta Ga 2009-2015 Recent Publications J.\nAnderson, M.\nBernstein, D.\nDavila, “Large Pretrained Models (LPTM) for Unstructured Data Search and Data Annotation,” in Naval Applications of Machine Learning (NAML), 2024.\nA.\nRomlein, A.\nLynch, B.\nClipp, D.\nDavila, A.\nBarricelli, C.\nYang, N.\nJerles, B.\nBurns, M.\nAeillo, “Long-Term Tracking and Re-Identification for Threat Quantification in Unmanned Aircraft System Video,” in Military Sensing Symposium (MSS), 2024.\nD.\nDavila, D.\nMelamed, D.\nDepauw, and J.\nAnderson, \"Multi-ATR Fusion and Ontological Deconfliction for Geospatial Imagery,\" in Proceedings of the National Security Sensor and Data Fusion Committee (NSSDF), 2023.\nD.\nDavila, D.\nDu, B.\nLewis, C.\nFunk, J.\nVan Pelt, R.\nCollins, K.\nCorona, M.\nBrown, S.\nMcCloskey, A.\nHoogs, and B.\nClipp, \"MEVID: Multi-view Extended Videos with Identities for Video Person Re-Identification,\" in IEEE/CVF Winter Conference on Applications of Computer Vision (WACV), 2023.",
        "27": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Duns Cage F244-0001-0093 AF244-0001 WEAVER: An Intelligent System For Interactive Knowledge Graph Maintenance 11/05/2024 10:41:32 PM Kitware 1712 Route 9 Suite 300, Clifton Park, New York, 12065 http://www.kitware.com DK6LPWMS5LP5 010926207 1DKA7 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 36.7%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (10.5%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) $139,999.58 $139,999.58 $0.00 $0.00 $0.00 $92,682.12 $0.00 $0.00 $0.00 $0.00 $0.00 $34,014.34 $126,696.46 $0.00 -$0.00 $13,303.13 $139,999.58 $0.00 $0.00 $0.00",
        "28": "Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Computer and Information Research Scientist/ Principal Investigator (Daniel Davila) Computer and Information Research Scientist/ Other Key Personnel (Brian Clipp) Computer and Information Research Scientist/ Research and Development Engineer 1 Subtotal Direct Labor (DL) Labor Overhead (rate 87%) x (DL) Total Direct Labor (TDL) G&A (rate 0%) x Base (TDL+TOH) Cost Sharing Profit Rate (10.5%) Total Estimated Cost TABA Year 2 Direct Labor Costs $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $85.08 156.60 $13,323.53 $112.54 52.20 $5,874.59 $55.12 550.88 $30,364.51 $49,562.63 $43,119.49 $92,682.12 $34,014.34 -$0.00 $13,303.13 $139,999.58 $0.00 Category / Individual-TR Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost Computer and Information Research $85.08 0 $0.00",
        "29": "Scientist/ Principal Investigator (Daniel Davila) Subtotal Direct Labor (DL) Labor Overhead (rate 0%) x (DL) Total Direct Labor (TDL) G&A (rate 0%) x Base (TDL+TOH) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Mary Key Phone: (518) 371-3971 Phone: mary.key@kitware.com Title: Proposal Owner $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: Yes Audit Agency Name: Defense Contract Audit Agency Audit Agency POC: Matthew Fischer Address: 375 Saratoga Road, Glenville, New York,12302 Phone: (571) 448-4685 Email: matthew.d.fischer5.civ@mail.mil Select the Type of Payment Desired: Partial payments",
        "30": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Computer and Information Research Scientist Computer and Information Research Scientist Principal Investigator Master's Degree Other Key Personnel PhD Computer and Information Research Scientist Research and Development Engineer 1 Bachelor's Degree 9 16 0 156.60 $85.08 $13,323.53 52.20 $112.54 $5,874.59 550.88 $55.12 $30,364.51 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nLabor mix is based on skill set and expertise required by the project.\nRates are in line w/ industry standards and reflect actual rate where applicable.\nSupporting information available upon request.\nDirect Labor Cost ($): Year2 $49,562.63 Category Description Education Yrs Experience Hours Rate Fringe Rate Computer and Information Research Scientist Principal Investigator Master's Degree 9 0 $85.08 Are the labor rates detailed below fully loaded?\nProvide any additional information and cost support data related to the nature of the direct labor detailed above.\nN/A - no Year 2.\nTopic duration is 6 months.\nDirect Labor Cost ($): Total $0.00 NO $0.00",
        "31": "Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) Overhead Comments: Direct Labor Overhead Cost ($): Year2 Labor Cost Overhead Rate (%) Overhead Comments: N/A - no Year 2.\nTopic duration is 6 months.\nOverhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nDirect Labor, Overhead, Travel, Other Direct Costs, Materials and Subcontractor Administration G&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\n$49,562.63 87 $43,119.49 0 $0.00 $43,119.49 36.7 YES YES $34,014.34 0 YES YES",
        "32": "Please specify the different cost sources below from which your company's General and Administrative costs are calculated.\nN/A - no Year 2.\nTopic duration is 6 months.\nG&A Cost ($): Sum of all G&A Costs is ($): Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Kitware's fee is based on risk factors including technical challenges, performance, cost, and administrative.\nTotal Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: N/A - no Year 2.\nTopic duration is 6 months.\nTotal Profit Cost ($): Total Proposed Amount ($): $0.00 $34,014.34 - 10.5 $13,303.13 - 0 $13,303.13 $139,999.58",
        "33": "SBIR Company Commercialization Report KITWARE INC DISCLAIMER: Information provided herein is privileged and confidential, and not subject to disclosure, pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nThis information shall only be used or disclosed for evaluation purposes.\nPrivileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 1/33",
        "34": "SBIR Company Commercialization Report Total Investments: Total Sales: Total Patents: $59,756,184.00 Company Information Address: $41,927,674.00 0 1712 ROUTE 9 STE 300 HALFMOON, NY 12065-3104 United States Government Designated Phase III Funding: $0.00 SBC Control ID: SBC_000001978 Company Url: https://www.kitware.com Company POC Title: CEO Full Name: Lisa Avila Phone: Email: 5188814903 contracts@kitware.com Additional Company Information % Revenue for last fiscal year from SBIR/STTR funding: 23.7% Year Founded: 1998 Commercialization POC Title: Senior Contracts Administrator Full Name: Adrien Beaudet Phone: Email: (518) 371-3971 proposals@kitware.com Total revenue for last fiscal year: $20,000,000 - $99,999,999 # Employees Currently: 195 Year first Phase I award received: # SBIR/STTR Phase I Awards: 1998 119 Year first Phase II award received: # SBIR/STTR Phase II Awards: 2003 71 # Employees at first Phase II award: Mergers and Acquisition within past 2 years: 12 No Spin-offs resulting from SBIR/STTR: IPO resulting from SBIR/STTR | Year of IPO: No No | N/A Patents resulting from SBIR/STTR | #Patents: List of Patents: No | N/A Woman-Owned: No HUBZone-Certified: No Socially and Economically Disadvantaged: No SBC majority-owned by multiple VCOC, HF, PE firms | By what percent (%): No | 0.00% Additional Investment From DoD contracts/DoD subcontracts $24,089,081.00 $24,089,081.00 Last Submitted Version (10-10-2023 12:03 PM) Current Version Angel Investors Venture Capital Self Funded Private Sector Other Federal Contracts/Grants Other Sources Additional Investment Total Investment $0.00 $0.00 $0.00 $2,270,480.00 $33,042,367.00 $354,256.00 $0.00 $59,756,184.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 $0.00 $0.00 $0.00 $2,270,480.00 $33,042,367.00 $354,256.00 $0.00 $59,756,184.00 Page 2/33",
        "35": "SBIR Company Commercialization Report Phase III Sales To DoD or DoD prime contractors Private Sector Export Markets Other Federal Agencies Additional commercialization by 3rd Party Revenue Other Customers Additional Sales Total Sales Government Phase III Contracts Last Submitted Version (10-10-2023 12:03 PM) $18,857,988.00 $7,281,319.00 $640,935.00 $14,972,078.00 $0.00 $175,354.00 $0.00 $41,927,674.00 Last Submitted Version (10-10-2023 12:03 PM) Current Version $18,857,988.00 $7,281,319.00 $640,935.00 $14,972,078.00 $0.00 $175,354.00 $0.00 $41,927,674.00 Current Version Funding Obligated $0.00 $0.00 Commercialization Narrative Note that our percentage for STTR commercialization is 100%, and the university partner is listed as 0% due to the open-source nature of our collaborative work.\nEach team independently commercializes the technology (and has equal access to it through the open source code base).\nHence the numbers we report are for Kitware only.\nCommercialized Awards Listed below are the sales revenue and investment details resulting from the technology developed under these SBIR/STTR awards.\nTeleSculptor:Semantic 3D Scene Modeling From High Zoom Reconnaissance Video 1 of 67 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2018 Subsidiaries No | N/A N/A Topic #: AF161-151 Contract/Grant #: FA8650-18-C-1149 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $29,998.00 Dod or DoD prime contractors: Other Federal contract/grants: $552,566.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $582,564.00 Sales Total: $3,636,866.00 $1,920,481.00 $1,716,385.00 $0.00 $0.00 $0.00 $0.00 Multimodality Image-Based Assessment System for Traumatic Brain Injury 2 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Manufacturing related Subsidiaries No | N/A N/A Program/Phase/Year: SBIR/Phase II/2015 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 3/33",
        "36": "SBIR Company Commercialization Report Topic #: 101 Contract/Grant #: 2R44NS081792-03A1 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $227,621.00 Dod or DoD prime contractors: $227,621.00 Other Federal contract/grants: $723,540.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $951,161.00 Sales Total: $227,621.00 Generating Labeled Voxelizations for Numerical Simulation 3 of 67 Agency/Branch: Department of Defense/Air Force Manufacturing related Yes | Systems Level Manufacturing N/A Program/Phase/Year: SBIR/Phase II/2007 Topic #: AF06-034 Contract/Grant #: FA8650-07-C-6756 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Subsidiaries Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $252,283.00 Dod or DoD prime contractors: Other Federal contract/grants: $1,744,261.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $4,085.00 Other Customers: $156,128.00 Other Sources Description: combination of domestic non-profit and foreign government $417,882.00 $163,840.00 $70,295.00 $0.00 $0.00 $0.00 Investment Total: $2,156,757.00 Sales Total: $652,017.00 Collaborative Visualization for Large-Scale Accelerator Electromagnetic Modeling 4 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2009 Subsidiaries No | N/A N/A Topic #: N/A Contract/Grant #: DE-FG02-08ER85143 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: DOE, DOD b.\nSystem/Program: NNSA ASC, ASCR, DOD PETTT c.\nCost Savings: $2,000,000.00 d.\nCost Savings Type: Annual savings Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nYes a.\nPrimary Agency: Department of Energy b.\nSystem/Program: NNSA ASC, ASCR c.\nPhase III Contract #: N/A Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 4/33",
        "37": "SBIR Company Commercialization Report e.\nExplanation: This SBIR developed and enhanced collaborative and remote data analysis and visualization on the desktop and the web.\nThis capability enabled DOE and DOD laboratories to avoid purchasing high end graphical workstations for their scientists and engineers.\nWe estimate that there are roughly 2,000 ParaView users benefiting from this technology.\nThis technology will save $1,000 per user per year in their purchase of workstations.\nAdditional Investment From DoD contract/subcontract: Phase III Sales To $1,237,130.00 Dod or DoD prime contractors: Other Federal contract/grants: $2,068,815.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $70,520.00 Other Customers: $0.00 $271,267.00 $510,594.00 $386,939.00 $176,134.00 $0.00 $0.00 5 of 67 $32,500.00 $0.00 $9,723.00 $80,000.00 $0.00 $0.00 $3,376,465.00 Sales Total: $1,344,934.00 Open Source Visualization and Analysis Platform for 3D Reconstructions of Materials by Transmission Electron Microscopy Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2017 Subsidiaries No | N/A N/A Topic #: 05a Contract/Grant #: DE-SC0011385 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $32,500.00 Dod or DoD prime contractors: Other Federal contract/grants: $200,250.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $20,000.00 Other Customers: $0.00 $252,750.00 Sales Total: $122,223.00 General Online Object Deep (GOOD) Tracking Phase 2 6 of 67 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: STTR/Phase II/2019 Subsidiaries No | N/A N/A Topic #: AF17A-T027 Contract/Grant #: FA8650-19-C-1011 Achieved a cost saving or cost avoidance?: No Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 5/33",
        "38": "SBIR Company Commercialization Report Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Who initiated the collaboration?: Phase III Sales To $0.00 Dod or DoD prime contractors: $159,882.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $159,882.00 Small Business Concern Number of months taken to negotiate the Allocation of Rights agreement: 9 Who initiated the technology?: Small Business Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: Approach-specific, multi-GPU, multi-tool, high-realism neurosurgery simulation Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: SBIR/Phase II/2013 Topic #: 100 Contract/Grant #: 9R44OD018334-03A1 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $586,212.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $27,938.00 Other Customers: $0.00 $614,150.00 Sales Total: $83,813.00 70% 30% 7 of 67 $0.00 $0.00 $83,813.00 $0.00 $0.00 $0.00 Vision with a Purpose: Inferring the Function of Objects in Video 8 of 67 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2014 Subsidiaries No | N/A N/A Topic #: SB082-021 Contract/Grant #: FA8650-14-C-1798 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $22,500.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 $189,898.00 $452,439.00 Page 6/33",
        "39": "SBIR Company Commercialization Report Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $22,500.00 Sales Total: $642,337.00 MAP-Tk: Motion Imagery Aerial Photogrammetry Toolkit 9 of 67 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2014 Subsidiaries No | N/A N/A Topic #: AF131-151 Contract/Grant #: FA8650-14-C-1820 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $21,610.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $2,663,059.00 $755,125.00 $12,927.00 $0.00 $0.00 $0.00 $21,610.00 Sales Total: $3,431,111.00 GoBig: A Unified Interface to Big Data Systems 10 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2016 Subsidiaries No | N/A N/A Topic #: 01c Contract/Grant #: DE-SC0013252 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $295,615.00 Dod or DoD prime contractors: Other Federal contract/grants: $1,033,922.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $60,317.00 Other Customers: $0.00 $1,389,854.00 Sales Total: $828,601.00 $205,590.00 $337,060.00 $285,951.00 $0.00 $0.00 $0.00 Vision with a Purpose: Inferring the Function of Objects in Video Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 11 of 67 Page 7/33",
        "40": "SBIR Company Commercialization Report Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: SBIR/Phase II/2010 Topic #: SB082-021 Contract/Grant #: W31P4Q-10-C-0262 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $3,424,128.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $1,004,802.00 $174,203.00 $136,010.00 $0.00 $0.00 $0.00 $3,424,128.00 Sales Total: $1,315,015.00 Visual Global Intelligence and Analytics Toolkit (VIGILANT) 12 of 67 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2016 Subsidiaries No | N/A N/A Topic #: AF153-001 Contract/Grant #: FA8650-16-C-1717 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $57,810.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $2,968.00 Other Customers: $0.00 $60,778.00 Sales Total: $797,503.00 $0.00 $788,599.00 $8,904.00 $0.00 $0.00 $0.00 High Throughput web-base Image Analysis of Mouse Brain MR Imaging Studies 13 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: STTR/Phase II/2009 Topic #: N/A Contract/Grant #: 2R42NS059095-03 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 8/33",
        "41": "SBIR Company Commercialization Report Other Federal contract/grants: $402,667.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Who initiated the collaboration?: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $402,667.00 Sales Total: Research Institution Number of months taken to negotiate the Allocation of Rights agreement: 2 Who initiated the technology?: Research Institution Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: 54% 46% Open Source Scalable Data Services and Data Fusion forBiological and Environmental Sciences 14 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase I/2019 Subsidiaries No | N/A N/A Topic #: 01c Contract/Grant #: DE-SC0019541 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $5,500.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $5,500.00 Sales Total: $60,750.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $60,750.00 $0.00 $0.00 $0.00 Image guided Planning System for Skull Correction in Children with Craniosynostosis Phase II 15 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: STTR/Phase II/2016 Topic #: NICHD Contract/Grant #: 2R42HD081712-02 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $726,862.00 Other Federal Agencies: Angel Investors: Venture Capital: $0.00 Private Sector: $0.00 Export Market: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 $0.00 $0.00 $403,636.00 $6,540.00 Page 9/33",
        "42": "SBIR Company Commercialization Report Self-Funded: Private Sector: Other Sources: Other Sources Description: Foreign Government Investment Total: STTR Specific Information Who initiated the collaboration?: $0.00 3rd Party Revenue: $70,574.00 Other Customers: $7,000.00 $0.00 $0.00 $804,436.00 Sales Total: $410,176.00 Research Institution Number of months taken to negotiate the Allocation of Rights agreement: 4 Who initiated the technology?: Research Institution Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: 51% 49% Open Interactive Data Analytics Platform for Chemical-Physics Simulations and Experiments 16 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2018 Subsidiaries No | N/A N/A Topic #: 13a Contract/Grant #: DE-SC0017193 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $156,547.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $306,760.00 Other Customers: $0.00 $463,307.00 Sales Total: $306,760.00 Graphical HPC Application Suite for Supporting the Product Simulation Lifecycles Agency/Branch: Department of Energy Manufacturing related 17 of 67 Yes | Unit Process Level Manufacturing Program/Phase/Year: SBIR/Phase I/2012 Topic #: 02 a Contract/Grant #: DE-FG02-12ER90221 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Subsidiaries N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $730,820.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 $0.00 $0.00 $306,760.00 $0.00 $0.00 $0.00 $617,902.00 $0.00 $80,463.00 $0.00 $0.00 $0.00 Page 10/33",
        "43": "SBIR Company Commercialization Report Other Sources: Investment Total: $0.00 $730,820.00 Sales Total: $698,365.00 Web-Based Infrastructure for Comparison and Validation of Image Computing Methods 18 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: STTR/Phase II/2014 Topic #: 101 Contract/Grant #: 9R42MH106302-02 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $133,208.00 Dod or DoD prime contractors: Other Federal contract/grants: $339,210.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $652,599.00 Other Customers: $0.00 $1,125,017.00 Sales Total: $1,257,583.00 Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Who initiated the collaboration?: Research Institution Number of months taken to negotiate the Allocation of Rights agreement: Who initiated the technology?: Research Institution Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: $90,156.00 $262,050.00 $904,897.00 $480.00 $0.00 $0.00 0 0% 0% Pan3D: Open Source Scalable and Reproducible Scientific Workflows for 3D Data Analytics 19 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2023 Subsidiaries No | N/A N/A Topic #: C53-01a Contract/Grant #: DE-SC0022365 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $4,875.00 Other Customers: $0.00 $0.00 $0.00 $35,475.00 $0.00 $0.00 $0.00 $4,875.00 Sales Total: $35,475.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 11/33",
        "44": "SBIR Company Commercialization Report Quantitative Ultrasound Analysis of Vascular Morphology for Cancer Assessment 20 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Manufacturing related Program/Phase/Year: SBIR/Phase II/2015 Subsidiaries Yes | Systems Level Manufacturing N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Topic #: 102 Contract/Grant #: 2R44CA165621-03 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: SonoVol and its customers b.\nSystem/Program: SonoVol c.\nCost Savings: $840,000.00 d.\nCost Savings Type: life-cycle e.\nExplanation: Reduced manual processing time from 8 hours to 1 hour; operations performed 1,000 times per year per unit.\nAverage unit lasts 5 years.\nAverage annual salary is $50,000.\nApproximate savings is therefore $840,000 over the lifetime of each unit.\nAdditional Investment From DoD contract/subcontract: Phase III Sales To $351,747.00 Dod or DoD prime contractors: Other Federal contract/grants: $1,806,984.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $31,250.00 Other Customers: $0.00 $151,747.00 $0.00 $95,250.00 $7,700.00 $0.00 $0.00 $2,189,981.00 Sales Total: $254,697.00 Human-Machine Teaming with Machine Learning Algorithms 21 of 67 Agency/Branch: Department of Defense/Special Operations Command Program/Phase/Year: STTR/Phase II/2020 Topic #: SOCOM18B-001 Contract/Grant #: H9240520C0003 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Phase III Sales To $63,381.00 Dod or DoD prime contractors: $128,683.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $63,381.00 Sales Total: $128,683.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 12/33",
        "45": "SBIR Company Commercialization Report Who initiated the collaboration?: Small Business Concern Number of months taken to negotiate the Allocation of Rights agreement: 3 Who initiated the technology?: Small Business Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: 70% 30% SBIR Phase II: The Visual Database: Portable, Extensive Markup Language (XML)-Based Middleware For Media Representation, Interaction and Exchange 22 of 67 Agency/Branch: National Science Foundation Manufacturing related Program/Phase/Year: SBIR/Phase II/2005 Subsidiaries No | N/A N/A Topic #: N/A Contract/Grant #: 0450513 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $1,670,218.00 Dod or DoD prime contractors: Other Federal contract/grants: $379,998.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $131,000.00 Other Customers: $156,128.00 Other Sources Description: combination of domestic non-profit and foreign government $13,985.00 $0.00 $392,858.00 $0.00 $0.00 $0.00 Investment Total: $2,337,344.00 Sales Total: $406,843.00 HiDyVE: Hierarchical Dynamic Video Exploitation 23 of 67 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2017 Subsidiaries No | N/A N/A Topic #: AF151-042 Contract/Grant #: FA8750-17-C-0048 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $683,453.00 $38,475.00 $0.00 $0.00 $0.00 $0.00 $721,928.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 13/33",
        "46": "SBIR Company Commercialization Report Hardening DOE R&D Software Tools for Web-based Visualization 24 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2021 Subsidiaries No | N/A N/A Topic #: 02a Contract/Grant #: DE-SC0020504 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $300,000.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $300,000.00 Sales Total: Open-Source Visualization and Analysis Platform for 3D Reconstructions of Materials by Transmission Electron Microscopy Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2015 Subsidiaries No | N/A N/A Topic #: 05a Contract/Grant #: DE-SC0011385 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $32,500.00 Dod or DoD prime contractors: Other Federal contract/grants: $75,750.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 25 of 67 $32,500.00 $0.00 $10,670.00 $80,000.00 $0.00 $0.00 $108,250.00 Sales Total: $123,170.00 ClimatePipes: User-Friendly Data Access, Data Manipulation, Data Analysis and Visualization of Community Climate Models 26 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2012 Subsidiaries No | N/A N/A Topic #: 30 a Contract/Grant #: DE-FG02-11ER90026 Achieved a cost saving or cost avoidance?: No Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nYes a.\nPrimary Agency: Defense Threat Reduction Agency b.\nSystem/Program: BSVE Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 14/33",
        "47": "SBIR Company Commercialization Report Additional Investment From DoD contract/subcontract: c.\nPhase III Contract #: N/A Phase III Sales To $2,171,934.00 Dod or DoD prime contractors: Other Federal contract/grants: $1,501,925.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $92,311.00 $207,101.00 $0.00 $0.00 $0.00 $0.00 $3,673,859.00 Sales Total: $299,412.00 Graphical HPC Application Suite for Supporting the Product Simulation Lifecycles Agency/Branch: Department of Energy Manufacturing related 27 of 67 Yes | Unit Process Level Manufacturing Program/Phase/Year: SBIR/Phase II/2013 Topic #: 02a Contract/Grant #: DE-FG02-12ER90221 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Subsidiaries N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nYes a.\nPrimary Agency: Department of Defense b.\nSystem/Program: US Army Engineering Research &amp; Development Center Information Technology Laboratory c.\nPhase III Contract #: N/A Phase III Sales To $885,598.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $772,680.00 $0.00 $395,462.00 $0.00 $0.00 $0.00 $885,598.00 Sales Total: $1,168,142.00 Danesfield Courier: 3D Models from Point Clouds for Efficient Transmission and Rendering 28 of 67 Agency/Branch: Department of Defense/National Geospatial-Intelligence Agency Program/Phase/Year: SBIR/Phase II/2021 Topic #: NGA183-002 Contract/Grant #: HM047620C0065 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Phase III Sales To $150,000.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 $203,514.00 $0.00 Page 15/33",
        "48": "Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Other Sources Description: Foreign Government Investment Total: STTR Specific Information Who initiated the collaboration?: SBIR Company Commercialization Report Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $150,000.00 Sales Total: $203,514.00 Calibrated Methods for Quantitative PET/CT Imaging Phase II 29 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: STTR/Phase II/2015 Topic #: 102 Contract/Grant #: 2R42CA167907-02 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $117,674.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $29,405.00 Other Customers: $7,000.00 $0.00 $0.00 $143,128.00 $1,635.00 $0.00 $0.00 $154,079.00 Sales Total: $144,763.00 Research Institution Number of months taken to negotiate the Allocation of Rights agreement: 2 Who initiated the technology?: Research Institution Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: 53% 48% Web-based Techniques for Remote Scientific Visualization 30 of 67 Agency/Branch: Department of Defense/Army Manufacturing related Program/Phase/Year: SBIR/Phase II/2003 Subsidiaries No | N/A N/A Topic #: N/A Contract/Grant #: DAAD17-03-C-0020 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $1,099,473.00 Dod or DoD prime contractors: Other Federal contract/grants: $861,201.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $124,136.00 Other Customers: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 $0.00 $0.00 $180,758.00 $86,451.00 $0.00 $0.00 Page 16/33",
        "49": "SBIR Company Commercialization Report Other Sources: Investment Total: $0.00 $2,084,810.00 Sales Total: $267,209.00 GoBig: A Unified Interface to Big Data Systems 31 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase I/2015 Subsidiaries No | N/A N/A Topic #: 01c Contract/Grant #: DE-SC0013252 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Enhanced Software Tools for Detecting Anatomical Differences in Image Data Sets 32 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: STTR/Phase II/2020 Topic #: 105 Contract/Grant #: 2R42MH118845-03 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $108,924.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $12,091.00 Other Customers: $7,000.00 $0.00 $0.00 $39,013.00 $1,635.00 $0.00 $0.00 $128,015.00 Sales Total: $40,648.00 Small Business Concern Number of months taken to negotiate the Allocation of Rights agreement: 4 Who initiated the technology?: Small Business Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 70% 30% Page 17/33 Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Other Sources Description: Foreign Government Investment Total: STTR Specific Information Who initiated the collaboration?:",
        "50": "Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Who initiated the collaboration?: SBIR Company Commercialization Report Automated Assessment of Leptomeningeal Collaterals on CT Angiograms 33 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: STTR/Phase II/2018 Topic #: 108 Contract/Grant #: 2R42NS086295-02A1 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $1,027,620.00 Dod or DoD prime contractors: $227,621.00 Other Federal contract/grants: $388,373.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $1,415,993.00 Sales Total: $227,621.00 Research Institution Number of months taken to negotiate the Allocation of Rights agreement: 1 Who initiated the technology?: Research Institution Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: 67% 33% Improving liver lesion biopsy in the CT suite through fusion with PET images 34 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: STTR/Phase II/2012 Topic #: NCI Contract/Grant #: 2R42CA153488-02A1 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $433,694.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $22,200.00 $0.00 $0.00 $0.00 $433,694.00 Sales Total: $22,200.00 Research Institution Number of months taken to negotiate the Allocation of Rights agreement: 0 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 18/33 Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Who initiated the collaboration?:",
        "51": "Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Who initiated the collaboration?: SBIR Company Commercialization Report Who initiated the technology?: Research Institution Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: 0% 0% Rapid, Hardware Accelerated, Large Data Visualization 35 of 67 Agency/Branch: Department of Defense/Army Manufacturing related Program/Phase/Year: STTR/Phase II/2006 Subsidiaries No | N/A N/A Topic #: N/A Contract/Grant #: W911NF-06-C-0179 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $37,453.00 Dod or DoD prime contractors: Other Federal contract/grants: $208,216.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $65,082.00 Other Customers: $0.00 $266,135.00 $132,364.00 $80,361.00 $0.00 $0.00 $0.00 $310,751.00 Sales Total: $478,860.00 Research Institution Number of months taken to negotiate the Allocation of Rights agreement: 1 Who initiated the technology?: Research Institution Percentage of proceeds going to the small business: 100% Percentage of proceeds going to the research institution: 0% Cloud/Web-based Advanced Modeling and Simulation Turnkey High-Performance Computing Environment for Surface and Subsurface Science 36 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2020 Subsidiaries No | N/A N/A Topic #: 03a Contract/Grant #: DE-SC0019609 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $139,808.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $132,065.00 Other Customers: $0.00 $271,873.00 Sales Total: $424,177.00 $0.00 $0.00 $401,467.00 $22,710.00 $0.00 $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 19/33",
        "52": "SBIR Company Commercialization Report Wide Area Video Image Storage Techniques Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: SBIR/Phase II/2009 Topic #: SB072-019 Contract/Grant #: W31P4Q-09-C-0233 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $735,961.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $735,961.00 Sales Total: $238,188.00 37 of 67 $49,407.00 $188,781.00 $0.00 $0.00 $0.00 $0.00 Open-Source, Distributed Computational Environment for Virtual Materials Exploration 38 of 67 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2015 Subsidiaries No | N/A N/A Topic #: AF141-174 Contract/Grant #: FA8650-15-C-5080 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $40,000.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $40,000.00 $0.00 $70,000.00 $0.00 $0.00 $0.00 $40,000.00 Sales Total: $110,000.00 An Open Source Digital Pathology System Supporting Multi- Touch Interaction 39 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: SBIR/Phase II/2013 Topic #: NIBIB Contract/Grant #: 2R44EB013518-02A1 Achieved a cost saving or cost avoidance?: No Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 20/33",
        "53": "SBIR Company Commercialization Report Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $569,782.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $688.00 Other Customers: $0.00 $8,250.00 $0.00 $158,843.00 $0.00 $0.00 $0.00 $570,470.00 Sales Total: $167,093.00 mIQa: A Highly Scalable and Customizable Platform for Medical Image Quality Assessment - Phase II 40 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Program/Phase/Year: SBIR/Phase II/2020 Topic #: 101 Contract/Grant #: 2R44MH119022-02 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $5,250.00 Other Customers: $0.00 $0.00 $0.00 $20,750.00 $0.00 $0.00 $0.00 $5,250.00 Sales Total: $20,750.00 Enabling Shared Analysis and Processing of Large Neurophysiology Data 41 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: SBIR/Phase II/2017 Topic #: 101 Contract/Grant #: 1R44MH115731-01 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $527,884.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $5,625.00 Other Customers: $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 $0.00 $449,818.00 $16,875.00 $0.00 $0.00 $0.00 Page 21/33",
        "54": "SBIR Company Commercialization Report Investment Total: $533,509.00 Sales Total: $466,693.00 Scalable Grid Technologies for Visualization Services 42 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2004 Subsidiaries No | N/A N/A Topic #: 41 Contract/Grant #: DE-FG02-03ER83692 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $158,217.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $50,000.00 Other Customers: $0.00 $208,217.00 Sales Total: $36,334.00 $0.00 $10,000.00 $26,334.00 $0.00 $0.00 $0.00 Collaborative Visualization for Large-Scale Accelerator Electromagnetic Modeling 43 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase I/2008 Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Topic #: 40 a Contract/Grant #: DE-FG02-08ER85143 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: DOE, DOD b.\nSystem/Program: NNSA ASC, ASCR, DOD PETTT c.\nCost Savings: $2,000,000.00 d.\nCost Savings Type: Annual savings e.\nExplanation: This SBIR developed and enhanced collaborative and remote data analysis and visualization on the desktop and the web.\nThis capability enabled DOE and DOD laboratories to avoid purchasing high end graphical workstations for their scientists and engineers.\nAdditional Investment From DoD contract/subcontract: Phase III Sales To $1,162,223.00 Dod or DoD prime contractors: Other Federal contract/grants: $1,309,931.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $89,650.00 Other Customers: $0.00 Other Customers Description: N/A $542,532.00 $109,000.00 $302,617.00 $0.00 $0.00 $175,354.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 22/33",
        "55": "SBIR Company Commercialization Report Investment Total: $2,561,804.00 Sales Total: $1,129,503.00 Advanced virtual simulator for real-time ultrasound-guided renal biopsy training 44 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: SBIR/Phase II/2019 Topic #: 400 Contract/Grant #: 2R44DK115332-02 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $110,174.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Other Sources Description: Foreign Government $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $70,380.00 Other Customers: $7,000.00 $0.00 $0.00 $204,106.00 $1,635.00 $0.00 $0.00 Investment Total: $187,554.00 Sales Total: $205,741.00 Building Recognition by Function Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: STTR/Phase II/2010 Topic #: ST081-009 Contract/Grant #: W91CRB-10-C-0098 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo 45 of 67 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Who initiated the collaboration?: Phase III Sales To $1,534,722.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $1,555,642.00 $2,517,072.00 $10,927.00 $0.00 $0.00 $0.00 $1,534,722.00 Sales Total: $4,083,641.00 Research Institution Number of months taken to negotiate the Allocation of Rights agreement: 1 Who initiated the technology?: Research Institution Percentage of proceeds going to the small business: 100% Percentage of proceeds going to the research institution: 0% Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 23/33",
        "56": "SBIR Company Commercialization Report SBIR Phase II: Visualizing Arbitrary Basis Functions for Advanced Engineering Analysis and Simulation 46 of 67 Agency/Branch: National Science Foundation Manufacturing related Program/Phase/Year: SBIR/Phase II/2003 Subsidiaries No | N/A N/A Topic #: N/A Contract/Grant #: 0238964 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $1,670,218.00 Dod or DoD prime contractors: Other Federal contract/grants: $238,000.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $28,190.00 Other Customers: $0.00 $1,936,408.00 Sales Total: $553,055.00 SBIR Phase II: Visualization of Massive Multivariate Adaptive Mesh Refinement (AMR) Data 47 of 67 Agency/Branch: National Science Foundation Manufacturing related Program/Phase/Year: SBIR/Phase II/2006 Subsidiaries No | N/A N/A Topic #: IT Contract/Grant #: 0548729 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $5,000.00 Dod or DoD prime contractors: Other Federal contract/grants: $322,558.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $1,625.00 Other Customers: $0.00 $329,183.00 Sales Total: $643,761.00 $31,485.00 $0.00 $503,090.00 $18,480.00 $0.00 $0.00 $0.00 $359,669.00 $284,092.00 $0.00 $0.00 $0.00 Imaging biomarkers of severe respiratory infections in premature infants Phase II 48 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: STTR/Phase II/2021 Topic #: NHLBI Contract/Grant #: 2R42HL145669-02A1 Achieved a cost No Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 24/33",
        "57": "Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Other Sources Description: Foreign Government Investment Total: STTR Specific Information Who initiated the collaboration?: SBIR Company Commercialization Report saving or cost avoidance?: Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $39,641.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $6,029.00 Other Customers: $7,000.00 $0.00 $0.00 $18,649.00 $1,635.00 $0.00 $0.00 $52,670.00 Sales Total: $20,284.00 Small Business Concern Number of months taken to negotiate the Allocation of Rights agreement: 1 Who initiated the technology?: Small Business Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: 67% 33% Kitware Image and Video Retrieval (KWIVER) Large Volume Motion Imagery (LVMI) Analytics 49 of 67 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2018 Subsidiaries No | N/A N/A Topic #: AF131-151 Contract/Grant #: FA8650-18-C-1647 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $81,450.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $81,450.00 50 of 67 Open, Cross Platform Chemistry Application Agency/Branch: Department of Defense/Army Manufacturing related Program/Phase/Year: SBIR/Phase II/2012 Subsidiaries No | N/A N/A Topic #: A10-110 Contract/Grant #: W912HZ-12-C-0005 Achieved a cost saving or cost avoidance?: No Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Additional Investment From Phase III Sales To Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 25/33",
        "58": "SBIR Company Commercialization Report DoD contract/subcontract: $21,338.00 Dod or DoD prime contractors: Other Federal contract/grants: $397,972.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $24,208.00 Other Customers: $0.00 $443,518.00 Sales Total: $52,726.00 FAST TRACK: Open-Source Integrated Design-Analysis Environment for Nuclear Energy Advanced Modeling and Simulation Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase I/2013 Subsidiaries No | N/A N/A Topic #: 19d Contract/Grant #: DE-FG02-13ER90641 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $7,682.00 Dod or DoD prime contractors: Other Federal contract/grants: $132,789.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $140,471.00 Sales Total: $61,800.00 $28,518.00 $0.00 $24,208.00 $0.00 $0.00 $0.00 51 of 67 $7,682.00 $0.00 $32,242.00 $21,876.00 $0.00 $0.00 An Interactive, Patient-Specific Virtual Surgical Planning System for Upper Airway Obstruction Treatments 52 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: SBIR/Phase II/2019 Topic #: NIBIB Contract/Grant #: 2R44EB023121-02 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $614,900.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Other Sources Description: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $16,819.00 Other Customers: $7,000.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 $0.00 $0.00 $48,735.00 $1,635.00 $0.00 $0.00 Page 26/33",
        "59": "SBIR Company Commercialization Report Foreign Government Investment Total: $638,719.00 Sales Total: $50,370.00 Super Resolution of Satellite Imagery using Multi-Sensor Fusion 53 of 67 Agency/Branch: Department of Defense/National Geospatial-Intelligence Agency Program/Phase/Year: SBIR/Phase II/2019 Topic #: NGA172-005 Contract/Grant #: HM047619C0026 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $119,992.00 Dod or DoD prime contractors: Other Federal contract/grants: $249,140.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $369,132.00 Sales Total: $747,419.00 $0.00 $747,419.00 $0.00 $0.00 $0.00 $0.00 Web-Based Computational Model Builder for Nuclear Energy Advanced Modeling and Simulation 54 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase I/2014 Subsidiaries No | N/A N/A Topic #: 19d Contract/Grant #: DE-SC0012037 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Supporting MultiPhysics Workflows for Particle Accelerator Simulations 55 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2016 Subsidiaries No | N/A N/A Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 27/33",
        "60": "SBIR Company Commercialization Report Topic #: 26b Contract/Grant #: DE-SC0013884 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $163,615.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $163,615.00 $0.00 $317,211.00 $0.00 $0.00 $0.00 $163,615.00 Sales Total: $480,826.00 Integrated, Interoperable Software Environment for Fusion Simulation and Data Analysis Tools 56 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2018 Subsidiaries No | N/A N/A Topic #: 20c Contract/Grant #: DE-SC0018054 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $1,186,526.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $1,186,526.00 Sales Total: $22,500.00 $0.00 $0.00 $22,500.00 $0.00 $0.00 $0.00 Human-Robot Instruction for Perceptual Teamwork 57 of 67 Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: SBIR/Phase II/2010 Topic #: SB082-031 Contract/Grant #: W31P4Q-10-C-0214 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $1,361,112.00 Dod or DoD prime contractors: Other Federal contract/grants: $926,439.00 Other Federal Agencies: Angel Investors: Venture Capital: $0.00 Private Sector: $0.00 Export Market: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 $1,492,990.00 $1,887,804.00 $19,853.00 $0.00 Page 28/33",
        "61": "SBIR Company Commercialization Report Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $2,287,551.00 Sales Total: $3,400,647.00 Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Who initiated the collaboration?: Software Toolkit for Image Guided Surgery Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: STTR/Phase II/2004 Topic #: N/A Contract/Grant #: 2R42EB000374-02 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 58 of 67 $0.00 $0.00 $44,948.00 $0.00 $0.00 $0.00 Other Federal contract/grants: $490,489.00 Other Federal Agencies: $490,489.00 Sales Total: $44,948.00 Research Institution Number of months taken to negotiate the Allocation of Rights agreement: 1 Who initiated the technology?: Research Institution Percentage of proceeds going to the small business: 100% Percentage of proceeds going to the research institution: 0% Computational Fluid Dynamics Co-processing for Unsteady Visualization 59 of 67 Agency/Branch: Department of Defense/Army Manufacturing related Program/Phase/Year: SBIR/Phase II/2008 Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Topic #: A07-010 Contract/Grant #: W911W6-08-C-0062 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: DOE NNSA b.\nSystem/Program: ASC c.\nCost Savings: $1,000,000.00 d.\nCost Savings Type: Annual savings e.\nExplanation: The DOE NNSA program requires a new supercomputer at the Sandia, LLNL, and LANL sites roughly once per 1.5 years.\nIn the technology used for these supercomputers, the discrepancy between computational power and storage capability has been widening.\nPrivileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 29/33",
        "62": "SBIR Company Commercialization Report Withou Additional Investment From DoD contract/subcontract: Phase III Sales To $154,737.00 Dod or DoD prime contractors: Other Federal contract/grants: $4,693,734.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $142,203.00 Other Customers: $0.00 $4,990,674.00 Sales Total: $647,991.00 Web-Based Computational Model Builder for Nuclear Energy Advanced Modeling and Simulation 60 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2017 Subsidiaries No | N/A N/A Topic #: 19d Contract/Grant #: DE-SC0012037 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $940.00 Dod or DoD prime contractors: Other Federal contract/grants: $293,115.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $294,055.00 Sales Total: $133,698.00 $51,851.00 $596,140.00 $0.00 $0.00 $0.00 $0.00 $940.00 $32,500.00 $93,358.00 $6,900.00 $0.00 $0.00 Advanced virtual simulator for fundamentals of laparoscopic surgery training and credentialing 61 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: SBIR/Phase II/2015 Topic #: NIBIB Contract/Grant #: 1R44EB019802-01A1 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $586,212.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 $0.00 $0.00 $25,000.00 $0.00 $0.00 $0.00 Page 30/33",
        "63": "SBIR Company Commercialization Report Investment Total: $586,212.00 Sales Total: $25,000.00 Scalable Software for Reverse Engineering Neural Circuits from Histology 62 of 67 Agency/Branch: Department of Health and Human Services/National Institutes of Health Program/Phase/Year: SBIR/Phase II/2012 Topic #: NIMH Contract/Grant #: 2R44MH088088-03 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $642,164.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $313.00 Other Customers: $0.00 $642,477.00 Sales Total: $54,068.00 $0.00 $0.00 $54,068.00 $0.00 $0.00 $0.00 A Framework for In Situ Analysis and Visualization of Large- Scale Cosmology Simulations 63 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2013 Subsidiaries No | N/A N/A Topic #: 26a Contract/Grant #: DE-FG02-12ER90330 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: DOE NNSA b.\nSystem/Program: ASC c.\nCost Savings: $10,000,000.00 d.\nCost Savings Type: Annual savings Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nYes a.\nPrimary Agency: Department of Energy b.\nSystem/Program: NNSA ASC c.\nPhase III Contract #: N/A e.\nExplanation: The DOE NNSA program requires a new supercomputer at the Sandia, LLNL, and LANL sites roughly once per 1.5 years.\nIn the technology used for these supercomputers, the discrepancy between computational power and storage capability has been widening.\nWithout co-processing technology, scientists would need access to large storage systems that are cost prohibitive.\nWith the co-processing technology, the need to acquire larger and larger IO systems is reduced, leading to significant annual cost savings.\nThese supercomputers cost between $5-20 million each, and the IO component is a significant part of this cost.\nWe estimate that this technology saves $1,000,000 - Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 31/33",
        "64": "SBIR Company Commercialization Report $2,000,000 for each of these supercomputers.\nNote: The work performed in this SBIR is an enhancement to the Fluid Dynamics Co-Processing for Unsteady Visualization SBIR, done for the DOD, and has further refined the technology, making it feasible for upcoming supercomputers.\nAdditional Investment From DoD contract/subcontract: Phase III Sales To $463,758.00 Dod or DoD prime contractors: Other Federal contract/grants: $4,377,566.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $28,495.00 Other Customers: $0.00 $4,869,819.00 Sales Total: $2,003,463.00 Web-Based Computational Model Builder for Nuclear Energy Advanced Modeling and Simulation 64 of 67 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2015 Subsidiaries No | N/A N/A Topic #: 19d Contract/Grant #: DE-SC0012037 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $7,682.00 Dod or DoD prime contractors: Other Federal contract/grants: $196,615.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $6,710.00 Other Customers: $0.00 $211,007.00 Sales Total: $386,592.00 Super 3D from Video Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: SBIR/Phase II/2010 Topic #: SB082-028 Contract/Grant #: W31P4Q-11-C-0086 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo 65 of 67 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Phase III Sales To $1,011,515.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 $90,332.00 $482,206.00 $20,416.00 Page 32/33 $54,253.00 $1,800,879.00 $144,431.00 $3,900.00 $0.00 $0.00 $8,457.00 $16,250.00 $240,296.00 $121,589.00 $0.00 $0.00",
        "65": "SBIR Company Commercialization Report Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Export Market: $0.00 3rd Party Revenue: $41,210.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $1,052,725.00 Sales Total: $592,954.00 Open-Source Visualization and Analysis Platform for 3D Reconstructions of Materials by Transmission Electron Microscopy Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase I/2014 Subsidiaries No | N/A N/A Topic #: 05a Contract/Grant #: DE-SC0011385 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: 66 of 67 $0.00 $0.00 $7,800.00 $0.00 $0.00 $0.00 $7,800.00 Visual Global Intelligence and Analytics Toolkit (VIGILANT) 2.0 67 of 67 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2017 Subsidiaries No | N/A N/A Topic #: AF153-001 Contract/Grant #: FA8650-17-C-9217 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $1,731,249.00 Dod or DoD prime contractors: Other Federal contract/grants: $57,810.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $7,420.00 Other Customers: $0.00 $1,796,479.00 Sales Total: $4,535,480.00 $4,276,915.00 $236,305.00 $22,260.00 $0.00 $0.00 $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 10/10/2023 Page 33/33",
        "66": "Mary Key, Kitware Nov 04, 2024 Nov 04, 2025"
    },
    "images": [
        {
            "page": 9,
            "image_file": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02_page9_img1.jpeg",
            "hash": "ed669692ced8940e",
            "position": "Top Left"
        },
        {
            "page": 9,
            "image_file": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02_page9_img2.jpeg",
            "hash": "b8a2a25dc6ab55a9",
            "position": "Top Right"
        },
        {
            "page": 9,
            "image_file": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02_page9_img3.jpeg",
            "hash": "bc84d11bc666cc6d",
            "position": "Top Right"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02_page11_img1.jpeg",
            "hash": "b8a2a25dc6ab55a9",
            "position": "Middle Left"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02_page11_img2.jpeg",
            "hash": "bc84d11bc666cc6d",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02_page12_img1.jpeg",
            "hash": "c16a1c9c7bda3263",
            "position": "Middle Center"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02_page14_img1.jpeg",
            "hash": "b966e668beb64203",
            "position": "Top Center"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02_page15_img1.png",
            "hash": "d4a73c4ac83dace8",
            "position": "Top Center"
        },
        {
            "page": 18,
            "image_file": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02_page18_img1.jpeg",
            "hash": "d6a8a99fbb295450",
            "position": "Top Center"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02_page19_img1.jpeg",
            "hash": "fb61b06b7b80c0f1",
            "position": "Top Right"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02_page19_img2.jpeg",
            "hash": "cf31304aaca4b377",
            "position": "Middle Right"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB745353c635c2e3b7bed613c5f798e136de197cf761abe57466a2a069bba2a50987af02_page19_img3.png",
            "hash": "ffbf809f803f8088",
            "position": "Bottom Right"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "kitware.com",
        "name": "N/A",
        "phone": "N/A"
    }
}