{
    "filename": "docNAC01FB745353dd375741824836f4404e3377aec4ebd1df5fdaa1fbe8820f50df4f8f8d6b750e.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0006 Proposal Interactive Knowledge Graphs for Situational Awareness Using Nodal Function Title: Generation Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: Perseides Corp Address: Website: UEI: CAGE: 2309 E 5th St, Austin, TX 78702-4635 nomadik.ai KZN9PEK8WW27 03A83 SBA SBC Identification Number: 002659525 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 3 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_002659525 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_002659525.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO N/A NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [X] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Trevor Sorrells Signature Title Business Name Date Trevor Sorrells CEO Perseides Corp 09/05/2024",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?NO VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: Nodal Function Generation is a noval architecture for building dynamic knowledge graphs at a deeper level than traditional semantic knowledge graph generation.\nAt a fundamental level, information can be thought of as a statement regarding some observed process(es) relating some practical quanta of knowledge.\nThese statements cannot offer elucidation about the objective systems that causally govern the related quanta on their own; rather they must logically support the claims made by sibling informative constructs which reference those same quanta, in order to reinforce their validity, or more precisely, their proximity to an objective truth.\nInformation that is proven to be sufficiently valid within some \"objective\" frame of reference can then be considered as a form of Intelligence.\nBecause of the implicit inclusion of uncertainty W.R.T.\ncausal objectivity in both Information and Intelligence, the distinction between the two is more accurately described by the causal bounds in which their configuration is proposed, and the orientation of causal propagation.\nThis is to say, the Information represents some quantized input to a hypothesized system, from which Intelligence can be derived.\nFurthermore, the end state of some configuration representing Intelligence can act as a quanta of information, or ‘Type’, within another system and frame of reference as a source of information.\nWith this in mind, it becomes apparent that any number of Informative quanta, or Nodes, there exists a set of valid Types that represent the attainable (W.R.T.\nthe frame of reference) systems through which Intelligence can be derived.\nThese Types comprise the superposition of configurations that result in novel Nodes that when distilled, can be evaluated for objective efficacy.\nFor example, a proposed configuration of a Type may indicate a causal discrepancy by the degree with which it approximates for other systems, relative to other sibling configurations.",
        "5": "This specific implementation is required to meet the requirements set forth in the topic, namely: updating the graph's underlying ontology, inferring additional edges between nodes, highlighting conflicting information and information gaps, and suggesting additional changes to the graph.\nThe nodal function generation architecture allows users to interact with the dynamic knowledge graph at a granular level and trigger expected responses from the graph that would traditional fail in a graph built on top of a semantic implementation.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: If the project is successful there will be a resulting paradigm shift not just in how users can interact with dynamic knowledge graphs, but in the intelligence process as a whole.\nThe nodal function generation architecture removes the burden of needing to know exact data types, data structures, and expected values.\nBeyond that, the automatic correlation and pattern recognition between disparate datasets, more sophisticated than the current standard of semantic matching, will enable analysts to uncover hidden patterns critical to modern conflicts.\nAutomatically identifying conflicting information and pointing out information gaps is a critical capability due to the evolving nature of 5th generation warfare and the downstream information and psywar.\nIn terms of commercial application Perseides is already in the process of offering a commercial solution integrated with the Nomadik civil intelligence platform being developed for cities and states to better coordinate their city services and associated data - starting with the homeless crisis.\nCities currently face a myriad of crises that require coordinated data and resources to properly address but cities currently lack a solution to achieve the level of coordination required.\nThe Nomadik civil intelligence platform functions as a common operating picture for cities to put every stakeholder on the same page to allow them to more efficiently and effectively carry out their responsibilities.\nThe nodal architecture allows cities to uncover hidden patterns and correlations that allow them to utilize their limited resources to produce outsized impacts.\nWhile the initial focus of our commercial application is homelessness Perseides Corp has plans to expand into the entire civil intelligence realm: human trafficking, drug trafficking, gang activity, public safety, etc.\nOutside of civil intelligence this architecture has applications across every industry that uses knowledge graphs, or will use knowledge graphs, to achieve their goals.\nFrom finance, to real estate, to insurance, to retail and more.\nThe research and development enabled by this SBIR allows Perseides Corp to dedicate time to developing a noval capability with the potential to transform how industries and organizations understand their data.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is",
        "6": "obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: 2 3 4 5 6 7 8 9 10 11 12 13 14 List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: dynamic knowledge graph, Artificial intelligence, knowledge graph, ontology, machine learning, AI/ML, nodal function generation, graph node VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 100% 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES 3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES NO 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, YES release, or disclosure restriction?",
        "7": "12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO 16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n100% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nNO VOL I - Contact Information Principal Investigator Name: Morgan Winters Phone: (470) 261-9222 Email: morgan@nomadik.ai Address: 2309 E 5th St, Austin, TX 78702 - 4635 Corporate Official Name: Trevor Sorrells Phone: (770) 317-1526 Email: trevor@nomadik.ai Address: 2309 E 5th St, Austin, TX 78702 - 4635 Authorized Contract Negotiator Name: Trevor Sorrells Phone: (770) 317-1526 Email: trevor@nomadik.ai Address: 2309 E 5th St, Austin, TX 78702 - 4635 Form Generated on 11/05/2024 04:24:03 PM",
        "8": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp Interactive Knowledge Graphs for Situational Awareness Using Nodal Function Generation Volume 2: Technical Volume __________________________________________________________________ This proposal includes data that must not be disclosed outside the Government and must not be duplicated, used, or disclosed – in whole or in part – for any purpose other than to evaluate this proposal.\nIf, however, a contract is awarded to this offeror as a result of – or in connection with – the submission of this data, the Government has the right to duplicate, use, or disclose the data to the extent provided in the resulting contract.\nThis restriction does not limit the Government's right to use information contained in this data if it is obtained from another source without restriction.\nThe data subject to this restriction are contained in pages 2 to 14.\n__________________________________________________________________ Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 1 of 14",
        "9": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp 1.\nIdentification and Significance of the Problem or Opportunity.\nWarfare is no longer about who has the best equipment, who has the most manpower, or who has the most money, warfare in the 21st century is about decision advantage - who has the best intelligence.\nThe United States has spent decades building the organizations required to collect and analyze data from every domain imaginable, but the process to derive actionable intelligence from an ever growing ocean of information is slow, and the second most important factor in any modern conflict is time.\nKnowledge graphs were a stepping stone towards a solution that aimed to reduce the time and manpower required to turn actionable intelligence into decisive action.\nHowever, the current paradigm of AI powered knowledge graphs has glaring flaws that hamstring the potential power of these knowledge graphs.\nKnowledge graphs are built upon the data they are fed, which results in inherent human error originating downstream.\nThese errors manifest themselves in incomplete and inaccurate data that results in inaccurate knowledge graphs.\nMissing links, hidden patterns, and incorrect correlations that need to be fixed by human analysts to ensure the decisions that are made with these knowledge graphs are as well informed as possible.\nCurrent knowledge graphs however lack a way to reorient themselves as data is corrected, added, or removed.\nRequiring either a complete rebuilding of the graph and in a time constrained environment this leads to decision lag and the consequences that come with it.\nDynamic knowledge graphs are the next logical step in the technological development process.\nProviding both the interface for analysts to correct data and add or remove nodes and edges as well as the underlying infrastructure to highlight conflicting information and missing information while inferring new edges and nodes to provide a more comprehensive picture.\nFor analysts to have the clearest situational awareness picture of their operating environment, to understand the patterns of life on the battlefield, and to enable effective threat detection and targeting operations the dynamic knowledge graph needs to be able to learn and evolve with the analyst.\nThe opportunity to build a system that doesn't just enable ease of user intervention but uses that input to learn and understand context, to suggest real time updates and fill gaps that the user may not have even considered is one that can change the face, and the pace, of modern conflict.\nThe importance of a system such as this is not just about speeding up legacy workflows, but rethinking how we understand and act on the intelligence gathered by the vast array of systems and organizations throughout the DoD.\nBy building a system that learns, adjusts, and evolves alongside its human operators, we create a force multiplier—a tool that doesn’t just store data but thinks with us, advancing our situational awareness and cutting the time to action dramatically.\n2.\nPhase I Technical Objectives.\nThe technical objectives for the Phase I period of performance will focus on the foundational design and technological feasibility for Persiedes’ nodal function generation and how it provides the stated capability requirements outlined for the topic.\nThis phase is critical in ensuring that the nodal function generation enables the interactions outlined by Air Force requirements not currently possible with traditional knowledge graph architectures.\nDuring this phase Perseides Corp will conduct comprehensive research and development sprints aiming to define and test the nodal function generation and supporting architecture.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 2 of 14",
        "10": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp The specific technical objectives for Phase I, along with the pivotal questions to be addressed are as follows: Evaluate Data Ingestion Modularity Objective: A key component to any system that relies on multiple data streams is being able to easily and efficiently parse new data types into the system.\nKey Questions: How accurately does the system classify existing and new data types?\nHow well does the system infer types from unstructured text fields?\nOur proposed system will consist of a central interface and arbitration service, managing several containerized database systems.\nEach system will be of a unique engine and/or locality (providing distributed storage flexibility as needed), for the optimal ingestion and handling of a variety of data types.\nThe two required database systems will consist of: - Extended PostGreSQL Container - - - Ingestion of any/all tabular and/or ambiguously Typed (W.R.T.\nexisting Nodal representations) data.\nImplicit ingestion of unambiguously Typed and externally stored data (i.e.\nimagery, literature, or other media) System utilities - TypeDB Container - - Ingestion and storage of ambiguous Type representations, or Knowledge Graphs.\nIndexed storage of hypothetical Type representations and the causal ‘edges’ that relate them to other graphs.\nThe central system itself will arbitrate ingestion of all data, orchestration of workers, systemic testing, serving of API/HMI, and other utilities.\nAs novel types are introduced, workers will be tasked with manipulating these representations in an effort to construct testable representations of the system that produced the ingested quanta of an implied Type.\nEvaluate Nodal Generation for Edge Discovery Objective: Determine the accuracy of edge discovery in the nodal function generation system.\nKey Questions: Given the sub-nodal structure how well does the system discover edges compared to current semantic systems?\nUnlike the semantic representation of relational information between nodes, our proposed system relies on causally structured and testable sets of representations of individual nodes themselves.\nThese representations are comparable to knowledge sheaves, albeit highly contextualized and inherently ambiguous in terms of face value validity.\nEach node conceptually represents a hypothesized ideal ‘Type’, the causal form of which can be elucidated by mapping out the systems that (allegedly) produce quanta of said Type.\nThese ideal Types should be thought of as simultaneously complex and axiomatic, the distinction only becoming relevant when considering a specific representation of a Type, which can be thought of as a system in which specific input and output Types are desirable and therefore immutable.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 3 of 14",
        "11": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp Because of these causal underpinnings in our architecture, we hypothesize that the abundance or lack of representations referring to a hypothetical Type speak to its objective validity, and therefore can be used in conjunction with the generation of novel representations of relationships, as well as the augmenting the discovery of approximator systems via morphological analysis.\nEvaluate Conflicting Information and Information Gap Discovery Objective: Determine the accuracy of the nodal architecture in detecting conflicting information and information gaps.\nKey Questions: How well does the system do in detecting inaccuracies at both the semantic and sub-nodal level?\nAt what level of information gap is the system capable of detecting (e.g.\nif our data consistently references crime without a crime dataset plugged in will it be able to find that gap)?\nOnce the infrastructure supporting the workers traversal of the data structures is completed, we anticipate the ‘priming’ of known Types, both pragmatically macroscopic and microscopic.\nThese known relationships will serve to inform the exploration of supplied data (i.e.\nnodal generation).\nFrom similar small scale tests, we anticipate the indexing of implicit but unstable Types to become statistically apparent, the recovery of which to depend upon the specific nature of ancillary data.\nFurthermore, when two or more representations of a Type conflict causally (i.e.\ndata sources providing conflicting information), this too becomes very quickly apparent, and the Type(s) and source(s) in question are flagged for re-evaluation.\nEvaluate Graph Change Suggestions Based on User Input Objective: Utilize user input to inform graph exploration to suggest further changes informed by edges that already exist from the edited node as well as suggested edges after user input.\nKey Questions: How quickly does the system utilize user input to both discover new connections as well as suggest further changes to the graph?\nWhat is the scope of a suggested change based on different types of user input?\nFundamentally, each of these operations by the user equates to the ingestion of a supposed graph into the system.\nAs each sub-graph is architecturally synonymous with a hypothetical representation of a Type, the system will infer user defined ontologies and schemas in the same fashion as the automated processes index hypothetical Types.\nAs the supposed graph representation is explored, the measures of its ‘validity’ are tested in conjunction with known Types, and the morphological distinctions as it grows / shrinks.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 4 of 14",
        "12": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp Design User Interface Objective: Design a familiar and intuitive knowledge graph UI that enables the following user inputs and user feedback from the system: ● allow a user to interact with a dynamic knowledge graph by making changes and additions to the knowledge graph.\n● displaying inferred additional edges between nodes ● highlighting conflicting information in the graph ● highlighting information gaps ● suggesting additional changes to the graph Key Questions: How should information from a node or edge be displayed to users that generalizes across various data types?\nWhat is the optimal workflow for each user interaction?\nHow should feedback from the system be displayed to the user?\nOur proposed system will serve API/HMI functionality, for the exploration of the nodal representations of specific Types, akin to specific relations between user-defined axiomatic Types.\nVisually, this will be accomplished by building off of existing libraries, and we anticipate an interface built upon frameworks like networkx.\nArchitect User Interface to Nodal Graph API Objective: Connect the user interface with the nodal graph backend via API.\nKey Questions: How should additions, removals, and edits be passed from the UI to the nodal graph backend to enable rapid processing and user feedback?\nOur proposed system will continuously and automatically assign workers to explore ingested data to construct new nodal representations, as well as flagging causal ‘dead-ends’, until such a time when morphological analysis implies that a change in criticality has occurred.\nAs all incoming data will be indexed by these workers, the API will support a priority scheme where defined, allowing users to request priority for the exploration of a subset of data, or request an immediate re-evaluation of a flagged sub-graph.\nBuild Test Suite to Evaluate Performance Metrics Objective: Build out a test suite to evaluate performance metrics such as accuracy, graph completeness, edge inference accuracy, information gap accuracy, and change suggestion accuracy.\nKey Questions: What sort of graph structure is required to accurately test the aforementioned metrics?\nHow do data sources, data types, and data relevance distance affect the various metrics?\nHow do we measure information gap and change suggestion accuracy?\nWhat size truth graph is required to achieve 80%, 90%, 95%, and 99% coverage of edge case testing?\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 5 of 14",
        "13": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp Our proposed system will handle continuous system wide testing and evaluation, providing real-time reporting for system diagnostics, graph validation, and data type ‘asks’ suggested by the system itself.\nEach evaluation pipeline will adhere to a documented schema, from which additional tests can be defined and incorporated.\nIn addition, where the condensation/substitution of Types is performant (i.e.\na containerized machine learning service would pragmatically optimize a particular causal transformation or system of transformations), the system will present these findings.\n3.\nPhase I Statement of Work The work will be broken into two focus areas, the front-end user interface (UI) to interact with the knowledge graph itself, and the back-end knowledge graph generation and maintenance facilitated through our nodal function generation approach.\nThe overall UI will take the form of a traditional knowledge graph interface, with nodes and edges representing discrete information and their relationship to other pieces of information.\nTask Outline: 1.\nTask 1: Data Ingestion Design and Development a.\nObjective: Design a system that gracefully handles data input to create sub-nodal representations of data fields for sub-nodal edge detection.\nb.\nActivities: i.\nEstablish and Implement Data Storage Infrastructure 1.\nContainerized Storage Engines a.\nPostGreSQL i.\nii.\niii.\nTemporary storage of ingested raw and tabular data Storage of intermediately typed ingested data Storage of any/all tabular data concerning Type composition iv.\nWorker queuing / logging System Operations v.\nb.\nTypeDB i.\nStorage of Typed Nodal Structures, i.e.\nKnowledge Graphs Storage of sub-graphs representing the assumed superpositions of a complex Type ii.\n2.\nContainerized Management and Storage Interface System a.\nManaging workers, logging, and API/HMI b.\nResponsible for ingestion pipelines and distributed storage interfacing ii.\nImplement Framework for Nodal Ingestion and Type Approximation 1.\nEstablish basic ingestion of existing nodal structures of inherently ambiguous axiomatic granularity 2.\nDevelopment, testing, and restructuring of heuristic ontologies of 3.\nalgorithms for approximating Types ** Initial implementation of categorical Type compression/decompression indicators ** Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 6 of 14",
        "14": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp iii.\nPrune and Refine Type Approximation 1.\nImplement/refactor worker processes and management infrastructure where necessary 2.\nDevelop scheduling for systemic testing and benchmarking 2.\nTask 2: Nodal Edge Discovery Design and Development a.\nObjective: Design the edge discovery based on nodal and sub-nodal connections that performs at least as well as traditional semantic edge discovery.\nb.\nActivities: i.\nImplement Categorical Ranking of Nodal Structures 1.\nDevelop framework for relating superpositions of potentially related Types via causal morphology 2.\nDevelop indexing and ranking of testable graphs, modulating 'compression' to optimize for end-node performance ii.\nPrune and Refine Categorical Ranking 1.\nImplement/refactor worker processes and management infrastructure where necessary 2.\nDevelop scheduling for systemic testing and benchmarking 3.\nImplement initial HMI for visualizing and interacting with ranked graphs 4.\nLarge-scale testing of labeled causal system representations ** iii.\nDeploy Categorical Causal Graph Association 1.\nContinue large-scale testing of labeled causal system representations, masking testable sub-graphs 2.\nRank and vetting of proposed substitutions ** 3.\nIndexing of macroscopic causal ranking (composite Types, and supposed 'edges') Initial testing of proposed edge elucidation methods for HMI ** 4.\n3.\nTask 3: Conflicting Information and Gap Discovery Design and Development a.\nObjective: Design the processes required to find conflicting information within the high level data nodes of the graph and highlight gaps in information based on the current understanding of the graph.\nb.\nActivities: i.\nInitiate Knowledge ‘Priming’ 1.\nLarge scale ingestion of known and engineered Types, in order to prime the morphological and causal indices 2.\nExecute tests across multiple deployed instances operating with seeded subsets of such Types.\nDevelop and Test Conflict Awareness ii.\n1.\nRepeat priming procedures across multiple instances with various degrees of conflicted data 2.\nRecord morphological behavior and subsequent implications of cascaded conflict Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 7 of 14",
        "15": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp 3.\nFormalize metrics for identification of conflicting data sources among intentionally noised data.\nRefine Morphological Gap Detection Techniques iii.\n1.\nRepeat priming procedures with distinctly masked or conflicted data, and optimize exploratory algorithms for disambiguation 2.\nDevelop initial pipelines for flagged Types 4.\nTask 4: Graph Change Suggestions from User Input Design and Development.\na.\nObjective: Develop the API to handle user input and the processes required to explore the graph and suggest additional changes based on the input.\nb.\nActivities: i.\nDevelop Composite Operation Pipelines 1.\nImplement ‘usher’ workers for the execution of tasks and retrieval of information Implement queueing for parallelized task execution 2.\nDefine API ii.\n1.\nFormalize all composite tasks to be made from the host, and assign task schedules and endpoints 2.\n*Conventional API Development 3.\nDevelop tests, and execute Type ingestion 5.\nTask 5: User Interface Design and Development a.\nObjective: Design an intuitive and user-friendly interface for the dynamic knowledge graph to enable editing and highlighting of information gaps and discrepancies.\nb.\nActivities: Develop the graphical user interface; connect the user interface to the back-end dynamic knowledge graph architecture via API; ensure user experience editing data and knowledge graph feedback is intuitive via use case testing.\n6.\nTask 6: Comprehensive System Testing and Validation a.\nObjective: Conduct extensive testing of the dynamic knowledge graph to ensure accuracy, reliability, and ease of use.\nb.\nActivities: Develop a truth graph to then test a graph with artificial gaps, discrepancies, and changes; Develop test system to apply the set of changes required to get to the truth graph in random order to ensure edge case coverage; develop scoring metrics to measure accuracy of graph after edits compare to truth graph.\nWith the infrastructure, API, and UI constructed, we will continue evaluating the performance of aforementioned testing and benchmarking routines, as well as develop and formalize the breadth of priming and associated effects.\nIn addition, we hope to distill these components, such that iterative computation and data requirements to achieve validation are minimized.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 8 of 14",
        "16": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp Milestone Schedule: The following are the key milestones in Phase I: Milestone Data Ingestion Design and Development Nodal Edge Discovery Design and Development Conflicting Information and Gap Discovery Design and Development Graph Change Suggestions from User Input API Design and Development.\nUser Interface Design and Development Expected Delivery Award + 1 Month Award + 2 Month Award + 3 Month Award + 4 Month Award + 5 Month Comprehensive System Testing and Validation Award + 6 Month Deliverable Acceptance Criteria Performer Perseides Corp Perseides Corp Perseides Corp Perseides Corp Perseides Corp Perseides Corp Delivery of written summary of data ingestion pipeline.\nDAF TPOC receives the written summary via email.\nDelivery of written summary of nodal edge discovery.\nDAF TPOC receives the written summary via email.\nDAF TPOC receives the written summary via email.\nDAF TPOC receives the written summary via email.\nDAF TPOC receives the written summary via email.\nDAF TPOC receives the written summary via email.\nDelivery of written summary of conflicting information and graph discovery process.\nDelivery of written summary of user input API change suggestions.\nDelivery of written summary of user interface.\nDelivery of written summary of system testing and validation along with prototype of system.\nDeliverables: The project deliverables for Phase I are: ● Monthly progress reports.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 9 of 14",
        "17": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp ● Kickoff and review meeting presentations.\n● Media (pictures and videos) of the dynamic knowledge graph demonstrations.\n● Prototype of system.\n● Final report with SF 298.\n4.\nRelated Work.\nThe principal investigator is currently working on the nodal function generation architecture in support of the commercial offering by Perseides Corp, namely the Nomadik civil intelligence platform.\nCurrent efforts are focused on ingesting disparate and noisy data sources, and using purpose built transformation schemes to uncover knowledge gaps, opaque relationships, and conflicting information.\nAs these processes work to construct a traversable causal graph, they also indicate exploitable morphisms between seemingly disparate and conventionally incoherent causal chains.\nThese indications then are used to direct algorithmic strategy when approximating for problematic nodes.\nOur commercial data specifically concerns homelessness and its interactions with a host society, and a prime example of this process in action concerns the reporting of illicit drug activity.\nWhat constitutes a valid indication of substance abuse within an encampment community or transient group, and the methods of its detection, are inherently complex and dynamic systems in and of themselves.\nOur users, who are able to report upon such activity, provide raw data in the form of unstructured and structured data alike, as well as the relevant imagery and video providing supposed ‘proof’ of such activity; each of these pipelines naturally incurring unique information transformations, predicated by phenomena such as individual bias / experience, network robustness, encampment proximity and visibility, and the dynamism of substance identification and classification.\nEach of these nodal adjacencies and their contribution in coalescing an empirical function with which to gauge the likelihood of substance abuse can be elucidated by observing the causal morphology of other systems, which indicate the nature of a knowledge gap can be ascertained (this is to say, the Nodes related by a noisy relationship) by evaluating similar systems through causal and semantic inference.\nIn the case of deriving effective metrics for quantifying the aforementioned relationships between user-reporting and the objectivity of incoming data, the semantic distinctions between observations can be traced, and furthermore the causation such distinction can be modeled; in effect, novel nodes can be generated, and their utility serves to reinforce or conflict other hypotheses.\nThis can be seen when the observation of novel drugs within a region commences, from which existing semantic distinctions are reinforced, and the causal relationships that define them are linked to new gaps within the macroscopic graph (general substance abuse within a populated region).\nWhile the primary use case for the nodal architecture is to look for useful patterns and correlations for organizations to utilize in their piece of addressing homelessness, the dynamic knowledge graph user interface allows users to further explore the data.\nData surrounding homelessness is inherently noisy, thus users will need to make corrections and have the supporting architecture that reorients patterns and correlations to effectively apply their limited resources.\nThis is further enabled with the architectures ability to point out knowledge gaps and make further suggestions that refine the information landscape for all organizations involved.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 10 of 14",
        "18": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp 5.\nRelationship with Future Research or Research and Development.\n(a) State the anticipated results of the proposed approach if the project is successful.\nIf the project is successful there will be a resulting paradigm shift not just in how users can interact with dynamic knowledge graphs, but in the intelligence process as a whole.\nThe nodal function generation architecture removes the burden of needing to know exact data types, data structures, and expected values.\nBeyond that, the automatic correlation and pattern recognition between disparate datasets, more sophisticated than the current standard of semantic matching, will enable analysts to uncover hidden patterns critical to modern conflicts.\nAutomatically identifying conflicting information and pointing out information gaps is a critical capability due to the evolving nature of 5th generation warfare and the downstream information and psywar.\n(b) Discuss the significance of the Phase I effort in providing a foundation for a Phase II research or research and development effort.\nPhase I is critical in allowing Perseides Corp to conduct the research and development required to prove our novel thesis on nodal function generation.\nThe Phase I effort provides the time, and non-commercial capital, to prove out a critical capability that serves both the Air Force end user as well as our commercial customers.\nAt Perseides we think about information, and intelligence, in a fundamentally different way than previous attempts at constructing knowledge graphs.\nAt a fundamental level, information can be thought of as a statement regarding some observed process(es) relating some practical quanta of knowledge.\nThese statements cannot offer elucidation about the objective systems that causally govern the related quanta on their own; rather they must logically support the claims made by sibling informative constructs which reference those same quanta, in order to reinforce their validity, or more precisely, their proximity to an objective truth.\nInformation that is proven to be sufficiently valid within some \"objective\" frame of reference can then be considered as a form of Intelligence.\nBecause of the implicit inclusion of uncertainty W.R.T.\ncausal objectivity in both Information and Intelligence, the distinction between the two is more accurately described by the causal bounds in which their configuration is proposed, and the orientation of causal propagation.\nThis is to say, the Information represents some quantized input to a hypothesized system, from which Intelligence can be derived.\nFurthermore, the end state of some configuration representing Intelligence can act as a quanta of information, or ‘Type’, within another system and frame of reference as a source of information.\nWith this in mind, it becomes apparent that any number of Informative quanta, or Nodes, there exists a set of valid Types that represent the attainable (W.R.T.\nthe frame of reference) systems through which Intelligence can be derived.\nThese Types comprise the superposition of configurations that result in novel Nodes that when distilled, can be evaluated for objective efficacy.\nFor example, a proposed configuration of a Type may indicate a causal discrepancy by the degree with which it approximates for other systems, relative to other sibling configurations.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 11 of 14",
        "19": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp Phase II will allow Perseides to take the research and development from Phase I and build a system that satisfies all of the Air Force end users requirements from both the UI/UX experience and the underlying architecture that provides the most accurate dynamic knowledge graph by expanding well beyond traditional semantic connections.\n(c) Identify the applicable clearances, certifications and approvals required to conduct Phase II testing and outline the plan for ensuring timely completion of said authorizations in support of Phase II research or research and development effort.\nGiven that both Phase I and Phase II require participants to utilize their own datasets no clearances, certifications, or approvals are required for the Phase II effort.\nTrevor Sorrells, one of the key personnel, currently holds a Secret clearance.\nShould that be required Perseides Corp will work to find a suitable partner to hold his clearance as Perseides Corp does not have a facilities clearance.\n6.\nCommercialization Strategy.\nPerseides is already in the process of offering a commercial solution integrated with the Nomadik civil intelligence platform being developed for cities and states to better coordinate their city services and associated data - starting with the homeless crisis.\nCities currently face a myriad of crises that require coordinated data and resources to properly address but cities currently lack a solution to achieve the level of coordination required.\nThe Nomadik civil intelligence platform functions as a common operating picture for cities to put every stakeholder on the same page to allow them to more efficiently and effectively carry out their responsibilities.\nThe key enabler of this coordination of data and services is the nodal function generation outlined in section 4.\nBy ingesting data across organizations and standardizing formats through the use of sub-nodal structures, Perseides is able to more effectively build knowledge graphs that uncover hidden correlations and patterns.\nThese correlations and patterns can then be utilized by participating organizations to more effectively address their piece of the puzzle, in our initial case, homelessness.\nThe issue identified by Perseides of a lack of coordination among aligned organizations due to data silos and fragmented information is not exclusive to cities.\nThe ability to build coordinated knowledge graphs among any group of organizations that need to share data and ultimately derive actionable intelligence is a capability that can be exported to any industry, especially among DoD and IC organizations.\n7.\nKey Personnel.\nMorgan Winters - Principal Investigator Kennesaw State University, BS Electrical Engineering, 2021, ML Engineer Modern Intelligence, PLC Engineer Knapp Relevant Experience At Perseides, Morgan is the CTO in charge of building the aforementioned nodal structure to support the meta pattern matching functionality utilized by city and state customers to find Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 12 of 14",
        "20": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp correlations, patterns, and predictions between participating organizations data, expanded on in section 4 relevant work.\nPreviously at Modern Intelligence, as a senior machine learning engineer, Morgan was in charge of implementing the optics library required to place objects detected with computer vision models in a monocular EO/IR camera system in real space.\nAlongside the optics library Morgan led research for novel self-supervised machine learning models to turn 2D images into 3D objects in support of the target re-identification efforts.\nRelevant Awards or Patents ● Morgan is a co-author, along with Trevor Sorrells, on a patent currently in the submission process at Modern Intelligence titled “Object recognition, geolocating, and tracking using optical systems”.\nTrevor Sorrells Georgia Institute of Technology, BS Computer Science, 2019, Lead Engineer Modern Intelligence, Research Engineer GTRI, Embedded Engineer Sandia National Labs Relevant Experience At Perseides, Trevor is the CEO and engineer in charge of the mobile component of the Nomadik civil intelligence platform, providing users with an efficient and coordinated way to submit information to the platform and access relevant intelligence in the field.\nPreviously at Modern Intelligence, Trevor was the lead engineer on the maritime domain awareness product in charge of building and deploying object recognition and re-identification machine learning models.\nAlongside the machine learning models Trevor was responsible for the multi-target tracker sensor fusion system to associate tracks from EO/IR camera systems, radars, AIS transponders, satellite data, and other sensors providing fused target location data to operators.\nRelevant Awards or Patents ● Trevor is a co-author, along with Morgan Winters, on a patent currently in the submission process at Modern Intelligence titled “Object recognition, geolocating, and tracking using optical systems”.\n● GTRI TEN Division Adaptable Entrepreneur Award Austin White Wichita State University, BS Computer Science, 2018, Software Engineer Modern Intelligence, Lockheed Martin, & Microsoft Relevant Experience At Perseides, Austin is the lead engineer on the Nomadik civil intelligence platform, building out the UI/UX experience for customers within cities to coordinate and understand patterns within combinations of their datasets.\nPreviously at Modern Intelligence, Austin built the UI/UX for Modern’s AI maritime domain awareness product for US Navy and Airforce users.\nPrior to Modern, Austin led the development of a full stack web interface for satellite command and operation at Lockheed Martin.\nBefore that Austin led development for a full stack web dashboard for viewing and distributing data results from internal testing applications at Microsoft.\nAustin has extensive experience building intuitive UI/UX experiences for customers ensuring they have a fast and easy to use interface to work with complex software products.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 13 of 14",
        "21": "Proposal Number F244-0001-0006 Topic Number AF244-0001 Perseides Corp Relevant Awards or Patents ● Boeing Award of Excellence ● IEEE Wichita Chapter Best Engineering Project ● Koch Industries Most Entrepreneurial Engineering Project ● Millennium Concepts Best Project ● Shocker New Venture Trade Show 1st Place 8.\nForeign Citizens.\nNone 9.\nFacilities/Equipment.\nPerseides works out of their primary office space with both local and cloud compute available to support the research and development of the project.\n10.\nSubcontractors/Consultants.\nNone 11.\nPrior, Current or Pending Support of Similar Proposals or Awards.\nNo prior, current, or pending support has been provided for proposed work.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 14 of 14",
        "22": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Cage F244-0001-0006 AF244-0001 Interactive Knowledge Graphs for Situational Awareness Using Nodal Function Generation 11/05/2024 04:24:00 PM Perseides Corp 2309 E 5th St, Austin, Texas, 78702 nomadik.ai KZN9PEK8WW27 03A83 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 10%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) $139,736.00 $109,808.00 $29,928.00 $0.00 $0.00 $129,808.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $129,808.00 $0.00 -$20,000.00 $0.00 $109,808.00 $0.00 $54,928.00 $0.00 $0.00",
        "23": "Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 10%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Base Year Direct Labor Costs $0.00 $0.00 $0.00 $0.00 $54,928.00 $0.00 -$25,000.00 $0.00 $29,928.00 $0.00 Category / Individual-TR Software Developer/ Principal Investigator (Morgan Winters) Software Developer/ Front end developer (Austin White) Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $72.00 960 $72.00 320 30 30 $20736.00 $89,856.00 $6912.00 $29,952.00 Subtotal Direct Labor (DL) Labor Overhead Cost Total Direct Labor (TDL) G&A (rate 10%) x Base () Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Year 2 Direct Labor Costs Category / Individual-TR Software Developer/ Principal Investigator (Morgan Winters) Subtotal Direct Labor (DL) Labor Overhead Cost Total Direct Labor (TDL) $119,808.00 $10,000.00 $129,808.00 $0.00 -$20,000.00 $0.00 $109,808.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $72.00 480 30 $10368.00 $44,928.00 $44,928.00 $10,000.00 $54,928.00",
        "24": "G&A (rate 10%) x Base () Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Trevor Sorrells Phone: (770) 317-1526 Phone: trevor@nomadik.ai Title: Proposal Owner $0.00 -$25,000.00 $0.00 $29,928.00 $0.00 If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: No Select the Type of Payment Desired: Partial payments",
        "25": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Software Developer Software Developer Principal Investigator Front end developer Bachelor's Degree Bachelor's Degree 5 9 960 $72.00 30 $89,856.00 320 $72.00 30 $29,952.00 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nThe rate and hours covers the salary for the expected work required to deliver the solution within 6 months.\nDirect Labor Cost ($): Year2 $119,808.00 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Software Developer Principal Investigator Bachelor's Degree 5 480 $72.00 30 $44,928.00 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nThe hours and rate cover the follow-on work likely required to support and improve the solution deliverable.\nDirect Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Cost $44,928.00 $164,736.00 $10,000.00",
        "26": "Overhead Comments: Overhead for this contract will primarily be compute costs associated with the deliverable.\nOverhead Cost ($): Year2 Labor Cost Overhead Cost Overhead Comments: Overhead for this contract will primarily be compute costs associated with the improvement of the deliverable.\nOverhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A costs primarily come from software and rent: - RIppling payroll - Google suites - Slack G&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A costs primarily come from software and rent: - RIppling payroll - Google suites - Slack $10,000.00 $10,000.00 $10,000.00 $20,000.00 10 NO NO $0.00 10 NO NO",
        "27": "G&A Cost ($): Sum of all G&A Costs is ($): Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: The development of the solution works towards our own feature road map for our civil intelligence platform.\nThe knowledge graph is UI is more specific to the contract, but the back end logic has overlap with features we want to develop for customers.\nProfit Rate (%): Profit Explanation: Currently in contract negotiations with initial customers, but no revenue to report.\nTotal Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: The development of the solution works towards our own feature road map for our civil intelligence platform.\nThe knowledge graph is UI is more specific to the contract, but the back end logic has overlap with features we want to develop for customers.\nProfit Rate (%): Profit Explanation: Currently in contract negotiations with initial customers, but no revenue to report.\nTotal Profit Cost ($): Total Proposed Amount ($): $0.00 $0.00 -$20,000.00 0 $0.00 -$25,000.00 0 $0.00 $139,736.00",
        "28": "Trevor Sorrells, Perseides Corp Nov 05, 2024 Nov 05, 2025"
    },
    "images": [],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "nomadik.ai",
        "name": "N/A",
        "phone": "N/A"
    }
}