{
    "filename": "docNAC01FB745353f67e9815248108b6408d21e4f091ff30d35d1feba5d2773c7c2c0384d51246df.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0021 Proposal Title: Interactive Knowledge Graphs for Situational Awareness Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: Cougaar Software, Inc.\nAddress: Website: UEI: DUNS: CAGE: 8260 Willow Oaks Corporate Drive Suite 700, Fairfax, VA 22031-4513 http://www.cougaarsoftware.com J8XHEVNHEG31 076880355 1V9N1 SBA SBC Identification Number: 000664047 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 25 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_000664047 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_000664047 20240611.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [X] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [ ] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [X] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Title Business Name Date Melvin Sassoon Melvin Sassoon SVP Operations Cougaar Software, Inc.\n06/11/2024",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?\nWas your accounting system approved by the auditing agency?\nYES Last Audit Date: 05/04/2021 YES Last Update Date: 05/04/2021 Was a rate agreement negotiated with the auditing agency?\nWas an overhead and/or cost audit performed?\nAre the rates from the audit agreement used for this firms proposal?\nNO NO NO Firm Information: Agency Firm: Address: Point of Contact (POC) Name: POC Phone: POC Email: Upload a copy of the audit information: • 2021_CUI_COUGAAR_SOFTWARE_INC_1V9N1.pdf DCMA Manassas 14501 George Carter Way, 2nd Floor Chantilly , Virginia 20151 Ofelia Flores (571) 521-1972 ofelia.d.flores.civ@mail.mil VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: As the battlespace gets more complex, dynamic and lethal, the Air Force is challenged to find better ways to process data into situational understanding and share that with operators in an effective way.\nAs more sensors, systems, and imagery becomes available in the battlespace, the volume and speed of data availability is ever increasing.\nThe only hope of coping with this",
        "5": "deluge is through advanced automation and reasoning.\nAI/ML offers a highly appealing potential means for automated processing and knowledge graphs provide a powerful means to store, associate, and retrieve the results of that processing.\nHowever, the operator/user is still a critical part of that process, and all that capability must ultimately help him/her make better decisions faster.\nEnabling the operator query, edit, author, refine, and curate the Knowledge Graph (KG) is essential to both the effectiveness of this approach and maintaining the trust between the human and the system.\nThis proposal pursues a Human-Collaborative AI (H-CAI) approach to transformation of data to knowledge, sharing situational understanding and empowering decision support, and most importantly allowing operators to query, edit, author, refine, and curate knowledge (the KG) in an intuitive way and understand the implications of those interactions in terms of the consistency, correctness and overall integrity of the knowledge – without requiring an advanced degree in Computer Science or deep experience with the Knowledge Domain Model.\nThe approach to achieve this H-CAI capability is to expand on Cougaar Software’s existing work with Multi-Agent Systems, Large Language Models (LLMs), Hybrid Knowledge Graphs, and intuitive Human-Collaborative user interface techniques to focus on techniques for directing change, understanding the implications and impacts of that change, and validating the change in both a singular and general (repeatable) fashion.\nThe proposed solution will build displays, agents, and KG reasons that work together to support the human-directed change in terms of analysis, determination of second and third order effects, implementation of mitigations for inconsistencies and errors, and using decision support iteration techniques to set up for an operator decision with support for clarification, modification, and validation.\nSince the Phase I is focusing on the technique, we will leverage an existing H-CAI prototype that uses the same Multi-Agent Systems, LLMs, Hybrid Knowledge Graphs, and intuitive Human-Collaborative user interface techniques as the basis of a feasibility demonstration – but now augmented with the means to query, edit, author, refine, and curate the Knowledge Graph – both the domain model, semantic model (SUMO) and formula/axioms, and the knowledge graph node instances.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: As the battlespace becomes more complex, fast moving, and lethal, the Air Force is challenged to find ways to enable operators to more effectively understand the situation, assess the implications and opportunities, and make better decisions faster.\nToday’s tactical and operational challenges exceed the human cognitive capabilities of even complex organizational structures.\nWe need to lean on automated tools and systems to maintain our competitive edge.\nBuilding better H-CAI techniques will allow the Air Force to better leverage emerging AI/ML technologies, like Large Language Models and Knowledge Graphs, to support this automation, reasoning and decision support.\nH-CAI has the potential to develop the bridge between humans and AI-enhanced computer systems that preserve understanding, context, and meaning in both directions.\nFurther, it would allow the operator to develop trust and confidence in the analysis, results, and recommendations of the system.\nMilitary units spend years building trust and shared understanding.\nToday’s systems are simple tools, which are used in the manner they were designed and operators’ understanding of the system is only as good as the data going into it.\nIn many cases that is neither pristine nor fully trusted.\nMost systems don’t generate the class of insights, understanding, and decision support proposed in this new class of AI/ML",
        "6": "capability.\nAs this technology is introduced into the battlespace, the AI can become another trusted staff entity if it earns trust and shared understanding with the operator and the unit.\nDeveloping the integrated concepts, techniques, and technologies for Human-Collaborative AI Decision Support may be the key to building shared understanding and trust between AI/ML systems and the operator.\nEnabling the operator query, edit, author, refine, and curate the Knowledge Graph (KG) is essential to both the effectiveness of this approach and maintaining the trust between the human and the system.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: Knowledge Graph, Human-Collaborative AI, Multi-Agent Systems, Semantics, Formal Ontologies, Knowledge Curation, AI, LLM VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 100% 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES",
        "7": "3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES YES 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO 16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n25% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nNO VOL I - Contact Information Principal Investigator Name: Todd Carrico Phone: (703) 506-1700 Email: tcarrico@cougaarsoftware.com Address: 8260 Willow Oaks Corporate Drive Suite 700, Fairfax, VA 22031 - 1111",
        "8": "Corporate Official Name: Melvin Sassoon Phone: (703) 506-1700 Email: msassoon@cougaarsoftware.com Address: 8260 Willow Oaks Corporate Drive Suite 700, Fairfax, VA 22031 - 4523 Authorized Contract Negotiator Name: Mr.\nEric Martin Phone: (703) 309-5583 Email: emartin@cougaarsoftware.com Address: 8260 Willow Oaks Corporate Drive Suite 700, Fairfax, VA 22031 - 4523 Form Generated on 11/05/2024 04:11:24 PM",
        "9": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 1 Identification and Significance of the Opportunity 1.1 The Problem Description As noted in the solicitation: “Knowledge Graphs(KGs) organize data about entities and their relationships, representing objects, events, or concepts as nodes and edges.\nThey are constructed from diverse data sources, they unify disparate information into a shared schema, enabling powerful tools like question answering systems and intelligent reasoning.\nThe Air Force is particularly interested in (dynamic) Knowledge Graphs for applications such as situational awareness, threat detection, and targeting operations, which benefit from the adaptable nature of dynamic graphs in changing environments.” There are many different types of knowledge graphs each with their own different capabilities and properties.\nStatic knowledge graphs are of limited use in support of operational planning and execution management.\nWe will confine our discussion to dynamic knowledge graphs, graphs that enable continuous, real-time updating.\nIn most cases, data is processed using automated pipelines, often leveraging AI processing techniques like Large Language Models (LLMs) or other Machine Learning (ML).\nThese automated processing pipelines may introduce errors, fail to perform entity unification and resolution, capture inaccurate pedigree or providence information, or trigger incorrect semantic tagging and resolution.\nOnce data is transformed and inserted into the knowledge graph, other issues may occur which cause incorrect inference, reasoning, or correlation.\nTo be clear, knowledge graphs are powerful tools.\nMore advanced versions are capable of complex situational reasoning and analysis far beyond anything other available tools can support.\nNewer classes of knowledge graphs include advanced spatial and temporal reasoning, state estimation and projection, and even embedding of digital twin micro-models for behavioral classification and modeling.\nSome knowledge graphs support formal ontologies, i.e.\nsemantic ontologies grounded in a higher order predicate logic, which support higher classes of logical reasoning and even truth evaluation and theorem proving.\nOther knowledge graphs support the representation of probabilities allowing a Bayesian network for things like observable beliefs and likely action outcomes.\nAll of this quickly outstrips the knowledge, experience, and background of the typical user making it difficult to establish user trust and maintain a shared understanding with the system.\nThis topic explores concepts, techniques, and technologies which will enable efficient user interaction with a dynamic KG, to include modification of the graph itself, and, consequently building and maintaining trust and increasing understanding in the underlying knowledge.\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 1",
        "10": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 As the battlespace gets more complex, dynamic and lethal, the Air Force needs to find better ways to process data into situational understanding and share that with operators in an effective way.\nAs more sensors, systems, and imagery become available in the battlespace, the volume and speed of data availability is ever increasing.\nThe only hope of coping with this deluge is through advanced automation and reasoning.\nAI/ML offers a highly appealing potential means for automated processing and knowledge graphs provide a powerful means to store, associate, and retrieve the results of that processing.\nBut the operator/user is still a critical part of that process, and all that capability must ultimately help him/her make better decisions faster.\nEnabling the operator to improve the actual KG offers the ideal means to leverage both human and machine capabilities.\nThis is the essence of Human-Machine teaming, or more precisely, Human-Collaborative AI (H-CAI) Decision Support.\nHuman-Collaborative AI (H-CAI) Decision Support, seeks to find the perfect synergy between human operators and AI-based systems and build a bridge of communication and understanding between them.\nThe human needs to understand the knowledge, issues, and decision analytics the AI has performed while the AI needs to understand the questions, direction, and ‘commander’s intent’ of the human operator.\nThis is a critical challenge, as without this level of synergy, misunderstandings arise, mistakes are made, and trust is lost.\nThe integrated concepts, techniques, and technologies for Human-Collaborative AI Decision Support have yet to be codified, but CSI has extensive experience in the area.\nFor the last five years, CSI has been working to establish a foundation for H-CAI in the domain of tactical logistics decision support.\nWhile much progress has been made, there are still critical open issues; CSI proposes to build on its foundational work to enable a user to interact with a dynamic knowledge graph, making changes and additions to the knowledge graph, and then utilize that user input to suggest additional updates to surrounding nodes/edges in the graph, the actual KG structure.\nSpecifically, the research will explore means by which a user may enhance a running KG system instance through: 1.\nAuthoring changes to the domain knowledge model to include classes and relationships and the underlying consistency rules and reasoners that support those elements of the domain.\n2.\nAuthoring and augmenting the semantic tagging of the domain model to include conditional tags and contextual tags.\n3.\nAuthoring and augmenting new contextual reasoners for the knowledge graph, using a visual Horne Clause type conditional statement with spatial, temporal, and type scoping.\n4.\nAuthoring new semantic axioms and formulas which are used by the semantic engine for inference and reasoning.\nSeeking to provide these capabilities comes with three secondary challenges: 1.\nNot violating the consistency and integrity of the higher order predicate logic, graph structure, or data validation constraints.\n2.\nPerforming reconciliation of the changes against the knowledge already in the knowledge graph, detecting and addressing any conflicts or inconsistencies.\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 2",
        "11": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 3.\nEnsuring the detection, communication, and human understanding of the second and third order effects the changes will make on the system knowledge and/or its AI reasoning capabilities.\nGiven the limited computer science, logic, and mathematics background of the user, its incumbent on the system to ensure the user understands the implications of changes and is prevented from making changes that will fundamentally degrade the ability of the system to provide ongoing analysis, decision support, and processing capabilities.\n1.2 The Solution Opportunity CSI has been exploring three areas that are at the heart of this effort: Human-Collaborative AI Decision Support, Hybrid Knowledge Graphs, and Situational Awareness / Understanding.\nMost of this work has been in the domain of logistics planning and execution management.\nCSI proposes to build on its foundational work to develop and demonstrate the concepts, techniques, and technologies for a user to interact with a dynamic knowledge graph, authoring, editing, and reconciling knowledge-graphs in a dynamic knowledge-based system.\nThis will be accomplished via Human-Collaborative AI, and address the consistency, completeness, and correctness issues which may occur because of the changes or as a second/third order effect of the propagation of those changes.\nThese foundations offer a perfect launchpad for the exploration of this topic, both in terms of the foundational technologies already developed and validated, and the previously created application domain with supporting domain data enabling demonstration, testing, and evaluation.\nThe specifics of the domain problem will be outlined later in the proposal.\nThe proposed approach will take advantage of CSI’s robust hybrid knowledge graph architecture, as well as the formal semantics already integrated in this KG architecture, and leverage agents as the maintainers of knowledge in the graph.\nFurther, the effort will reuse existing domain functionality, user interfaces, and data to ensure maximum effort on the specific technical challenges and almost no effort invested in setting up the ‘plumbing’ necessary to support the feasibility demonstration of the key technical concepts proposed here, hereafter simply referred to as a feasibility demonstration.\nIf a Phase II is later selected and funded, the project would extend the feasibility demonstration and technology suite in an Air Force specific prototype application.\nHuman-Collaborative AI Decision Support is an exciting area which focuses on the technologies and techniques of conveying meaning to the human in a manner they will unambiguously understand, and conveying information, direction, and decisions to the system such that it will unambiguously understand.\nThis two-way flow has all the classic elements of Natural Language Processing (NLP) in terms of conversation references, context, and flow patterns, but adds the elements of spatial and temporal reference, CSI has over two decades of experience advancing DARPA’s Cognitive Agent Architecture (COUGAAR).\nCSI’s multi-agent systems (MAS) approach has been expanded and refined through dozens of research prototypes and its resulting MAS capabilities lend themselves perfectly to the management of hybrid knowledge graphs.\nCSI’s H-CAI multi-agent systems include human and software “agents.” © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 3",
        "12": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 Hybrid Knowledge Graphs provide a technology foundation which creates a shared working memory for a set of agents to understand and act upon the situation.\nBy sharing the knowledge graph as a common entity, the agents can ‘see’ the actions, processes, and state being influenced by the other agents and can, as appropriate, both trigger and be triggered by those changes.\nIn this configuration, the human operator is just another ‘agent’ of the system operating on the shared knowledge graph.\nThe knowledge graph builds on prior CSI work on property graphs and RDF graphs to create a first-class hybrid graph, built on a JGraphT core, which unifies objects, graphs, and formal semantics.\nThis new class of knowledge graph is a hybrid of objects, semantic knowledge, formal ontologies, and typed graph structures.\nThis combination provides a powerful engine to perform advanced reasoning using combinations of data, semantics, and relationships.\nThe semantics component of this hybrid knowledge graph is based on the Suggested Upper Merged Ontology (SUMO) and preserves the higher order predicate logic that underpins it.\nWork is ongoing to integrate inference, deduction, theorem proving, and other aspects of logic based semantic reasoning.\nUnlike RDF, the graph nodes and edges (links) have strong domain typing, with the domain type, attributes, and attribute values all semantically grounded.\nCSI has already built a full representation of the logistics planning domain, to include operations, missions, plans, tasks, constraints, restraints, resource requirements, capability requirements, assumptions, dependencies, and more.\nWith a modicum of effort, the representation could be adapted to reflect different use case domains, but this effort will mainly leverage this existing domain representation to pursue the techniques and objectives listed in the solicitation.\nThe engine itself has strong temporal (time point, time span, time events, and timelines), spatial (spatial point, spatial region [2D,3D], spatial route), and Finite State Machine state models in which the state and transitions are also semantically grounded in SUMO concepts.\nThe graph also preserves the SUO-Kif formulas and axioms.\nCSI has also developed a Hierarchal Task Network (HTN) planning engine and corresponding Plan Data Description Language (PDDL) for mapping planning problems into the hybrid knowledge graph space and situational structures.\nThis capability is the shared working knowledge for a set of agents performing planning, managing plan execution, and human- collaborative AI decision support.\nCSI has already begun integrating LLM support for natural language query, tasking, and decision response, in addition to unstructured/semi-structured data transformation and query result transformation to NL form.\nUsing the LLM NLP translation, the formal semantics foundation, and the automated planning over a rich, semantically grounded plan representation provides a context, history, and situational foundation from which to automatically build, integrate and manage the domain concepts.\nUsing the domain of operations and logistics orders, planning, and plan execution provides a structure in which to explore the concepts, build capability leveraging extensive existing work, and evaluate the effectiveness of the new approaches.\nThis rich graph structure, combined with embedded domain reasoners, can serve as the foundation to both understanding the nature of the human graph change, whether data, object, semantic, or domain, as well as determining the changes and impacts on the graph.\nUnderstanding the implications of a change on the graph is really understanding the nature of the change to the current understanding of the situation, i.e.\nSituational Understanding / Awareness.\nBy leveraging a knowledge graph structure built on formal semantics and utilizing embedded © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 4",
        "13": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 planners, reasoners, and agents, the primary impact of a change can be audited and understood, as well as secondary and tertiary changes in the graph.\nThus, the context of the situation, and situational understanding by the AI supporting the human directed change, becomes the core of understanding the nature and implications of the change.\nOnce understood, those implications can be communicated back to the operator using the previously described Human-Collaborative AI Decision Support techniques for review, validation, and adjudication.\nOur solution addresses the need for scalable, dynamic alignment of knowledge graphs, which is essential in domains like military operations, logistics and intelligence, where data sources and relationships evolve rapidly and human intervention to manually inspect and alter the knowledge graph for accuracy is often inadequate and not always possible.\nBy leveraging graph theoretical techniques and semantic ontologies, our approach allows for continuous KG alignment, ensuring that the graph adapts in real time to new data and schema changes.\nThis framework can serve as a robust tool for applications requiring real time data fusion and adaptive decision support, specifically tailored to Air Force needs, such as situational awareness and targeting, in dynamic operational environments.\nIn addition, this proposal seeks to assess the feasibility of a change, and the need for other corresponding changes to ensure consistency and completeness of the situation.\n1.3 The Importance and Benefits As the battlespace becomes more complex, fast moving, and lethal, the Air Force needs to find ways to enable operators to more effectively understand the situation, assess the implications and opportunities, and make better decisions faster.\nToday’s tactical and operational challenges exceeds the human cognitive capabilities of even complex organizational structures.\nWe need to lean on automated tools and systems to maintain our competitive edge.\nBuilding better H-CAI techniques will allow the Air Force to better leverage emerging AI/ML technologies, like LLMs and Knowledge Graphs, to support this automation, reasoning and decision support.\nH-CAI has the potential to develop the bridge between humans and AI-enhanced computer systems that preserve understanding, context, and meaning in both directions.\nFurther, it would allow the operator to develop trust and confidence in the analysis, results, and recommendations of the system.\nMilitary units spend years building trust and shared understanding.\nToday’s systems are simple tools, which are used in the manner they were designed and operators’ understanding of the system is only as good as the data going into it.\nIn many cases that is neither pristine nor fully trusted.\nMost systems don’t generate the class of insights, understanding, and decision support proposed in this new class of AI/ML capability.\nAs this technology is introduced into the battlespace, the AI can become another trusted staff entity and must earn trust and shared understanding with the operator and the unit.\nBENEFIT TAKEAWAY: Developing the integrated concepts, techniques, and technologies for Human- Collaborative AI Decision Support may be the key to building shared understanding and trust between AI/ML systems and the operator.\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 5",
        "14": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 2 Phase I Technical Objectives & Approach 2.1 Technical Objectives The primary objective of this effort is to: PRIMARY OBJECTIVE: Develop the integrated concepts, techniques, and technologies to enable a human user to interact with a dynamic KG, authoring, editing, and reconciling knowledge-graphs in a running knowledge- based system in a Human-Collaborative AI manner and addressing the consistency, completeness, and correctness issues which may occur directly as a result of the changes or as a second/third order effect arising from the propagation of those changes.\nTo support this effort CSI will leverage its existing hybrid knowledge graph technology and utilize one of its existing use-case domains.\nThe CSI knowledge graph utilizes formal semantics (supported by higher order predicate logic) and is built on the SUMO ontology and supporting SUOKIF/KIF infrastructure.\nThe primary objective breaks down into the following secondary objectives: 1.\nDevelop effective methods for human-collaborative AI visualization and editing of the domain knowledge schema (classes and relationships), semantics, axioms and formulas, and domain specific reasoning (FSMs, Relationships, Attributes).\n2.\nPerform real time knowledge graph alignment using our hybrid knowledge graph to manage graph structures, properties, and relationships.\nThis includes ensuring consistency and completeness and propagating any second and third order effects through the graph.\nIncorporate semantic reasoning through the integration of the SUMO ontology to enhance alignment accuracy and communicate in human form the implications of the change, and any second and third order effects observed.\n3.\n4.\nLearn human editing patterns and develop reasoners which persist those change patterns for employment against future data, effectively making the change a persistent change against future data.\n2.2 Key Objective Validation Questions In order to gauge the success of the effort, a set of validation or milestone questions will be evaluated for the resulting framework and tool.\nThe questions include: 1.\nHow can the system reduce the need for manual corrections in the KG and integrate analyst feedback to improve AI/ML performance?\n2.\nWhat UI features will enable analysts to dynamically update and validate the KG, balancing complexity and usability while ensuring analyst understanding?\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 6",
        "15": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 3.\nHow will the system ensure real-time dynamic alignment of heterogeneous data while maintaining semantic consistency as schemas evolve?\n4.\nHow does the SUMO ontology enhance semantic consistency and resolve conflicts and inconsistencies in AI/ML-produced KG structures or human directed changes?\n5.\nHow can the system ensure AI/ML-generated knowledge graph structures are trusted by analysts, and what mechanisms verify their accuracy and relevance?\n6.\nHow will analyst inputs be incorporated and potentially persisted to continuously improve KG accuracy, and what feedback loops will enhance trust?\n7.\nWhat metrics will gauge the success of dynamic KG alignment, and how will it be tested in time-sensitive scenarios?\n8.\nHow will the system manage evolving data schemas and automatically adapt to new entities and relationships?\n9.\nHow will the system ensure data security and integrity during dynamic updates, and what safeguards prevent malicious or erroneous changes?\n2.3 Demonstration, Experimentation, and Testing One of the key challenges of a project like this is building up enough of a domain application to explore the implications and validate the concepts, techniques, and technologies.\nCSI has two existing programs heavily utilizing its proposed three foundational elements: Human- Collaborative AI Decision Support, Hybrid Knowledge Graphs, and Situational Understanding / Awareness.\nTherefore, existing logistics planning and execution applications can be utilized as a foundation for this project.\nIn this case, the systems will be altered to utilize the force structure, data, and plans for Air Force units.\nThe sustainment user interfaces (UIs) and application functionality can be leveraged to quickly form the basis of the concepts and topics.\nSpecifically, the UIs and application functionality will be enhanced to support operator/analyst editing, authoring, and management of the knowledge graph in accordance with the base operational sustainment scenario.\nSpecifically, the demonstration and experimentation will support the scenario where critical aspects of the situation are unobservable, or observed incorrectly within the knowledge and the user needs to adjust the situational understanding in meaningful ways to achieve the desired sustainment and operational logistics functionality required.\nThis may be as simple as identifying the correct state of resources, such as a maintenance bay or logistics distribution vehicle, or as complex as identifying key assumptions are invalidated or target logistics activities need to be done in a different order or schedule.\nAs the sustainment activities of supply, distribution, and maintenance are essential to readiness and operational availability, the manual changes can quickly create second and third order assessment and analysis effects that directly impact sortie generation or readiness reporting.\n2.4 Technical Approach & Concepts The project will assess the feasibility of using CSI’s hybrid knowledge graph, a JGraphT based knowledge graph implementation with property graph features, integrated with the SUMO ontology to perform real time, dynamic KG alignment.\nThis hybrid approach combines graph theoretical techniques with ontology-based reasoning to dynamically align knowledge graphs in an operationally scalable manner.\nThe feasibility assessment will adapt to changing data schemas and graph structures while maintaining the semantic consistency of aligned entities.\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 7",
        "16": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 Key Components of the hybrid knowledge graph for this approach include: 1.\nJGraphT for Graph Management a.\nGraph Structure Handling: The hybrid knowledge graphs utilizes JGraphT to manage the structure of the hybrid knowledge graph, including nodes, edges, and properties.\nThe graph dynamically updates as new data becomes available, ensuring real-time evolution.\nb.\nProperty Graph Model: The hybrid knowledge graph extends JGraphT to support a property graph model where each node and edge can have properties (attributes, labels, metadata).\nThese properties are critical for determining alignment across different knowledge graphs.\nc.\nDynamic Schema Implementation: While JGraphT does not natively support schemas, the hybrid knowledge graph introduces schema concepts by enforcing rules or constraints on node and edge properties through custom implementations.\n2.\nSUMO Ontology for Semantic Alignment a.\nOntological Semantics: Hybrid knowledge graphs integrate SUMO (Suggested Upper Merged Ontology), a large formal ontology, to provide a semantic framework for defining concepts and relationships.\nBy tagging or annotating nodes and edges in the JGraphT-based KG with SUMO's semantic information, we can align knowledge from different sources using shared conceptual definitions.\nb.\nOntology-Driven Schema: Hybrid knowledge graphs make use of SUMO as a dynamic schema that defines how entities and relationships should evolve and interrelate.\nAs the KG evolves, SUMO ensures consistency and guides alignment decisions.\nc.\nSemantic Consistency: The Hybrid knowledge graph SUMO integration provides a semantic framework to ensure that knowledge graph entities are semantically consistent across different sources.\nBy mapping graph nodes to SUMO classes and using ontological reasoning, the system aligns entities even when there are differences in labels or structures.\n3.\nDynamic Graph Alignment a.\nGraph Embedding Models with JGraphT i.\nEmbedding for Property Graphs: The hybrid knowledge graph will use node and edge properties to create feature vectors for each node, including properties like labels, attributes, relationships (based on SUMO), and structural information such as node degree, clustering coefficients, or shortest paths.\nii.\nEmbedding Models: The hybrid knowledge graph will employ graph embedding models using GraphSAGE.\nGraphSAGE is a sophisticated technique where node embeddings are learned by aggregating features from neighboring nodes.\nUnlike techniques like Deepwalk and node2vec which rely on random walks, GraphSAGE uses neighborhood sampling and feature aggregation to embed nodes.\nAs an example, GraphSAGE embeddings could be used to predict how quickly a base might run out of © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 8",
        "17": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 supplies based on nearby nodes’ attributes or recommend efficient resupply routes based on the state of the surrounding nodes.\nOr it can be used to detect deviations from the normal routine such as a vehicle taking an unusual route or supplies being delivered more frequently than usual.\nWhile JGraphT doesn't natively support embeddings, the hybrid knowledge graph will build or integrate custom embedding models where JGraphT provides the graph data.\nThese embeddings map nodes into a shared vector space, enabling alignment by comparing distances or similarities between nodes.\nb.\nSemantic Alignment Using SUMO i.\nOntology Matching: The hybrid knowledge graph will use SUMO to match equivalent concepts between different knowledge graphs.\nFor example, if two nodes from different graphs refer to the same concept in SUMO, they can be aligned.\nii.\nOntology-Driven Features: The hybrid knowledge graph will have annotated nodes and edges with SUMO concepts, which serve as features for embedding models or alignment algorithms and incorporate logical reasoning with SUMO to identify relationships that are semantically equivalent or similar.\niii.\nDynamic Ontology: As the KG evolves, new entities and relationships can be semantically categorized using SUMO, providing a dynamic semantic layer for alignment and ensuring that nodes from different graphs continue to align as the ontology evolves.\nc.\nMachine Learning for Alignment i.\nSupervised Learning: If labeled alignment examples are available, a supervised machine learning model to predict alignments between nodes will be trained, using features extracted from JGraphT (e.g., node properties, embeddings, SUMO annotations).\nii.\nUnsupervised Learning: If labeled data is not available, unsupervised iii.\ntechniques such as similarity-based alignment will be used, where nodes are aligned based on their similarity in the embedding space or semantic similarities derived from SUMO.\nIncremental Learning: For dynamic KGs, employ incremental learning techniques to update the alignment model as the KG evolves, allowing the system to continuously improve alignment predictions as new data is added.\n4.\nIncremental Learning and Real-Time Updates a.\nGraph Updates: Utilize JGraphT's efficient data structures for handling graph updates, such as adding or removing nodes and edges.\nFor dynamic KG alignment, the hybrid knowledge graph can: i.\nMonitor changes in the graph (new nodes, edges, or property updates).\nii.\nRecompute embeddings or update alignment predictions incrementally as new data is introduced.\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 9",
        "18": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 b.\nDynamic Embeddings: Use dynamic graph embedding models that update node embeddings incrementally without retraining the entire model from scratch, which is particularly useful when the KG undergoes frequent changes.\nc.\nChange Detection: By monitoring changes in node properties or the graph structure (e.g., new relationships), trigger real-time alignment updates.\n5.\nAlignment Algorithms with JGraphT a.\nSimilarity Algorithms: Implement custom similarity measures based on node properties, relationships, and SUMO concepts.\nNodes with similar properties or relationships are aligned.\nb.\nShortest Path and Connectivity: Use algorithms like Dijkstra's or A* to compute shortest paths or connectivity between nodes.\nNodes that share similar paths or connectivity patterns across graphs can be aligned.\nc.\nGraph Matching Algorithms: Implement or integrate graph matching algorithms that identify isomorphic subgraphs or structurally similar patterns, extended to consider both the structural and semantic properties (SUMO) of nodes and edges.\n6.\nDynamic Alignment with Micromodels a.\nIn the context of a knowledge graph (KG), a micromodel refers to a lightweight, task-specific model that is designed to handle specific subtasks or challenges within the larger knowledge graph system.\nThese micromodels are modular, specialized components that focus on precise problems or specific regions of the graph, rather than trying to manage the entire graph at once.\nThe goal of a micromodel is to provide localized and efficient solutions, enabling real-time processing and updates in the knowledge graph.\nb.\nSpecialized Subgraph Analysis: Micromodels can be deployed to focus on specific subgraphs within the knowledge graph, identifying patterns or detecting anomalies.\nThis is particularly useful in dynamic KGs where changes in certain subgraphs may require real-time alignment adjustments.\n7.\nSemantic Refinement a.\nEfficient Updates: Micromodels can efficiently handle incremental updates by focusing only on the new or modified parts of the graph, rather than reprocessing the entire graph.\nThis reduces the computational load in real-time applications.\nb.\nLocal Decision-Making: When new nodes or edges are added, micromodels can make local alignment decisions based on a combination of embedding similarity, semantic alignment from SUMO, and additional learned features.\nThis localized decision-making is important for scaling dynamic graph alignment processes.\nc.\nReal-Time Adaptation: In rapidly changing environments, micromodels allow for real-time adjustments to the graph alignment, focusing on changes such as newly added nodes, updated properties, or emerging relationships between entities.\nd.\nBenefits of Micromodels: i.\nScalability: By breaking down complex tasks into smaller, focused models, micromodels enable the system to scale more easily, especially when dealing with large dynamic graphs.\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 10",
        "19": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 ii.\nReal-Time Adaptation: Micromodels can quickly react to changes in the graph, making them ideal for environments where real-time decisions and updates are required.\niii.\nEnhanced Accuracy: Since micromodels are domain-specific, they are able to incorporate detailed, contextual information, resulting in more accurate results for specific tasks like alignment, semantic matching, or anomaly detection.\n8.\nDynamic Alignment with Reasoners a.\nA reasoner performs logical inference and semantic reasoning based on the rules and ontology of the knowledge graph to extract new knowledge.\nReasoners operate globally on the entire knowledge graph or on a large portion of it, applying formal reasoning across the whole structure.\nReasoning involves logical inference, consistency checking, entailment, and rule-based deductions.\n9.\nHuman Collaborative Knowledge Graph User Interactions a.\nCreating Human-Collaborative AI Situational Displays has largely been completed in the TAMMS and DataPIKE programs discussed elsewhere, but these interface don’t support ‘editing’ the knowledge graph directly.\nb.\nDevelop effective visualization of the complex knowledge graph, with situational context markers, search, filter, and overlays.\nc.\nEmpower the user to understand, manipulate, and edit/create/destroy knowledge in the knowledge graph as a two-part transaction: i.\nThe first part identifies the set of proposed modifications to the knowledge graph ii.\nThe second part visualizes the implications, direct and indirect, that the change will make with a impact summary and user authorization to proceed with the change(s).\nd.\nThe system should identify and be capable of rolling back changes that have conflicting and inconsistent results on the knowledge graph.\ne.\nThe system should allow the user to capture the rationale or alternate data source which prompted the change.\n10.\nPattern Visualizations using Histropedia a.\nHistropedia is a timeline visualization platform with a timeline interface to provide intuitive, interactive visualization of the Knowledge Graph Data.\nThis visualization will provide analysts and other users with the ability to explore events, anomalies and real time operational data in a timeline format, helping with dynamic situation monitoring and decision making.\n2.5 Key Technical Focus Areas We will assess the feasibility of using CSI's Hybrid Knowledge Graph (HKG) which combines a JGraphT-based knowledge graph implementation with property graph features and the SUMO ontology to achieve dynamic KG alignment, utilizing a hybrid approach that integrates graph- theoretical techniques from JGraphT and ontological reasoning from SUMO.\nWe will also © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 11",
        "20": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 evaluate the necessary enhancements in visualization and user experience for human- collaborative AI (H-CAI) to build analysts confidence in the knowledge graph updates.\nThe list of key technical focus areas for this feasibility assessment are as follows: 1.\nLeveraging JGraphT for Dynamic KG Alignment o Property Graph Setup: Construct a property graph in JGraphT where nodes and edges have associated properties (attributes), including:  Labels: e.g., \"Person,\" \"Location.\"  Types: e.g., \"Entity,\" \"Concept.\"  Values: e.g., age, coordinates.\n Relations: e.g., \"isLocatedIn,\" \"worksAt.\" o Graph Dynamism: Support graph dynamism by:  Incremental Updates: Adjust the graph structure as new nodes, edges, or properties are introduced or updated.\n Efficient Traversal: Utilize JGraphT’s traversal algorithms (e.g., DFS, BFS) to search for candidate nodes or edges for alignment based on properties or relationships.\nIntegrating SUMO Ontology for Semantic Consistency 2.\no Semantic Enrichment:  Ontology-Based Reasoning: Apply SUMO's formal definitions to nodes and edges in the JGraphT graph, enabling semantic reasoning about entity equivalence even if surface properties differ.\n Domain-Specific Knowledge: Extend SUMO with domain-specific ontologies to better represent the specific concepts in your knowledge graphs.\n Ontology-Mediated Alignment: Use SUMO's rules or axioms to guide the alignment process, prioritizing entities that belong to the same ontological class or have equivalent relationships.\n3.\nAlignment Strategy o Initial Alignment:  Heuristic or Rule-Based Matching: Combine property-based matching from JGraphT and ontology-based reasoning from SUMO.\n Matching Criteria: Align nodes with similar labels or types and those that share common relationships.\n Ontological Equivalence: Utilize SUMO to resolve ambiguities by identifying semantically equivalent entities.\no Dynamic Re-Alignment:  Incremental Algorithms: Continuously update the alignment by running incremental graph alignment algorithms as the graph evolves.\n Schema-Aware Alignment: Reapply the alignment process based on updated semantics if the schema evolves.\no Graph Matching Algorithms:  Approximate Matching: Use algorithms like VF2 Subgraph Isomorphism, enhanced with semantic properties, to find matching substructures between knowledge graphs.\n4.\nDynamic Handling of Schema Changes © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 12",
        "21": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 o Recalculating Similarities: Update node similarities based on new properties or class definitions resulting from schema changes.\no Updating Embeddings: Refresh node embeddings when new features (properties) are added.\no Reasoning on Schema: Use SUMO to infer new classes or relationships due to schema changes, aiding in discovering new alignments.\n5.\nChallenges and Considerations o Embedding Scalability: Optimization of graph embedding techniques for large knowledge graphs, especially with frequent dynamic updates.\no Incremental Alignment Efficiency: Ensuring algorithms efficiently update embeddings and maintain alignment accuracy as the graph evolves.\no Graph Scale Optimization: Implementing optimization techniques in JGraphT to handle large dynamic graphs and ensure scalability.\no Schema Evolution Management: Utilizing versioning systems to track schema changes and minimize impacts on existing alignments.\no Semantic Conflict Resolution: Applying confidence scoring to weigh alignment certainty and make informed decisions when semantic conflicts arise.\n6.\nMachine Learning Integration (Optional) o Embedding-Based Alignment: Use machine learning techniques like knowledge graph embeddings to generate vector representations of nodes, updating these embeddings dynamically as the graph evolves.\no Learning Alignment Rules: Employ machine learning models to learn alignment patterns based on historical data, predicting correspondences between nodes or edges even as graphs evolve.\nUsing the above key technical approach, CSI will perform the feasibility assessment on the following use cases with the existing hybrid knowledge graph implementation, identify gaps, develop a roadmap and develop a feasibility demonstration for Situational Awareness.\n2.5.1 Pattern of Life Detection Pattern of Life (PoL) analysis refers to the process of monitoring and analyzing the habitual behaviors, routines, and movements of individuals, groups, or objects over a period of time to understand normal and abnormal activity.\nIn the military, it’s often used to predict behavior, detect anomalies, and support intelligence gathering for missions.\nAn example is detecting daily troop movements in a base to identify routine behavior.\n• JGraphT for Graph Management: The nodes in this graph would represent different entities like personnel, vehicles, or equipment, while the edges represent interactions or movement patterns (e.g., moving from the barracks to a specific post).\nThe graph evolves in real time as new data streams in, for example, as sensors detect troop movement.\n• Property Graph: Each node (e.g., a vehicle or a soldier) will have properties like timestamps, locations, and behaviors.\nEdges can have properties like movement frequency or duration, enabling dynamic analysis of routines.\n• SUMO for Semantic Alignment: SUMO could define semantic concepts like “routine patrol” or “suspicious deviation.” As the knowledge graph evolves, movements can be © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 13",
        "22": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 classified according to these semantic categories.\nA soldier moving outside a typical route could trigger a reclassification of their behavior from “routine” to “unusual.” • Dynamic Graph Alignment: As new movements are detected, the graph adjusts, ensuring that any abnormal patterns are flagged for further investigation.\nFor instance, if a vehicle deviates from its typical route, the dynamic KG would reflect this change and realign the graph for further scrutiny.\n• Reasoner Implementation: A reasoner can infer patterns by identifying recurring behaviors over time using the formal logic encoded in the SUMO ontology.\nFor example: o If an entity follows a specific sequence of actions A, B, C at specific intervals, infer that the entity is following a routine.\no Based on the semantic relationships defined in the ontology, the reasoner can deduce PoL trends such as daily routines, supply chain movements, or personnel behavior.\no A reasoner might deduce that \"a unit moving between locations A and B consistently at specific times over the past week is a predictable pattern of life.\" • Micromodel Implementation: o A micromodel trained using temporal graph embeddings (e.g., GraphSAGE over time-based snapshots of the KG) can help detect patterns of movement, communication, or operations based on data.\no The micromodel operates locally on specific subgraphs (e.g., tracking an individual unit or logistic node) and learns temporal correlations or relationships.\no The micromodel can be continuously updated with new data, detecting deviations from known PoL patterns in real-time.\n• Visualization: o Pattern of Life (PoL) involves understanding repeated behaviors of entities over time.\nThis can be visualized by plotting recurring activities (e.g., troop movements, supply chain events) as timelines on Histropedia.\nAs an example, display a unit’s movement over a week, showing repetitive patrols.\nUsers can observe if these behaviors change, signaling potential deviations.\n2.5.2 Threat Detection Threat detection involves identifying potential or actual dangers to military personnel, assets, or operations.\nIt is the process of gathering and analyzing information to identify actions, individuals, or entities that may pose a risk.\nThis can involve human actors (e.g., enemy combatants), physical dangers (e.g., IEDs or missile launches), or cyber threats.\n• JGraphT for Graph Management: Drones, radar systems, and perimeter sensors form nodes in the knowledge graph.\nEdges represent communication, sensor detection, or movement paths.\nAs new data is ingested (e.g., drone detection), the knowledge graph updates its structure in real time.\n• Property Graph: A drone node might have properties like velocity, altitude, and flight path.\nAn edge between the drone and radar could indicate detection events, with properties such as detection time and radar cross-section.\n• SUMO for Semantic Alignment: SUMO could define the difference between benign activities (routine flyovers) and potential threats (deviation in flight paths).\nIf a drone’s © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 14",
        "23": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 flight path deviates from the pre-defined security zone, the system can detect this as a potential threat, based on predefined SUMO concepts.\n• Dynamic Graph Alignment: The system ensures that any threat-like behavior automatically triggers a realignment of the graph, updating the threat level for the drone and alerting command systems in real time.\n• Reasoner Implementation: The reasoner, leveraging SUMO ontology, can detect threats by inferring inconsistencies or logical contradictions based on known threat models.\nFor example: o o The reasoner can deduce high-level threat indicators by integrating domain- If equipment or personnel is detected in a restricted area, infer a potential threat.\nspecific knowledge from SUMO (e.g., roles of entities, restricted zones, security protocols).\no The reasoner may deduce that “a military asset has entered an unauthorized zone, suggesting a potential security breach.” • Micromodel Implementation: A micromodel trained for anomaly detection (using a graph- based outlier detection) can detect deviations from normal behavior within the knowledge graph.\nThis is based on structural properties and node embeddings learned from prior observations.\no It works locally by focusing on specific subgraphs where threats are more likely to emerge (e.g., monitoring critical supply chains or personnel movements).\nFor example, it detects unusual communication patterns or resource deployments, which could indicate a threat.\no The micromodel can be deployed for real-time monitoring and anomaly detection, with the ability to flag potential threats as soon as they arise.\n• Visualization: Since threat detection involves recognizing anomalies or potential risks based on real-time data, using Histropedia, detected threats can be represented as events that highlight deviations from normal patterns.\nAs an example, anomalies like unauthorized asset movement or communications will be displayed as distinct events.\nHistropedia could highlight these events using different color codes in real time, allowing decision makers to focus on areas requiring immediate attention.\n2.5.3 Situational Awareness Situational Awareness for targeting operations involve the identification, selection, and engagement of military targets.\nThese operations are highly precise, relying on intelligence to ensure that the correct targets are identified, prioritized, and neutralized or influenced to achieve strategic objectives.\nTargets can include enemy forces, infrastructure, or critical resources.\n• JGraphT for Graph Management: The graph would track assets such as vehicles, personnel, and equipment as they move across the battlefield.\nNodes represent the units, and edges represent communications or tactical relationships (e.g., supporting fire or supply chains).\n• Property Graph: The properties of nodes include locations, combat status, and supply levels, while the edges can represent active coordination between units.\nFor example, a node representing an artillery unit could have properties like ammo levels, and an edge between an artillery unit and infantry can show support fire coordination.\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 15",
        "24": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 • SUMO for Semantic Alignment: SUMO provides a semantic layer that can identify and align concepts like “supporting fire,” “advance,” and “resupply.” This ensures that if new data from a different source is introduced (e.g., a UAV reporting a troop advance), it aligns with the existing knowledge graph.\n• Dynamic Graph Alignment: As operations progress, the knowledge graph continually evolves to reflect new troop movements or changes in combat status.\nJGraphT’s graph traversal algorithms enable commanders to see real-time updates in the alignment of forces, providing enhanced situational awareness.\n• Visualization: Situational Awareness involves integrating data from various entities into a comprehensive view of the current operational environment.\nUsing Histropedia, this can be done by visualizing multiple timelines in parallel to provide users with a synchronized view of the unfolding situation.\nAs an example, show parallel timelines of troop movements and log updates.\nA user might notice that a supply route has been delayed, indicating a potential risk to operations.\nReal-time updates ensure the timeline remain current, enabling users to make decisions based on the latest data.\n2.5.4 Machine Learning for Alignment • Supervised Learning: Historical data on enemy troop movements can be used to train models that predict where they may appear next.\nThe alignment model can leverage features such as node properties (e.g., troop type, location) and SUMO concepts (e.g., offensive or defensive positions) to predict future alignments.\n• Unsupervised Learning: If there are no labeled examples, the system can use similarity- • based alignment.\nFor example, the system could detect that two different troop formations are exhibiting similar behaviors based on their proximity and SUMO- annotated characteristics, triggering an alert.\nIncremental Learning: As new data comes in from sensors or reconnaissance, the system continuously learns and updates the model.\nFor instance, if a previously unknown troop formation is detected, the system can automatically align its behavior with known troop formations based on its learned model.\n2.5.5 Real-Time Updates and Dynamic Embeddings • Graph Updates: As real-time data comes in, such as a new reconnaissance report, the knowledge graph needs to update.\nThis could involve adding a new node for an enemy vehicle and adjusting relationships (edges) between other military units (e.g., detection ranges of radar systems).\n• Dynamic Embeddings: When a new enemy is detected, the system can compute its embedding based on its current properties (e.g., location, speed, and known affiliation).\nAs new properties (e.g., change in speed) are added, the embedding is updated without having to recompute embeddings for the entire graph.\n• Visualizations: Using the real-time nature of the KG based threat detection and situational awareness, new events or insights can be pushed to Histropedia as updates.\nAs an example, detected anomalies (threats) trigger alerts on the timeline.\nUsers can be notified when critical deviations occur, allowing for immediate response.\nIf the Pattern of Life © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 16",
        "25": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 shifts (e.g.\na unit deviated from its usual patrol route), this is flagged in real-time on the timeline, making it easy to spot emerging risks.\n2.5.6 Graph Matching Algorithms • Similarity Algorithms: By comparing properties of nodes (e.g., movement speeds, sensor signatures) and relationships (e.g., distance between radar systems and enemy units), the system can align enemy activities with known stealth patterns stored in the knowledge graph.\n• Shortest Path and Connectivity: The system can compute the shortest path between two known points of attack, helping military strategists quickly identify possible infiltration routes for enemy troops.\nNodes along these paths would be prioritized for monitoring.\n2.5.7 Knowledge-Level Representation of the Tactical Situational Awareness with Embedded Meaning The TAMMS project, identified in the related work section, demonstrates CSI’s capabilities for knowledge-level representation of the tactical situational awareness with embedded meaning for the tactical logistics domain from the Division to the Battalion.\nIn TAMMS, the force structure, unit equipment, unit supplies, facilities, locations, missions and plans, and a variety of other unit, situation, and context data was assembled into a hybrid knowledge graph representation.\nThe situation representation includes map/location information with plans and tasks having associated routes, linking the temporal and spatial representations.\nThe knowledge graph uses timelines to support analysis of events over time, such as consumption events by the Field Artillery weapons platforms.\nThese patterns inform consumption rates, consumption patterns, and movement patterns that serve as context for the development of sustainment support plans.\nThe knowledge transformation performs semantic tagging, spatial and temporal reasoning, and estimations of state against defined Finite State Machines (FSM) – all of which provide additional embedded meaning in the representation.\nIn the case of the FSMs, for example, a plan or task has a PLAN_FSM, which include states such as IN_DEVELOPMENT, IN_EXECUTION, COMPLETED_SUCCESS, and others.\nFurthermore, states can only evolve along predefined transitions which are defined by the domain model.\nIf the task was a movement task and the position updates put the assets assigned to that task within a tolerance radius of the final location the FSM state would be estimated as COMPLETED_SUCCESS.\nThe additional embedded meaning in the transformation of that position event for a vehicle into its meaning for the state of the corresponding task the vehicle was performing is a perfect example of knowledge transformation with embedded meaning.\n2.5.8 Representing and Continuously Reasoning over Plans, Space, Time, and Entity State The hybrid knowledge graph technology used in TAMMS uses two flavors for ‘reasoning’ over knowledge in the graph.\nThe first flavor for ‘reasoning’ over knowledge in the graph is cognitive agents, which operate on the graph, process information into the graph (in addition to the hybrid knowledge graph ingest processing streams), and servicing query and REST service interfaces to pull or process knowledge from the knowledge graph.\nThese agents come in two classes, the ‘functional agents’ which operate as clients of the knowledge graph and form the intelligence in © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 17",
        "26": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 the functional application, and the ‘librarian’ agents whose sole job is to curate the knowledge graph ensuring its consistency, completeness, and integrity during operation.\nThe second flavor for ‘reasoning’ over knowledge in the graph is small embedded reasoners which operate within the graph.\nThese reasoners are typically small, short-lived processes or functions, which can check, update, perform some element of reasoning, perform an analytic function, state estimation, or test for various conditions.\nFor example, in TAMMS, every time a consumption event is processed, a reasoner checks the remaining inventory for that weapon system for that DODIC, to ensure the consumption has not dropped its inventory level below the reorder point.\nIf it did, the reasoner triggers the reorder processes for that platform.\nSimilarly, that same event triggers another reasoner, which recalculates the consumption projections for that platform.\nThe hybrid knowledge graph supports both complex event processing and publish/subscription services, for which agents and reasoners register.\nWhen a new piece of knowledge is added, knowledge is changed, or new relationships among knowledge are established, the system triggers agents and reasoners through events and subscriptions.\nThe Digital Living Plan (DLP) knowledge model provides a rich plan representation which has connections in the knowledge graph to all the situational elements, such as terrain, facilities, units and equipment.\nThe agents and reasoners are constantly monitoring the knowledge graph, through their event triggers and subscriptions.\nSome of these reasoners perform condition checks, ensuring the constraints of the plan are not breached, such as spatial (virtual geofencing) or temporal (schedule) constraints.\nThe reasoners can also reason, infer, or deduce the state of a plan or task.\n2.5.9 Situational Pattern Recognition and Model Projection for Automated Detection of Potentially Impacting Patterns/Events In TAMMS critical data/situational picture updates trigger the run of advanced analytics which update the knowledge graph further.\nIn TAMMS, inventory updates and consumption reports trigger projection models for time-phased consumption and time-phased inventory with respect to the operations plans (fires missions), as appropriate, triggering subsequent order update processes or other logistics sustainment and support processes.\nIn addition to the model projection, advanced pattern analysis is employed to calculate and tag trends that impact critical parameters, patterns of deviation from the base inventory or allocations, and detection of behaviors of systems not following the expected linear progressions.\nThis approach also works for events, which in TAMMS was typically task events or location events.\nUnderstanding the time-phased sequence of events for a system, or across multiple systems/subsystems, is key to understanding meaning.\nUnderstanding and reacting to spatial, temporal, data, and event patterns is a powerful tool when it is done in context, reducing the Type I (false positive) and Type II (false negative) errors of a complex system operating in wild.\n2.5.10 Bridging Knowledge between Operations and Logistics to Ensure Synchronized and Orchestrated Awareness and Unity of Effort CSI has been leading the way on bridging the Ops – Log integration for over a decade through the development of Digital Living Plan (DLP).\nThe DLP is based on the Core Plan Representation (CPR), a concept Dr.\nCarrico co-developed with Adam Pease in the seminal © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 18",
        "27": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 paper in 1998.\nThe application of the CPR in a military domain application was documented in Dr.\nCarrico’s and Mark Greaves’ chapter “Agent Applications in Defense Logistics” published in the 2007 book Defense Industry applications of Autonomous Agents and Multi-Agent systems”.\nUnderstanding Ops-Log integration is all about understanding the relationship between the operational missions and tasks, and the sustainment activities required to support those understanding the evolving situation in real time.\nThis boils down to understanding the consumption and resource utilization, and linking the expected consumption of operational tasks with the actual consumption, and then align the logistics sustainment chains around those expectations and actuals.\nDerived Logistics plans, in turn, are about efficiently managing the flow to the operational locations, and managing inventory to ensure the right material at the right locations in the right quantities is a second order optimization to support operations.\nTAMMS is focused on the ammunition sustainment for tactical forces, primarily Field Artillery.\nThe ammunition sustainment processes are fed by the inventory and consumption reporting of the operational systems and users, and ultimately supports the determination of orders, stockage objectives, fulfillment, and distribution.\nTAMMS is a clear proof case of CSIs knowledge, experience, and capabilities using the knowledge graph technology to bridging knowledge between the operational and logistics functional domains, ensuring synchronized and orchestrated awareness and unity of effort.\n3 Phase I Statement of Work 3.1 Scope This project is to explore, design, and demonstrate the integrated concepts, techniques, and technologies for authoring, editing, and reconciling knowledge-graphs in a dynamic knowledge- based system in a Human-Collaborative AI manner and addressing the consistency, completeness, and correctness issues which may occur directly as a result of the changes or as a second/third order effect of the propagation of those changes.\nThe exploration of techniques for user interaction, graph modification, consistency analysis, and validation will be pursued with the objective of identifying a suite of promising approaches with an initial feasibility demonstration of the concepts and key technologies.\n3.2 Task Outline The Phase I tasks will be conducted at CSI and is estimated to take 6 months of effort and focus on 6 primary tasks: Task Title 1.\nProject Kick-off & Detailed Plan Description Project plan outlining the goals, timelines, key milestones, risk assessments, and success criteria for the feasibility assessment Schedule 30 days after the contract award Performer Prime © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 19",
        "28": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 2.\nTechnology Review & Gap Analysis 3.\n4.\nProof-of-Concept Architecture Prototyping & Initial Demonstration 5.\nFinal Report & Recommendations 6.\nMonthly Reporting Review of current AI/ML approaches to structuring Knowledge Graphs, identifying limitations, and detailing user requirements for more trusted and efficient systems Proof-of-concept architecture for a system capable of dynamically updating and validating Knowledge Graphs Feasibility demonstration that demonstrates the system's ability to dynamically update Knowledge Graphs, incorporating user feedback for validation Final report summarizing the feasibility study results, technical challenges, and recommendations for future development and roadmap Report the technical and financial elements of the project.\nMaps to deliverable D6 in 3.6.4 Prime Prime Prime Prime 60 days after the contract award 90 days after the contract award 150 days after the contract award 170 days after the contract award Ongoing Prime 3.3 Phase 1 Tasks and Deliverables 3.3.1 Task 1 – Project Kick-off & Detailed Plan The contractor shall develop a comprehensive project plan outlining the goals, timelines, key milestones, risk assessments, and success criteria for the feasibility assessment.\nThe contractor shall also gather initial data on user requirements and analyze available data sources relevant to Knowledge Graph (KG) applications in Air Force use cases.\n• Deliverable D1: Project Kick-Off and Plan Presentation - Research plan, including technical approach, key milestones, risk assessment, and success criteria.\n3.3.2 Task 2 – Technology Review & Gap Analysis The contractor shall conduct a state-of-the-art review of current AI/ML approaches to authoring, analyzing changes, and propagating / ensuring consistency and completeness in Knowledge Graphs, identifying limitations, and detailing user requirements for more trusted and efficient human maintenance of knowledge-based systems.\nA detailed analysis will be performed to © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 20",
        "29": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 highlight the gaps in existing knowledge graph technologies and propose solutions to address them.\n• Deliverable D2: Technology Review and Gap Analysis Document - State-of-the-art review of current AI/ML techniques for KGs authoring and reconciliation techniques and limitations for dynamic environments, gap analysis, and identified gaps and requirements for trusted human-collaborative user interfaces.\n3.3.3 Task 3 – Proof-of-Concept Architecture The contractor shall design a proof-of-concept architecture and suite of authoring and reconciliation techniques based on CSI’s hybrid knowledge graph technology for a system capable of dynamically updating and validating Knowledge Graphs.\nThis architecture will focus on real-time updates, user interaction, and validation mechanisms that can be applied in mission- critical Air Force scenarios, plans, and complex situations like threat detection.\n• Deliverable D3: System Design Document (SDD) - Initial design document for the proof-of-concept architecture and techniques.\nIncluding user interaction design, specifying workflows for analysts to update and validate KGs.\n3.3.4 Task 4 – Prototyping & Initial Demonstration The contractor shall develop a feasibility demonstration that demonstrates the system's ability to dynamically update Knowledge Graphs, incorporating user feedback for validation.\nInitial demonstration will utilize existing testbeds to simulate real-world scenarios (e.g., situational awareness, plan execution monitoring, threat detection).\n• Deliverable D4: Feasibility Demonstration - Demonstration of the dynamic KG editing, updating and validation system leveraging existing demonstration testbeds but highlighting the new technical capabilities.\n3.3.5 Task 5 – Final Report & Recommendations The contractor shall prepare and present a final report summarizing the feasibility study results, technical challenges, and recommendations for future development.\nA roadmap will be provided for scaling the system to more extensive Air Force operations, additional forms of editing and reconciliation, and identifying further research needs.\n• Deliverable D5: Final Report Document - Final report summarizing the feasibility assessment, findings, and technical challenges, future roadmap for system scaling, additional research, and technology development.\nIncludes SF 298.\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 21",
        "30": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 3.3.6 Task 6– Monthly Status Reports The contractor shall provide monthly reports of results, status, plans and outstanding issues, starting the first full month after contract award and with monthly invoices within 10 days of the close of the month accounting period.\n• Deliverable D6: Monthly Report - This will be delivered in electronic form, PDF Format, monthly.\n3.4 Schedule and Milestones (POA&M) Figure 1: Phase I and notional Phase II POA&M, shown to get a concept of the combined Phase I, Phase II development plan and timeline 4 Related Work While there are multiple ongoing efforts to use various combinations of the above listed key technologies, the feasibility argument presented here will utilize the following four specific projects to serve as the proof-case.\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 22",
        "31": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 4.1 Tactical Ammunition Management Micro Services System – Situational TAMMS Above Company Knowledge System (TAMMS-STACKS) Name of Effort Name of Awarding Agency Tactical Ammunition Management Micro Services System (TAMMS) – STACKS (Situational TAMMS Above Company Knowledge System) Ground Vehicle Systems (GVS) Other Transaction Agreement (OTA) #W15QKN-17-9-1025 Contract Number / Task No.\nTechnical POC Phone Number E-mail address CSI Principal Investigator Period of Performance 69-201821-T03 Mr.\nSteven Vaccaro 973-724-8706 steven.j.vaccaro.civ@army.mil Dr.\nTodd Carrico 05/16/2022-6/30/2025 TAMMS-STACKS is a component of the TAMMS-FA (Field Artillery) capability, an exploration of using AI/ML, sensors, advanced planning, and situational reasoning to dramatically improve tactical ammunition visibility, accountability, and sustainment processes.\nThe STACKS part of TAMMS is focused on human-collaborative decision support for order recommendations, order fulfilment planning, pack planning, and distribution planning as well as all the analytics, execution monitoring and management, and adaptive learning.\nThe heart of the TAMMS-STACKS capability is a distributed agent architecture, where each distributed node is a shared hybrid knowledge graph being maintained and operated on by a suite of system and functional cognitive agents.\nSTACKS integrates agents, HTN, and Game Theory/Utility Theory into a single integrated but distributed coordinated planning network based on the dynamic battlespace situation.\nFigure 2: TAMMS-STACKS Agents and Knowledge Graph Implementation In STACKS, each agent is both a function manager as well as a service provider.\nFor example, the Order Agent is the host of the REST/JSON-based Order Service and performs all the monitoring and calculations for the ‘order recommendations’ provided to the personnel.\nEach node has 15-20 agents performing various functions from consumption tracking, analytics, © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 23",
        "32": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 inventory management, order tracking, sustainment planning, mission sustainability assessment, mission tracking, and others.\nThe distributed system has nodes have 4 flavors, including tactical (Battery, Gun), command (BN, FDO), supply (R3SP, MATP, ASP), and distribution (Trans Co).\nThe nodes can operate independently, accounting for intermittent comms and independent planning and execution.\nThe hybrid knowledge graph is both the situation as that agents understand it from available data, as well as the plan (Digital Living Plan) that that node is executing.\nThe plans local to any node include supported and supporting plan elements as well as key elements of superior and subordinate plans so their activities stay grounded in the larger set of missions and overall operation.\nFigure 3: TAMMS-STACKS Node Design Concept 4.2 AutoLog: Automated Intelligent Logistics Analyses & Management Description of Effort Name of Awarding Agency Contract Number CSI Project Number Technical POC Phone Number E-mail address Period of Performance (inclusive of options) Armored Reconnaissance Vehicle (ARV) - AutoLog Office Naval Research (ONR) Purchase Order - N00014‐18‐P‐2017 Base + Option – N00014-19-C-2038 074 Mr.\nJeff Bradel 703-588-2552 Jeff.bradel@navy.mil Purchase Order - 26 July 2018 - 25 Jan 2019 Base + Option – 3 June 2019 - 30 June 30 2020 © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 24",
        "33": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 Figure 4: AutoLog (ARV) Onboard AI for Logistics OODA Loop Concept AutoLog was a part of the ONR Code 30 Armored Reconnaissance Vehicle (ARV) research effort, exploring the readiness of various technologies for inclusion in a new generation of US Marine Corps fighting vehicle.\nThe AutoLog concept was to put Autonomous Logistics monitoring, reasoning, planning, and execution management onboard the vehicle to reduce the duty set for the crew – effectively automating most of the logistics processes through advanced AI/ML so the crew could focus on fighting the vehicle and accomplishing their mission, reducing cognitive load and improving vehicle awareness of health and capabilities.\nThe AutoLog system used a hybrid knowledge graph on the vehicle to build and maintain an understanding of the vehicle’s and crew’s status to include health, inventory, capabilities, and subordinate component status like drones and unattended ground sensors.\nThe system was also responsible for all the logistics and maintenance planning.\nIt tracked inventory and its usage to determine resupply timing and quantity as well as maintenance actions based on usage (engine hours, road miles, etc.).\nIt also conducted analysis of Mean Time Between Failure (MTBF) to determine if preventative maintenance was warranted.\nAs the system received operational missions, the planning in ARV would determine what material and munitions was needed for the mission, any pre-mission inspections or maintenance, and any configuration changes required based on the mission capabilities requirements (weapons, sensor packages, subordinate components).\nAutoLog was tied into the vehicle bus (bus simulator for the research) and received status and measurements from all the subsystems allowing it to gauge system health and status, track usage and inventories (fuel, oil, ammunition), as well as monitor the execution of the plan through correlation of system patterns with the expected patterns of the plan.\nIf the Ops plan directed the team to go to point X, AutoLog monitored the progress and status Figure 5: AutoLog (ARV) Onboard AI for Logistics Agents Composition and Functions © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 25",
        "34": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 using onboard GPS and engine /trans state data.\nIf the plan was to deploy 3 unattended ground sensors, AutoLog would determine the task was complete when 3 sensors were removed from inventory and all crew were back on board.\nAutoLog capability demonstrated the OODA loop capability, shown in figure 3, where each agent performed the OODA loop for its function, while AutoLog supported the platform and Marine crew with a suite of agents working together, which formed an higher-level platform OODA loop for the logistics health and monitoring functions of the whole platform.\nAutoLog demonstrated OODA-based cognitive agents, HTN planning, and Genetic Algorithms in a dynamically constructed graph network situation.\n4.3 Distribution & Retrograde Adaptive Planning and Execution (APEX) Management (DRAM) Name of Effort Distribution and Retrograde Adaptive Planning and Execution (APEX) Management (DRAM) Army Contracting Command, New Jersey W15QKN-22-D-0033 / W15QKN23F0121 Mr.\nSteven Vaccaro 973-724-8706 steven.j.vaccaro.civ@army.mil Dr.\nTodd Carrico 09/22/2014-1/30/2024 Name of Awarding Agency Contract Number Technical POC Phone Number E-mail address CSI Principal Investigator Period of Performance DRAM recently completed field testing in EUCOM with the 21st TSC supporting the RSOM of Army BCTs.\nDRAM leverages AI to support Theater-wide planning and execution management for all convoys and movements in ground, air, and water modes.\nDRAM uses the Digital Living Plan to continually monitor and report missions’ deviations and recommend recovery actions defined by branches and sequels, all while ensuring shared situational awareness and performance/closure statistics.\nDRAM provides theater logistics planning and execution management, supporting high-fidelity multi-modal theater movement planning, including commercial and military movements.\nUsing AI techniques, DRAM takes a Movement Request (MR), develops thousands of movement plan options, and presents the best potential solution for each timeframe and primary mode to the user, including the cost, time, resources, complexity, and cost associated with Figure 6: DRAM OV-1 each option.\nThe resulting plans become part of the DLP-based Theater Movement Program, which can then be used for coordination and in execution.\nDRAM can monitor execution using on site reports from Movement Control Teams (MCTs) or feeds from asset tracking such as the National In-Transit Visibility (ITV) server.\nDRAM provides a © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 26",
        "35": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 means to understand distribution operations, and its impacts and constraints on managing the deployment and redeployment of forces in a Theater.\nDRAM started as a Rapid Innovation Fund (RIF) and was later extended under an OTA Task, and finally a second extension was awarded under a Phase 3 SBIR.\nDRAM will provide the plan simulation and theater plan status services and displays, supporting rehearsal, simulation, execution monitoring and execution analysis.\n4.4 Data Platform Integrated Knowledge System (DataPIKE) Name of Effort Name of Awarding Agency Data Platform Integrated Knowledge Environment (DataPIKE) Program Executive Office Command Control Communications-Tactical (PEO C3T) W51701-24-C-0033 Mr.\nAlan Santucci, CIV 201-230-8003 alan.santucci2.civ@army.mil Dr.\nTodd Carrico 01/11/2024-01/10/2026 Contract Number Technical POC Phone Number E-mail address CSI Principal Investigator Period of Performance The goal of DataPIKE is to provide a more advanced tactical data fabric linking into Division and extending down to the tactical edge, but being lightweight, resilient, secure, and little to no setup and configuration.\nThe DataPIKE OV-1 is shown in the figure below, and the functions of DataPIKE include: • Integration of data from many sources, with easy addition of new formats / targets • Transformation of data into information and knowledge in the context of the situation • Advanced automated analytics and reasoning over the data, to include temporal, spatial, and state reasoning.\n• Support for semantic-based queries of the situational representation.\nThe DataPIKE prototype is demonstrating how a critical role in the tactical ecosystem could be filled by a highly automated, lightweight, AI-based capability.\nIt could expedite the progression from data-driven decision making to knowledge-driven decision making, leveraging semantics and situational context as first-class decision support capabilities.\nDataPIKE leverages recent enhancements in ActiveEdge® that make deployment, management, updates, and monitoring easier by packaging individual nodes as Docker containers.\nThis approach allows the creation of a system of a loosely coupled network of nodes, with some nodes providing knowledge-level situational reasoning.\nThe Army’s emerging Command Post Computing Environment (CPCE) definitions and standards are expected to ultimately define the deployment configuration of the DataPIKE nodes at key elements, with lighter weight implementations available at other nodes.\nDataPIKE is a Direct-to-Phase-II SBIR.\n5 Relationship with Future Research or R&D At the end of Phase I, CSI will provide a feasibility demonstration showing support for multiple techniques for human-collaborative AI techniques for authoring knowledge graph changes and the reconciliation associated with those changes as well as a final report that summarizes the capabilities demonstrated, the experimentation and evaluation that was performed, the results of that experimentation and evaluation, and recommendations for additional refinements, research, © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 27",
        "36": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 and development.\nThe results of the Phase I should inform a potential Phase II effort which would build a full research prototype for demonstration and testing in a target functional domain.\nIt is expected that the Phase II effort would build on the results and recommendations of the Phase I research and: • Build additional techniques and expand current techniques • Explore improvements and expansion on the human-collaborative techniques • Create more complex demonstration domains, scenarios, and change sequences • Expand on the forms of change supported, as well as the scale and complexity of the change in a single authoring action • Develop techniques for learning patterns of change and developing autocorrection techniques based on both patterns and prior user direction Support synchronization and management of multiple actors making changes simultaneously and dealing with interacting and conflicting changes in a dynamic environment.\n6 Commercialization Strategy With the emergence of Large Language Models (LLMs) as a successor to Deep Neural Networks (DNNs), renewed interest has emerged in knowledge graphs as a complementary technology, where techniques like Retrieval Augmented Graph (RAG) amplify the capabilities of LLMs using knowledge graph technologies.\nOther research that uses LLMs to solve the complex unstructured/semi-structured data translation challenges of conventional and graph data stores has been expanding rapidly.\nCSI has been exploring multiple techniques for using LLMs to transform unstructured and semi-structured data into precursors for knowledge in our hybrid knowledge graphs, which when coupled with other ingest techniques allow large scale conversion of unstructured data to knowledge.\nCSI has also been working with LLMs to form GraphQL queries, allowing users to provide Natural Language (NL) queries and have them converted into a knowledge graph query format that can be executed.\nWhile all of these techniques are powerful, there still remains the challenge of error introduced by data, and the ability to have humans review, approve, and edit the resulting knowledge.\nCurrent techniques are limited in their ability to manage the edits and more importantly detect the implications of the change.\nIf this approach proved successful, and could be matured in a Phase II effort, a wide variety of commercial and open-source knowledge graph efforts would be anxious to adopt the new techniques and improve their user knowledge management.\nWhile the techniques themselves would unlikely be a commercial or military product, the technology could be a critical enabler to accelerate the adoption of AI in the military and commercial markets through improved human knowledge management and greater transparency and trust.\nIn the end, trust in a complex, adaptive AI system is the most important aspect of a system since without it, military users will revert to their previous tools, processes, and techniques.\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 28",
        "37": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 7 Key Personnel CSI is a Veteran Owned Small Business (VOSB) at the forefront of using AI within a Cognitive Agent Architecture (COUGAAR).\nThis architecture was initially developed under the Defense Advanced Research Projects Agency (DARPA) and made open source.\nCSI has worked with a wide range of clients in the government and commercial sectors to grow and evolve this innovative technology, transforming it from advanced R&D into a powerful and practical automation platform while simultaneously providing robust solutions to complex customer problems.\nKey Personnel Summary Name, Title, Percentage of Effort Dr.\nTodd Carrico Principal Investigator (25%) Cougaar Software, Inc.\nClearance: Top Secret Geetha Ravishankar Architect (12%) Cougaar Software, Inc.\nClearance: Secret Qualifications Education Dr.\nCarrico has been among the key personnel for the contracts listed in Section 4, as well as other contracts awarded to CSI.\nMost recently, he led the design and conceptual operation of the TAMMS and DataPIKE projects.\nDr.\nCarrico continues to lead CSI development teams focusing on AI planning and reasoning, learning, advanced predictive analytics, and intelligent supervisory control.\nDr.\nCarrico is the architect and lead scientist on the Hybrid Knowledge Graph infrastructure and developing the usage patterns, reasoning concepts, and ingest/interface technologies necessary to support its use in multiple planning and decision support applications.\nGeetha Ravishankar has over 30 years of experience architecting, building and managing highly scalable distributed computing platforms.\nShe built unified communication systems based on AT&T network system’s message-oriented middleware platform at Amteva Technologies and Cisco Systems, Managed the architecture, design, development and deployment of commercial email platforms serving 200 million users at Oracle and has managed several large-scale integration programs at various companies and understands the challenges in building and scaling a distributed platform.\nMrs.\nRavishankar has been driving the domain knowledge model design and usage for all of CSI’s planning and decision support applications that use the Hybrid Knowledge Graph technologies.\n• Ph.D., Computer Science, Wright State University • MSc, Computer Science, Washington University in St.\nLouis • BSc, Computer Science, Washington University in St.\nLouis • M.S.\nTechnology Management, University of Virginia • M.E.\nInstrumentation Engineering, Anna University, India • B.E.\nElectronics and Communications Engineering, National Institute of Technology, Tiruchirapalli, India • Post Graduate Program in AI/ML, University of Texas, Austin © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 29",
        "38": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 Todd Carrico, Ph.D., Cougaar Software, Inc.\n– Principal Investigator (PI) Education: • Ph.D., Computer Science, Wright State University • MSc, Computer Science, Washington University in St.\nLouis • BSc, Computer Science, Washington University in St.\nLouis Clearance: Top Secret Citizenship: USA Relevant Experience: Upon leaving DARPA in 2001, Dr.\nCarrico formed Cougaar Software, Inc.\n(CSI) to transition this advanced multi-agent technology to government and commercial markets.\nSince then, under Dr.\nCarrico’s leadership, CSI has successfully productized this technology in various secure, time-critical environments.\nThrough CSI, Dr.\nCarrico continues to manage and participate in various military and non-military-related projects.\nAs a thought leader in intelligent agent technology, Dr.\nCarrico has influenced the concepts, requirements, and designs of numerous military systems, and he remains one of the visionaries on intelligent planning and execution automation technologies in the military.\nAs the DARPA program manager for the Advanced Logistics Project (ALP) and later the UltraLog Program, Dr.\nCarrico managed over $170M with a yearly budget execution in excess of $25M.\nThese programs used advanced technologies to solve massive logistics problems in the military domain, specifically in planning.\nDuring these efforts, Dr.\nCarrico was instrumental in the concept development, design, implementation, and experimentation of the Cognitive Agent Architecture (Cougaar).\nThis architecture is an open-source, Java-based framework used for the construction of large-scale, distributed applications.\nDr.\nCarrico continues to drive the adoption of the Cougaar technology for military and commercial domains and is very active in the Open Source Cougaar community.\nDr.\nCarrico, a former Air Force officer, is a recognized expert in intelligent distributed systems and the founder and CEO of CSI.\nHe has extensive experience leading various government and military efforts that have dealt with advanced technologies like intelligent systems, multi-agent systems, grid computing, and situation awareness in such areas as tactical environments and military planning and logistics.\nDr.\nCarrico has been designing and building large-scale architectures and applications for over eight years.\nRelevant Publications: • Anderson, J.\n& Carrico, T., “Conquering Complexity through Distributed, Intelligent Agent Frameworks,” Conquering Complexity, Mike Hinchey & Lorcan Coyle, Editors.\n©Springer-Verlag London Limited 2012.\n• T.\nCarrico, T.\n& Greaves, M., “Agent Applications in Defense Logistics,” Defense Industry Applications of Autonomous Agents and Multi-Agent Systems, Whitestein Series in Software Agent Technologies and Autonomic Computing, Pechoucek, Michal; Thompson, Simon G.; Voos, Holger (Eds.), 2008 • Assorted papers and articles © 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 30",
        "39": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 Geetha Ravishankar, Cougaar Software, Inc.\n– Chief Knowledge Architect Education: • M.S.\nTechnology Management, University of Virginia • M.E.\nInstrumentation Engineering, Anna University, India • B.E.\nElectronics and Communications Engineering, National Institute of Technology, Tiruchirapalli, India • Post Graduate Program in AI/ML, University of Texas, Austin Clearance: Secret Citizenship: USA Relevant Experience: At CSI, Ms.\nRavishankar is actively guiding the technical design efforts to realize the vision of human-collaborative computing while also driving the agent platform and Situational Reasoning Framework Roadmaps toward more advanced levels of AI/ML decision support and complexity management and scale.\nCurrently, she is guiding the development of advanced capabilities towards demonstrating the autonomy-at-rest concepts and technologies to enable warfighters and logisticians to continuously manage all the details of ammunition inventory and ammunition sustainment across the tactical battlespace, improving performance, understanding, and speed of decision using automation, AI, predictive analytics and machine learning using the CSI’s intelligent agent platform and CSI’s Situational Reasoning Framework.\nPrior to joining CSI, Ms.\nRavishankar extensively evaluated various technologies using systematic technology evaluation methodologies for large-scale storage technologies for banking applications at a national bank, various internet protocols and networking tools and UI frameworks for Cisco’s distributed middleware platforms, various storage and scalable back-end technologies at Oracle and built solutions using the most appropriate technologies that met the business and technical objectives.\nRelevant Publications: None 8 Foreign Citizens No foreign citizens are expected to be involved in the execution of this effort.\n9 Facilities/Equipment All work will be performed at the CSI headquarters in Fairfax, VA.\nCSI maintains a software design and development center that includes conference rooms, a robotics fabrication lab, testing areas, server room, and team collaboration areas.\nCSI has a variety of tablet and handheld test systems as well many sensors, scanners, and camera components for testing and demonstration.\nCSI will provide all the hardware and software technologies required to develop and demonstrate the proposed concept.\nCSI holds a TS Facilities Clearance with Safeguarding to Secret.\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 31",
        "40": "Cougaar Software, Inc.\nCSI-2024-159 Interactive Knowledge Graphs for Situational Awareness Proposal F244-0001-0021 10 Subcontractors/Consultants.\nNo subcontractors or consultants are being proposed for this Phase I effort.\n11 Prior, Current or Pending Support of Similar Awards CSI continues to pursue the transition of agent technology into the mainstream development channels.\nAs such, it is pursuing a variety of military applications of the technology, building extensively on the new class of hybrid knowledge graph technology it is developing for use in deep situational understanding and dynamic adaptive planning.\nAt this time, CSI is not pursuing any efforts with the explicit goals of human authoring or modification of knowledge graphs and managing the complex H-CAI interactions necessary to perform the changes and understand/ address the implications and second/third order effects of those changes.\nWhile we will leverage a great deal that we have already accomplished and will leverage other efforts as they contribute appropriate supporting capabilities, there are no potentially duplicative efforts underway, proposed or planned at this time.\nThat is, there is no prior, current or pending support for the proposed work.\n© 2024, Cougaar Software, Inc.\nProprietary Proposal SBIR Phase I Proposal Page 32",
        "41": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address F244-0001-0021 AF244-0001 Interactive Knowledge Graphs for Situational Awareness 11/05/2024 04:11:21 PM Cougaar Software, Inc.\n8260 Willow Oaks Corporate Drive Suite 700, Fairfax, Virginia, 22031 Website Address http://www.cougaarsoftware.com UEI Duns Cage J8XHEVNHEG31 076880355 1V9N1 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 70.80%) x Base (TDL) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) $139,987.96 $139,987.96 $0.00 $0.00 $0.00 $75,889.04 $0.00 $0.00 $0.00 $0.00 $0.00 $53,729.44 $129,618.48 $0.00 -$0.00 $10,369.48 $139,987.96 $0.00 $0.00 $0.00",
        "42": "Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 70.80%) x Base (TDL) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Chief Executive/ Principal Investigator (Todd Carrico) Computer and Information Research Scientist/ Chief Knowledge Architect (Geetha Ravishankar) Software Developer/ Software Engineer I Subtotal Direct Labor (DL) Labor Overhead (rate 0%) x (DL) Total Direct Labor (TDL) G&A (rate 70.80%) x Base (TDL) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Year 2 Direct Labor Costs $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $168.63 232 37.92 $14835.12 $53,957.28 $105.77 110 37.92 $4411.88 $16,046.58 $60.10 71 37.92 $1618.08 $5,885.18 $75,889.04 $0.00 $75,889.04 $53,729.44 -$0.00 $10,369.48 $139,987.96 $0.00 Category / Individual-TR Chief Executive/ Principal Investigator (Todd Carrico) Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $168.63 0 37.92 $0.00 $0.00",
        "43": "Computer and Information Research Scientist/ Chief Knowledge Architect (Geetha Ravishankar) Software Developer/ Software Engineer I Subtotal Direct Labor (DL) Labor Overhead (rate 0%) x (DL) Total Direct Labor (TDL) G&A (rate 70.80%) x Base (TDL) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA $105.77 0 37.92 $0.00 $0.00 $60.10 0 37.92 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Eric Martin Phone: (703) 309-5583 Phone: emartin@cougaarsoftware.com Title: Proposal Owner If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: Yes Audit Agency Name: DCMA Manassas Audit Agency POC: Ofelia Flores Address: 14501 George Carter Way, 2nd Floor, Chantilly, Virginia,20151 Phone: (571) 521-1972 Email: ofelia.d.flores.civ@mail.mil Select the Type of Payment Desired: Partial payments",
        "44": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Chief Executive Principal Investigator PhD Computer and Information Research Scientist Chief Knowledge Architect Master's Degree Software Developer Software Engineer I Bachelor's Degree 30 35 7 232 $168.63 37.92 $53,957.28 110 $105.77 37.92 $16,046.58 71 $60.10 37.92 $5,885.18 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nCSI is proposing current CSI employees for each labor category and using their salary as the baseline for computing labor rates in support of this effort.\nPayroll information has been attached.\nLabor rate Documentation: • Cougaar Software Labor Rate Paystubs (10202024).pdf Direct Labor Cost ($): Year2 $75,889.04 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Chief Executive Principal Investigator PhD Computer and Information Research Scientist Chief Knowledge Architect Master's Degree Software Developer Software Engineer I Bachelor's Degree 30 35 7 0 0 0 $168.63 37.92 $0.00 $105.77 37.92 $0.00 $60.10 37.92 $0.00 Are the labor rates detailed below fully loaded?\nNO",
        "45": "Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nCSI is proposing current CSI employees for each labor category and using their salary as the baseline for computing labor rates in support of this effort.\nDirect Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) Overhead Comments: Overhead Cost ($): Year2 Labor Cost Overhead Rate (%) Overhead Comments: Overhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nCSI proposes a Firm Fixed Price (FFP) cost using the most recently submitted indirect cost rates, which are the CSI 2024 Provisional Rates approved by DCAA on April 16, 2024.\nGeneral and Administrative (G&A) expenses are the residual costs necessary to run our business, regardless of whether you have government contracts.\nCommon examples of G&A Costs: Labor for strategic planning, business development efforts and to manage or perform administrative functions.\nThis G&A is only applied to CSI Direct Labor.\nCSI utilizes three cost elements: • (Indirect Cost) Fringe: this represents the costs associated with employee fringe benefits.\n• (G&A Cost) Sub/ODC/Travel Handling: representing the indirect labor $0.00 $75,889.04 0 $0.00 0 $0.00 $0.00 70.80 NO YES",
        "46": "costs associated with administering subcontracts, ODCs, and Contract Travel administration.\n• (G&A Cost) G&A: representing all other General & Administrative allowable costs.\nThe Base for each is formed as follows: • Fringe (37.92%): Direct wages, G&A Labor, IR&D Labor, B&P Labor, Sub/ODC Labor • Sub/ODC/Travel Handling (4.60%): Contract Subcontract costs, Contract ODC costs, and Contract Travel.\n• G&A (70.80%): Direct wages, Direct Labor burden.\nCSI has provided documentation from DCAA on approved rates and the adequacy of its accounting system in Volume V of this submission.\nG&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Sum of all G&A Costs is ($): Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: This is CSI's standard profit fee for a fixed price contract of this level of effort and available funding.\nThis proposed rate structure was reviewed and approved through the CSI management structure.\nTotal Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: $53,729.44 70.80 NO YES $0.00 $53,729.44 -$0.00 8 $10,369.48 -",
        "47": "Profit Rate (%): 8 Profit Explanation: This is CSI's standard profit fee for a fixed price contract of this level of effort and available funding.\nThis proposed rate structure was reviewed and approved through the CSI management structure.\nTotal Profit Cost ($): Total Proposed Amount ($): $10,369.48 $139,987.96",
        "48": "SBIR Company Commercialization Report Cougaar Software, Inc.\nDISCLAIMER: Information provided herein is privileged and confidential, and not subject to disclosure, pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nThis information shall only be used or disclosed for evaluation purposes.\nPrivileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 08/28/2023 Page 1/5",
        "49": "SBIR Company Commercialization Report Total Investments: Total Sales: Total Patents: $2,246,365.00 Company Information Address: $25,079,374.00 0 8260 WILLOW OAKS CORPORATE DR STE 700 FAIRFAX, VA 22031-4523 United States Government Designated Phase III Funding: $2,859,073.99 SBC Control ID: SBC_000664047 Company Url: http://www.cougaarsoftware.com Company POC Title: SVP Operation Full Name: Melvin Sassoon Commercialization POC SVP Operations Title: Full Name: Melvin Sassoon Phone: Email: 7035061700 msassoon@cougaarsoftware.com Phone: Email: (703) 506-1700 Ext 106 msassoon@cougaarsoftware.com Additional Company Information % Revenue for last fiscal year from SBIR/STTR funding: 7.8% Year Founded: 2001 Total revenue for last fiscal year: $1,000,000 - $4,999,999 # Employees Currently: 23 Year first Phase I award received: # SBIR/STTR Phase I Awards: 2002 7 Year first Phase II award received: # SBIR/STTR Phase II Awards: 2003 4 # Employees at first Phase II award: Mergers and Acquisition within past 2 years: 17 No Spin-offs resulting from SBIR/STTR: IPO resulting from SBIR/STTR | Year of IPO: No No | N/A Patents resulting from SBIR/STTR | #Patents: List of Patents: No | N/A Woman-Owned: No HUBZone-Certified: No Additional Investment From DoD contracts/DoD subcontracts Angel Investors Venture Capital Self Funded Private Sector Other Federal Contracts/Grants Other Sources Additional Investment Total Investment Socially and Economically Disadvantaged: No SBC majority-owned by multiple VCOC, HF, PE firms | By what percent (%): No | N/A Last Submitted Version (06-29-2022 11:57 AM) $0.00 $0.00 $0.00 Current Version $0.00 $0.00 $0.00 $1,755,257.00 $2,246,365.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $1,755,257.00 $2,246,365.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 08/28/2023 Page 2/5",
        "50": "SBIR Company Commercialization Report Phase III Sales To DoD or DoD prime contractors Private Sector Export Markets Other Federal Agencies Additional commercialization by 3rd Party Revenue Other Customers Additional Sales Total Sales Government Phase III Contracts Last Submitted Version (06-29-2022 11:57 AM) Current Version $20,957,589.00 $25,079,374.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $20,957,589.00 $25,079,374.00 Funding Obligated $0.00 $2,859,073.99 Last Submitted Version (06-29-2022 11:57 AM) Current Version Commercialization Narrative Dr.\nTodd Carrico, former Program Manager of the DARPA Advanced Logistics Program (ALP) and UltraLog program, founded Cougaar Software, Inc.\n(CSI) in 2001 with the specific intent to complete, extend, and commercialize the Cognitive Agent Architecture (COUGAAR) Open Source technology that came from these programs.\nThe company’s vision was to take COUGAAR Open Source from a TRL 5 distributed architecture framework to a TRL 9 intelligent systems development platform.\nOver the past twenty years (20), the CSI team has developed and delivered our vision with ActiveEdge®, our commercial agent-based platform for distributed and intelligent decision support systems.\nIn that time, the ActiveEdge® platform has evolved from a robust autonomy architecture for everything from autonomy in motion (robotics) to autonomy at rest (decision support applications) and everything in between.\nThe platform has proven to support the entire solutions development life cycle, thus empowering developers to develop and deploy intelligent applications and enhance legacy applications with a thin layer of intelligence.\nActiveEdge® is based on Marvin Minsky’s “Theory of Mind,” attempting to emulate human cognition in software.\nUsing this approach, agents can form human-collaborative decision support, planning, execution management, and analytics systems capable of managing data and complexity beyond those of most conventional architectures.\nThe agent model emulates behaviors to observe, reason, plan, and act, allowing customers to automate portions of critical decision-making processes.\nDesigned to transform data from complex processes into usable knowledge, ActiveEdge® provides a distinct competitive advantage to the battlefield and military domain applications.\nActiveEdge® integrates many advanced concepts of distributed computing, semantic reasoning, knowledge graphs, agent-based reasoning, planning, tasking, and more.\nThe ActiveEdge® platform is an evolving framework to manifest those concepts in a complete development and integration platform for human-collaborative systems.\nIn determining SBIRs/STTRs to pursue, CSI has been very selective to ensure the opportunities proposed are a good fit for the use, hardening, and enhancement of the ActiveEdge® platform and associated capabilities, thus supporting all aspects of Artificial Intelligence, Autonomy, and Decision Support.\nIn summary, CSI has awards for the following SBIRs: Active Methods STTR (ST02-03): Phase I was completed in 2003, and Phase II was completed in December 2006.\nBased on the Phase II development, CSI heavily utilized the Active Methods technology in the first release of our commercial product ActiveEdge® during 2005-2006.\nThis technology was further developed through our own investment and other commercial and Government efforts and became the ActiveDesktop framework within ActiveEdge®.\nActiveDesktop provides an agent-based desktop environment and the core visualization and application management services for that environment and supports the Model-View-Controller (MVC) paradigm and allows coordination, data sharing, and collaboration among local and remote desktop applications.\nMore recently, CSI has been moving to Angular web interfaces and micro-services but has kept many of the ActiveDesktop concepts in human-collaborative interface design and use.\nCommander’s Portal Technologies (A03-086): Phase I was completed in 2004, and Phase II was completed in September 2006.\nThe Commander’s Portal technology was also incorporated into ActiveEdge® and was used as part of the technology infrastructure in the Simulation & C2 Information Systems Connectivity Experiments (SINCE) for the US Army.\nThe Commander’s Portal technology was then transitioned to an SBIR Phase III contract under the US Army Logistics Innovation Agency (LIA) to utilize as a key component of LIA’s Enterprise Based Adaptive Logistics (EBAL) project.\nThis project was completed in 2010.\nThe key component of the EBAL Phase II and Phase III was using the Commander’s Portal technology as the building block for the LogC2 “Portal” of this effort.\nWe also used the Commander’s Portal Technology under a contract for Joint Forces J4 to demonstrate a Logistics Decision Support Tool through a Non-Combatant Evacuation Operation (NEO) scenario.\nBased on operational level logistician's procedures, this project demonstrated a decision support capability that supports the rapid collaborative definition of Courses of Action and logistical feasibility assessment based on calculated critical resource requirements and materiel demand.\nDistributed Frameworks for Dynamic Human/Agent Collaborative Problem Solving (DARPA06-008): Phase I started in 2007 and was completed in September 2010.\nThe key objectives of this SBIR focused on the following three design pillars: 1.\nA comprehensive framework for implementing distributed problem-solving networks specifically geared toward maximizing the effectiveness of human/agent collaboration; 2.\nA suite of services and support infrastructure to enable the collaboration, cooperation, and communication between human and agent actors Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 08/28/2023 Page 3/5",
        "51": "SBIR Company Commercialization Report in a dynamic system; and 3.\nDemonstrate feasibility of the framework in a limited domain problem and evaluate the issues associated with a full implementation.\nThis framework was designed and developed and has been leveraged currently into one DoD project as well as has been integrated in our ActiveEdge® commercial product as our Intelligent Portal Framework.\nCSI was awarded an SBIR Phase III IDIQ contract in August 2022 from the US Army Futures Command.\nThe focus of this SBIR Phase II is to extend and utilize this technology for various critical near-term problems by improving Artificial Intelligence (AI) enhancement of human performance, decision-making, operational efficiency, and mission success by leveraging the Government’s investment in the prior SBIR and CSI’s technology and experience that emerged from it.\nIn particular, this IDIQ will support the development of the next generation of human- machine collaborative systems, improving human processes with AI, automation, and situational reasoning by utilizing specific roles and levels of autonomy for humans and machines, including manned and unmanned autonomous systems.\nConfigured Airlift Load Builder - CALBT (AF182-048): Phase 1 was completed in November 2019, and Phase II was completed in May 2022.\nThe focus of this SBIR was to explore the use of AI to support efficient automation and pallet optimization in order to maximize the value of the scarce aircraft space while ensuring that all pallets are compliant, compatible, and meet transportation and handling regulations.\nCALBT was envisioned to be an automated web and mobile application that will increase the efficiency of pallet planning and optimization of the pallet load, thus optimizing the use of space in the aircraft into which the pallets will be loaded.\nCSI used several technologies to develop the application, including Wildfly, Keycloak, Angular, Babylon, Cordova, Andriod SDK, and ML Kit.\nThese different technologies were chosen to ensure that the application is lightweight, powerful, secure, and scalable so it can support the AI analytics and 3D visualizations necessary.\nBased on the completion of the final demonstration at Dover Aerial Port, CSI successfully designed, developed, and tested an automated pallet planning solution.\nElements of this solution are under consideration for the Air Force Aerial Port of the Future effort.\nCSI anticipates an SBIR Phase III IDIQ will be awarded in the fall of 2023, to continue the development of the Configured Airlift Load Builder to be renamed Congruency Engine for Rapid Baseline & Effective Readiness of Unified Services (CERBERUS).\nCERBERUS will be an automated system with algorithms that take a diverse set of air cargo, conveyances, and operator preferences to produce optimal staging plans and load configurations.\nIt is anticipated that this effort will be field-tested as part of the Air-Forces JCDT, Aerial Port of the Future (APoF), which is due to be completed in 2025.\nMobile Configured Airlift Load Calculator - MCALC (N201-021): Phase I was completed in November 2020.\nThe focus of this SBIR was to develop an automated lightweight and scalable load-building application for aircraft that can measure and input unique cargo dimensions and locations within the aircraft, support staging development for more efficient cargo loading, generate optimal cargo configurations with restraints using a handheld device, and display multiple unique aircraft loading spaces and aircraft tiedown locations.\nPhase I identified data inputs and coordination requirements, researched optimization algorithms, evaluated scanning and rendering technologies, developed a design for a mobile application that supports cargo planning, and assessed the feasibility of the design.\nAI for DLA Distribution Center Warehouses (DLA221-004): Phase I was completed in April 2022.\nThe focus of this Phase I SBIR was on AI-based prototype(s) that can exploit data from various sources, identify and learn patterns in that data, and use those patterns to perform specific prediction, identification, and accountability functions.\nCSI’s effort during Phase I focused on the feasibility of integrating technology and lessons learned from previous CSI DoD logistics research and development efforts and exploring the possibility of improving DLA warehousing and distribution operations through the integration of AI/ML, automation, and IOT.\nThe heart of the envisioned prototype was to draw meaningful conclusions from disparate data sets resident in unconnected data systems within the DLA item order and fulfillment systems in the hope that this conclusion would provide better accountability, manpower planning, and high priority item identification.\nThere were no Phase II awards made for this SBIR.\nDefining and Leveraging digital Twins in Autonomous undersea operations DELTA (D211-24): Phase I was completed in October 2022.\nThe focus of Phase I was to assess and analyze the feasibility of extending digital twins to the undersea operational environment for autonomous vehicle applications, determine the effects of undersea intermittent communications on the implementation of digital twins in this domain, and define “digital twin” use cases in an undersea operational setting.\nCSI was looking to address whether the implementation of digital twins can add value to the Unmanned Underwater Vehicle (UUV) mission space, ranging in scale from single UUV deployments to hundreds of missions, and if so, how digital twins should be employed in various scenarios.\nCSI is seeking to advance human-collaborative problem solving with technologies that utilize distributed agents as the framework, hybrid knowledge graphs as the knowledge representation, and utilize a range of AI/ML, mathematics, Operations Research, and other techniques as the behaviors.\nUsing a divide-and-conquer strategy, large, complex problems can be broken into smaller problems, solved, and recombined where each small problem is solved using the most effective technique(s).\nCSI has been developing and using this strategy for 20+ years and can now solve very large, very complex problems in highly automated, human-collaborative ways.\nApplying this approach to logistics, operations, autonomy/robotics, and data analytics have proven highly effective and powerful.\nCSI looks forward to continuing to develop state- of-the-art solutions and, where appropriate, utilize SBIR/STTR projects to facilitate solving challenging DOD problems.\nCommercialized Awards Listed below are the sales revenue and investment details resulting from the technology developed under these SBIR/STTR awards.\nDistributed Frameworks for Dynamic Human/Agent Collaborative Problem Solving Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 08/28/2023 1 of 2 Page 4/5",
        "52": "SBIR Company Commercialization Report Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: SBIR/Phase II/2008 Topic #: SB062-008 Contract/Grant #: W31P4Q-08-C-0308 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Government Designated Phase III Contracts Funding Agreement / Contract # W15QKN-22-D-0033 Agency ARMY Phase III Sales To $0.00 Dod or DoD prime contractors: $25,079,374.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $2,246,365.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $2,246,365.00 Sales Total: $25,079,374.00 Project Title Year Awarded Human- Machine Collaborative Automated Problem Solving (HM-CAPS) 2022 Funding Obligated $2,859,073.99 Agent-based Commanders Portal Technology 2 of 2 Agency/Branch: Department of Defense/Army Manufacturing related Program/Phase/Year: SBIR/Phase II/2004 Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Topic #: A03-086 Contract/Grant #: W15P7T-05-C-P007 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: Logistics Innovation Agency (LIA)/G4 b.\nSystem/Program: Enterprise Based Adaptive Logistics (EBAL) c.\nCost Savings: $920,000.00 d.\nCost Savings Type: life-cycle e.\nExplanation: Based on initial development costs from Phase II, plus leveraging additional internal investments.\nAdditional Investment From DoD contract/subcontract: Other Federal contract/grants: Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 08/28/2023 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 5/5",
        "53": "Eric Martin, Cougaar Software, Inc.\nNov 05, 2024 Nov 05, 2025"
    },
    "images": [
        {
            "page": 1,
            "image_file": "docNAC01FB745353f67e9815248108b6408d21e4f091ff30d35d1feba5d2773c7c2c0384d51246df_page1_img1.jpeg",
            "hash": "963c69c169799696",
            "position": "Middle Center"
        },
        {
            "page": 30,
            "image_file": "docNAC01FB745353f67e9815248108b6408d21e4f091ff30d35d1feba5d2773c7c2c0384d51246df_page30_img1.png",
            "hash": "ce6c585a69ceac4a",
            "position": "Middle Center"
        },
        {
            "page": 31,
            "image_file": "docNAC01FB745353f67e9815248108b6408d21e4f091ff30d35d1feba5d2773c7c2c0384d51246df_page31_img2.jpeg",
            "hash": "d2b32ccc347c3c99",
            "position": "Bottom Center"
        },
        {
            "page": 32,
            "image_file": "docNAC01FB745353f67e9815248108b6408d21e4f091ff30d35d1feba5d2773c7c2c0384d51246df_page32_img2.jpeg",
            "hash": "c396610b82e97ec7",
            "position": "Middle Center"
        },
        {
            "page": 33,
            "image_file": "docNAC01FB745353f67e9815248108b6408d21e4f091ff30d35d1feba5d2773c7c2c0384d51246df_page33_img2.jpeg",
            "hash": "b2ad4c0d3756895b",
            "position": "Top Center"
        },
        {
            "page": 33,
            "image_file": "docNAC01FB745353f67e9815248108b6408d21e4f091ff30d35d1feba5d2773c7c2c0384d51246df_page33_img5.jpeg",
            "hash": "9d80627726da8dad",
            "position": "Bottom Center"
        },
        {
            "page": 34,
            "image_file": "docNAC01FB745353f67e9815248108b6408d21e4f091ff30d35d1feba5d2773c7c2c0384d51246df_page34_img1.jpeg",
            "hash": "852e5e6732e40edc",
            "position": "Middle Left"
        },
        {
            "page": 41,
            "image_file": "docNAC01FB745353f67e9815248108b6408d21e4f091ff30d35d1feba5d2773c7c2c0384d51246df_page41_img1.png",
            "hash": "834987a6cf38ccb6",
            "position": "Top Left"
        },
        {
            "page": 53,
            "image_file": "docNAC01FB745353f67e9815248108b6408d21e4f091ff30d35d1feba5d2773c7c2c0384d51246df_page53_img1.jpeg",
            "hash": "c6cc2b23999bb24d",
            "position": "Middle Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "cougaarsoftware.com",
        "name": "N/A",
        "phone": "N/A"
    }
}