{
    "filename": "docNAC01FB7453535d8ccbb60d6d519f5f0cfc272d7e4072642043641fa964ebdf082bbb34b96f8c.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0102 Proposal Phase I Feasibility Study and Prototype for Visualizing Correlated Data from Gen AI Title: Applications in a Knowledge Graph Dashboard Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: YOUnifiedAI LLC Address: Website: UEI: CAGE: 1484 Villena Dr, Myrtle Beach, SC 29579-8061 www.younifiedai.com RFKPD8CR2JJ7 9ZNP7 SBA SBC Identification Number: 002659676 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 2 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_002659676 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_002659676.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO N/A NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [X] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [ ] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [X] Asian [X] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Title Business Name Date EUGINA JORDAN /Eugina Jordan/ Co-founder and CEO YOUnifiedAI LLC 09/09/2024",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?NO VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: This Phase I project aims to deliver a feasibility study and prototype focused on the development of an interactive knowledge graph dashboard to support situational awareness, decision-making, and operational readiness.\nCurrent Gen AI applications, such as those used in HR and Finance, often operate in siloed environments, limiting the ability to synthesize data efficiently across domains.\nThese silos hinder timely decision-making, resulting in operational delays that can impact resource allocation & mission outcomes.\nThe proposed solution integrates two Gen AI applications—HR and Finance—via lightweight API connections to demonstrate the real-time visualization of correlated data within the dashboard.\nThe knowledge graph (dashboard) will allow users to explore relationships between staffing updates and financial impacts.\nFor example, when HR tracks new hires, the dashboard will reflect corresponding budget adjustments in real-time, supporting faster decision-making.\nThis interactive interface will provide critical insights into patterns and anomalies, ensuring the Army can respond to operational challenges effectively.\nKey data correlations will be visualized in real-time, ensuring that users can respond to operational changes swiftly and accurately.\nThe feasibility study will validate the technical and operational viability of integrating HR and Finance Gen AI applications using lightweight APIs to support real-time data correlation and visualization.\nThe study will identify potential risks, such as API limitations, data flow inconsistencies, or integration challenges, and propose mitigation strategies to ensure seamless performance.\nThrough this process, we will confirm that data relationships can be accurately represented in the knowledge graph dashboard to enhance situational awareness and decision-making.\nBy the end of Phase I, the feasibility study will demonstrate a functional prototype capable of delivering real-time insights from HR and Finance systems, confirming that the approach is scalable for future phases.\nThis foundation will pave the way for Phase II development, enabling the solution to support additional operational modules and more complex data correlations, contributing to faster decision-making and improved resource management in time-sensitive",
        "5": "environments.\nThe project scope avoids the complexity of full API gateways or advanced correlation layers, focusing instead on lightweight data exchange and visualization to remain feasible within the constraints of Phase I.\nThe success of this prototype will be measured through quantifiable metrics, including dashboard responsiveness, data accuracy, and user satisfaction, ensuring alignment with the Army’s operational goals.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: This Phase I project lays the foundation for a scalable Gen AI integration solution, starting with the development of a knowledge graph dashboard to demonstrate real-time data correlation between HR and Finance applications through lightweight API integration.\nFuture phases will incorporate modules that abstract and process data from multiple Gen AI applications and an advanced correlation layer to facilitate bi-directional data flow, enhancing operational readiness.\nAnticipated Benefits for the Army The proposed solution addresses data fragmentation and operational silos by focusing on lightweight, real-time data integration through APIs.\nDuring Phase I, the solution will demonstrate feasibility by visualizing correlations between staffing updates and budget impacts through the dashboard.\nThis will provide commanders with real-time insights to support faster decision-making, improve resource management, and ensure situational awareness in time-sensitive environments.\nAlthough modules and the advanced correlation layer are not part of the Phase I scope, the dashboard prototype will validate the potential for these future components.\nPhase II will incorporate these elements to synthesize data across multiple applications (e.g., HR, Finance, logistics) and enable bi-directional data flow, generating actionable insights for mission-critical areas.\nThis phased approach ensures the solution remains feasible within Phase I constraints while laying the groundwork for more complex integrations in the future.\nPotential Commercial Applications This solution will provide significant value to small and medium-sized enterprises (SMEs), which often face challenges related to data silos, disconnected systems, and costly integrations.\nBy enabling lightweight API integration through a centralized dashboard, the solution will allow SMEs to avoid data silos and gain real-time visibility into critical metrics such as staffing levels and budget performance.\nIn future phases, the introduction of modular components and a correlation layer will provide businesses with even deeper insights by integrating data from multiple Gen AI applications and generating actionable intelligence across departments.\nThe Generative AI Application Store will allow businesses to access pre-vetted AI tools, ensuring cost- effective adoption and reducing operational overhead.\nThis solution offers a scalable, flexible platform that can grow with business needs, supporting decision-making and improving resource management without the need for expensive custom integrations.",
        "6": "This architecture is especially valuable in industries such as healthcare, manufacturing, and finance, where real-time data insights and efficient resource management are essential.\nAs the platform evolves, it will enable organizations to scale operations, manage complex data flows, and remain agile in dynamic environments.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: Knowledge Graph Dashboard Real-Time Data Visualization Generative AI Integration Operational Readiness Lightweight API Connections Data Correlation Layer Situational Awareness Eliminating Data Silos VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 100% 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES 3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.",
        "7": "5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES NO 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, YES release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO 16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n60% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES VOL I - Contact Information Principal Investigator Name: Mrs.\nEUGINA JORDAN Phone: (978) 660-8659 Email: younifiedai@gmail.com Address: 1484 Villena Dr, Myrtle Beach, SC 29579 - 8061 Corporate Official Name: Ms.\nRevathi Pillai Phone: (617) 470-0740 Email: revathiapillai@gmail.com",
        "8": "Address: 1484 Villena Dr, Myrtle Beach, SC 29579 - 8061 Authorized Contract Negotiator Name: Mrs.\nEUGINA JORDAN Phone: (978) 660-8659 Email: younifiedai@gmail.com Address: 1484 Villena Dr, Myrtle Beach, SC 29579 - 8061 Form Generated on 11/03/2024 03:54:03 PM",
        "9": "1 Volume 2 - Technical Volume Phase I Feasibility Study and Prototype for Visualizing Correlated Data from Gen AI Applications in a Knowledge Graph Dashboard Part 1: Technical Approach To efficiently integrate Generative AI applications into military operations, this feasibility study and small prototype development propose developing a dynamic knowledge graph dashboard to demonstrate correlations between siloed Gen AI applications—HR and Finance.\nThis interactive dashboard will visualize key insights and allow real-time user interaction, supporting situational awareness and rapid decision-making.\nGiven the constraints of the grant size, the focus will be on lightweight API integration and simple correlation, delivering core functionality without the complexity of advanced gateways or correlation layers.\nIntroduction Effective decision-making in military operations relies on seamless access to accurate and timely data.\nHowever, current systems often operate in siloed environments, where Gen AI applications leading to delayed insights and for HR, Finance, and other functions are disconnected, fragmented information.\nThese data silos impede situational awareness, reduce operational readiness, and hinder the ability to make informed decisions quickly, which is essential in time-constrained environments.\nThe proposed solution addresses these challenges by developing an interactive knowledge graph dashboard that integrates and visualizes correlated data from two Gen AI applications—HR and Finance.\nThrough lightweight API integration, the dashboard will eliminate data silos, providing a unified view of key relationships in real time.\nThis streamlined approach will enable faster, more effective decision-making, supporting the Army’s mission to enhance operational awareness and readiness.\nTechnical Approach for Phase I In this Phase I feasibility study and prototype development, we will focus on creating a dynamic, interactive knowledge graph dashboard that visualizes correlated data from two Gen AI applications—HR and Finance—integrated via lightweight API connections.\nThe goal is to eliminate data silos and present meaningful relationships through real-time visualization, even if the data is not directly entered by the user, to enhance situational awareness and decision-making.\nNOTE: This streamlined approach focuses on simple data correlation and visualization, delivering core functionality without requiring an API Gateway or advanced correlation layer, ensuring feasibility within the scope of the grant.\nYOUnifiedAI | Phase I DoD SBIR 2024.4: F244-0001-0102 I Feasibility Study and Prototype for Visualizing Correlated Data from Gen AI Applications in a Knowledge Graph Dashboard",
        "10": "2 Fig.\n1.\nPrototype to demonstrate knowledge graph/dashboard.\nIn the Phase I feasibility study and de-risking with prototype development, we will: 1.\nIntegrate two Gen AI applications—one for HR and one for Finance—using lightweight API connections without a complex API Gateway.\nThis approach abstracts only the necessary data, ensuring seamless interaction.\n2.\nCorrelate data between HR and Finance to reflect key relationships.\nFor example, the HR dashboard will capture staffing needs, and when positions are filled, the financial data will automatically update to show the impact.\n3.\nDevelop the interactive knowledge graph/dashboard as the main focus of the project.\nThe dashboard will visualize correlated data from HR and Finance, providing real-time insights into staffing decisions and their financial impacts.\nThis will enhance situational awareness, supporting fast and effective decision-making.\nThe feasibility study will assess the technical and operational viability of integrating HR and Finance Gen AI applications using lightweight APIs, with a focus on data correlation and visualization in the knowledge graph dashboard.\nPotential risks include API limitations, such as restricted access or limited functionality, which will be mitigated through early API evaluation and provider collaboration.\nData inconsistencies or mismatches will be addressed with pre-processing routines and validation checks to ensure alignment.\nTo prevent real-time data flow issues, asynchronous data handling will optimize updates.\nSecurity concerns will be mitigated with encryption and role-based access controls, ensuring data privacy.\nFinally, user adoption risks will be managed through early user testing and feedback to guarantee an intuitive dashboard interface that meets operational needs.\nYOUnifiedAI | Phase I DoD SBIR 2024.4: F244-0001-0102 I Feasibility Study and Prototype for Visualizing Correlated Data from Gen AI Applications in a Knowledge Graph Dashboard",
        "11": "Statement of Work (SoW) Milesto ne Objective Tasks Timeli ne Assess the feasibility of integrating two Gen AI applications (HR and Finance) using lightweight APIs to correlate and visualize data in a dynamic knowledge graph dashboard.\nDevelop the interactive knowledge graph dashboard to visualize correlated HR and Finance data, supporting real-time interaction and situational awareness.\nTest and optimize the knowledge graph dashboard to ensure reliable visualization of correlated data 1.\nEvaluate API calls to extract relevant data fields and assess compatibility for integration.\n2.\nDevelop initial data patterns (e.g., HR staffing updates triggering financial adjustments).\n3.\nIdentify technical and operational challenges in maintaining seamless data flow and propose mitigation strategies.\n4.\nDocument a simplified architecture to support lightweight API integration and real-time correlation.\n5.\nEstablish baseline performance metrics for correlation and visualization to inform Phase II.\n1.\nDesign and implement the dashboard interface to display data relationships between HR and Finance visually.\n2.\nIntegrate data feeds using lightweight APIs, ensuring seamless data extraction from both Gen AI applications.\n3.\nImplement interactive features to allow users to explore insights in real time and understand the financial impact of staffing decisions.\n4.\nEnsure real-time updates to reflect any staffing or financial changes within the dashboard.\n1.\nCreate graphical visualizations highlighting relationships, patterns, and gaps in HR and Finance data.\n2.\nConduct scenario-based testing to validate data correlation and dashboard performance.\n3.\nOptimize the dashboard based on test results, ensuring responsiveness Month 1 Month s 2-4 Month s 5-6 Milesto ne 1: Feasibili ty Study Milesto ne 2: Prototyp e Develop ment Milesto ne 3: Visualiz ation and Testing 3 Desired Outcome 1.\nFeasibility report detailing API integration challenges, mitigation strategies, and data correlation feasibility.\n2.\nPreliminary architecture for lightweight API connections and dashboard integration.\n3.\nBaseline performance metrics for correlation accuracy and dashboard responsiveness.\n1.\nA functional prototype of the interactive knowledge graph dashboard.\n2.\nReal-time visualization of HR and Finance data correlations.\n3.\nA usable interface supporting operational decision-making.\n1.\nGraphical representation of key insights within the dashboard.\n2.\nA tested and optimized dashboard ready for Phase II development.\nYOUnifiedAI | Phase I DoD SBIR 2024.4: F244-0001-0102 I Feasibility Study and Prototype for Visualizing Correlated Data from Gen AI Applications in a Knowledge Graph Dashboard",
        "12": "4 and operational effectiveness in time-constraine d environments.\nand data accuracy.\n4.\nDevelop a risk management plan to address potential challenges and ensure smooth operation.\n3.\nRisk management strategy for scaling and operational deployment.\nFinal Deliverables Prototype: A small-scale prototype demonstrating the integration of two Gen AI applications (HR and Finance) using lightweight API connections.\nThis prototype will visualize correlated data in a dynamic knowledge graph dashboard, showcasing real-time insights for operational decision-making.\nIt will highlight how data relationships and patterns are automatically reflected in the dashboard, supporting situational awareness and reducing data silos.\nReports: 1.\nFeasibility Study Report: Comprehensive analysis of the technical and operational feasibility of the lightweight integration and real-time data correlation.\n2.\nPhase I Summary Report: Summary of the outcomes from Phase I, including lessons learned and key findings.\n3.\nPhase II Proposal: Recommendations and a detailed roadmap for Phase II development, focusing on expanding the dashboard’s capabilities and addressing any out-of-scope items identified in Phase I.\nSuccess Metrics: 1.\nData Correlation Accuracy: Accurate and reliable correlation of data between HR and Finance applications, with automated updates reflected in the dashboard (with 1-2 sec delay).\n2.\nUser Feedback: Positive feedback (85% positive) from users regarding the dashboard’s ability to provide actionable insights and improve decision-making.\n3.\nOperational Readiness: Evidence that the prototype enhances situational awareness by reducing data silos and enabling fast, effective decision-making in time-constrained environments.\nPart 2: Team Qualifications Key Personnel and Roles YOUnifiedAI Team: Eugina Jordan (Project Manager): ● Oversees project management to ensure alignment with SBIR Phase I objectives.\n● Manages communications, schedules, and deliverables to meet all milestones.\nRevathi Pillai (System Architect): ● Leads the architecture design for lightweight API integration and data correlation strategy.\nYOUnifiedAI | Phase I DoD SBIR 2024.4: F244-0001-0102 I Feasibility Study and Prototype for Visualizing Correlated Data from Gen AI Applications in a Knowledge Graph Dashboard",
        "13": "5 ● Provides technical oversight to maintain robust, scalable data management and real-time responsiveness.\nSenior Developer (YOUnifiedAI): ● Develops API-based integration to extract and correlate data from HR and Finance applications.\n● Implements simple data correlation mechanisms to support the real-time knowledge graph dashboard.\n● Collaborates with the System Architect to ensure seamless data flow and performance optimization.\nUX Designer (YOUnifiedAI): ● Designs the interactive knowledge graph dashboard for usability and effective data visualization.\n● Ensures the dashboard presents correlated insights clearly to support situational awareness and decision-making.\n● Works with the Sr.\nDeveloper to align the user interface with real-time data updates.\nTeam Qualifications ● Eugina Jordan (Project Manager): ○ Expertise in coordinating multi-disciplinary teams and aligning project outcomes with strategic goals.\n○ Proven leadership in navigating complex project environments and delivering results under tight timelines.\n● Revathi Pillai (System Architect): ○ Expert in architecting scalable, secure solutions for data-intensive operations across public safety and enterprise domains.\n○ Skilled in managing complex data flows and ensuring system performance in operationally demanding environments.\n● Senior Developer (YOUnifiedAI): ○ Strong expertise in API development, real-time data flow management, and AI integration.\n○ Experience building scalable platforms for high-stakes applications requiring real-time insights.\n● UX Designer (YOUnifiedAI): ○ Skilled in data visualization and user-centered design, focusing on clarity and usability.\n○ Proven track record in developing interactive dashboards to present actionable insights effectively.\n○ Experience in collaborative design processes to ensure seamless functionality and alignment with real-time data needs.\nForeign National Personnel: There are no foreign national personnel proposed for this project.\nAll team members are U.S.\ncitizens or permanent residents.\nYOUnifiedAI | Phase I DoD SBIR 2024.4: F244-0001-0102 I Feasibility Study and Prototype for Visualizing Correlated Data from Gen AI Applications in a Knowledge Graph Dashboard",
        "14": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Cage F244-0001-0102 AF244-0001 Phase I Feasibility Study and Prototype for Visualizing Correlated Data from Gen AI Applications in a Knowledge Graph Dashboard 11/03/2024 03:53:59 PM YOUnifiedAI LLC 1484 Villena Dr, Myrtle Beach, South Carolina, 29579 www.younifiedai.com RFKPD8CR2JJ7 9ZNP7 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (7%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) $139,619.87 $139,619.87 $0.00 $0.00 $0.00 $111,566.00 $18,919.86 $0.00 $0.00 $0.00 $0.00 $0.00 $130,485.86 $0.00 -$0.00 $9,134.01 $139,619.87 $0.00 $0.00 $0.00 $0.00",
        "15": "Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Base Year Direct Labor Costs $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Category / Individual-TR Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost Chief Executive/ Principal Investigator (EUGINA JORDAN) Computer Occupations, All Other/ Solutions Architect (Revathi Pillai) Software Developer/ Software developer: API and correlation of data Computer Occupations, All Other/ UX designer to create the dashboard (knowledge graph) based on correlated data from Gen AI apps $44.00 598 $77.00 338 $49.00 572 $26,312.00 $26,026.00 $28,028.00 $48.00 650 $31,200.00 Subtotal Direct Labor (DL) Labor Overhead Cost Total Direct Labor (TDL) Direct Material Costs Cloud Infrastructure (Microsoft Azure Containers, Compute, and Storage) JetBrains IntelliJ IDEA development tool API testing and integration from 2 Gen AI Apps Neo4j will serve as the backbone for our interactive knowledge graph, enabling us to store, manage, and analyze complex relationships between entities in real-time.\nThis will allow users to explore connections, detect patterns, and gain insights essential for situational awareness and decision-making in dynamic, time-sensitive environments.\n$111,566.00 $0.00 $111,566.00 $5,750.46 $587.40 $588.00 $8,000.00 Leena AI will serve as a Gen AI HR app to pull employee data, correlate it with financial information, and feed it into the knowledge graph, enabling integrated insights and efficient data management for the SBIR project $2,500.00",
        "16": "$1,494.00 $18,919.86 $0.00 -$0.00 $9,134.01 $139,619.87 $0.00 We will use Truewind.ai as a Gen AI finance app to automate financial data processing, integrate it with HR data from Leena AI, and feed both into a knowledge graph to enable comprehensive, real-time insights for strategic decision-making.\nTotal Direct Material Costs (TDM) G&A (rate 0%) x Base () Cost Sharing Profit Rate (7%) Total Estimated Cost TABA Year 2 Direct Labor Costs Category / Individual-TR Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost Chief Executive/ Principal Investigator (EUGINA JORDAN) $44.00 0 Subtotal Direct Labor (DL) Labor Overhead Cost Total Direct Labor (TDL) Direct Material Costs n/a Total Direct Material Costs (TDM) G&A (rate 0%) x Base () Cost Sharing Profit Rate (0%) Total Estimated Cost TABA $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: EUGINA JORDAN Phone: (978) 660-8659 Phone: younifiedai@gmail.com Title: Proposal Owner If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: No Select the Type of Payment Desired: Partial payments",
        "17": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Chief Executive Principal Investigator Computer Occupations, All Other Solutions Architect Master's Degree Master's Degree Software Developer Software developer: API and correlation of data Bachelor's Degree Computer Occupations, All Other UX designer to create the dashboard (knowledge graph) based on correlated data from Gen AI apps Bachelor's Degree 24 27 20 12 598 $44.00 $26,312.00 338 $77.00 $26,026.00 572 $49.00 $28,028.00 650 $48.00 $31,200.00 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\nThe labor cost is based on the hourly rate in the attached document.\nProvide any additional information and cost support data related to the nature of the direct labor detailed above.\nPlease see the rates in the attached document.\nLabor rate Documentation: • Labor Rates for All Zip Recruiter.pdf Direct Labor Cost ($): Year2 $111,566.00 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Chief Executive Principal Investigator Master's Degree 24 0 $44.00 $0.00 Are the labor rates detailed below fully loaded?\nYES",
        "18": "Please explain any costs that apply.\nThe SBIR Is a 5-month project, no year 2.\nProvide any additional information and cost support data related to the nature of the direct labor detailed above.\nThis is a 6-months project, no year 2 unless asked for a Phase II proposal.\nDirect Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Cost Apply Overhead to Direct Materials Cost?\nOverhead Comments: No overhead for Phase I.\nOverhead Cost ($): Year2 Labor Cost Overhead Cost Apply Overhead to Direct Materials Cost?\nOverhead Comments: It's a 6 months project, no year 2 unless is asked to submit the Phase II proposal.\nOverhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\n$0.00 $111,566.00 $0.00 NO $0.00 $0.00 NO $0.00 $0.00 0 NO",
        "19": "NO NO $0.00 0 NO NO NO $0.00 $0.00 Apply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Direct Material Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nNo G&A costs.\nG&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Direct Material Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nIt's a 6-months project, no year 2.\nG&A Cost ($): Sum of all G&A Costs is ($): ODC-Materials Base Description: Cloud Infrastructure (Microsoft Azure Containers, Compute, and Storage) Vendor: Microsoft Total Cost($): $5,750.46 Competitively Sourced?\nyes Quantity: 1 Consumable?\nno Exclusive for this Contract?\nyes Supporting Comments: Supporting Documents: • Pricing Calculator Microsoft Azure.pdf",
        "20": "Description: JetBrains IntelliJ IDEA development tool Vendor: JetBrains IntelliJ Total Cost($): $587.40 Competitively Sourced?\nyes Quantity: 6 Consumable?\nno Exclusive for this Contract?\nyes Supporting Comments: Supporting Documents: • IntelliJ IDEA.pdf Description: API testing and integration from 2 Gen AI Apps Vendor: Postman Quantity: 1 Consumable?\nno Exclusive for this Contract?\nyes Supporting Comments: Supporting Documents: Total Cost($): $588.00 Competitively Sourced?\nyes Description: Neo4j will serve as the backbone for our interactive knowledge graph, enabling us to store, manage, and analyze complex relationships between entities in real-time.\nThis will allow users to explore connections, detect patterns, and gain insights essential for situational awareness and decision-making in dynamic, time-sensitive environments.\nVendor: Neo4j Quantity: 1 Consumable?\nno Exclusive for this Contract?\nyes Supporting Comments: Supporting Documents: Total Cost($): $8,000.00 Competitively Sourced?\nyes • Neo4j knowledge graph visualization tool pricing.pdf Description: Leena AI will serve as a Gen AI HR app to pull employee data, correlate it with financial information, and feed it into the knowledge graph, enabling integrated insights and efficient data Vendor: Leena AI",
        "21": "management for the SBIR project Quantity: 1 Consumable?\nno Exclusive for this Contract?\nyes Supporting Comments: Supporting Documents: • Leena AI HR App.pdf Total Cost($): $2,500.00 Competitively Sourced?\nyes Description: We will use Truewind.ai as a Gen AI finance app to automate financial data processing, integrate it with HR data from Leena AI, and feed both into a knowledge graph to enable comprehensive, real-time insights for strategic decision-making.\nVendor: Truewind AI Total Cost($): $1,494.00 Competitively Sourced?\nyes Vendor: n/a Total Cost($): $0.00 Competitively Sourced?\nyes Quantity: 6 Consumable?\nno Exclusive for this Contract?\nyes Supporting Comments: Supporting Documents: • Truewind AI Gen AI Finance APP.pdf Year2 Description: n/a Quantity: 0 Consumable?\nno Exclusive for this Contract?\nyes Supporting Comments: n/a ODC-Summary Base Do you have any additional information to provide?\nYear2 Do you have any additional information to provide?\nNO NO",
        "22": "Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: No cost sharing.\nProfit Rate (%): Profit Explanation: Standard rate.\nTotal Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Total Proposed Amount ($): -$0.00 7 $9,134.01 -$0.00 0 $9,134.01 $139,619.87",
        "23": "EUGINA JORDAN, YOUnifiedAI LLC Oct 27, 2024 Oct 27, 2025"
    },
    "images": [
        {
            "page": 1,
            "image_file": "docNAC01FB7453535d8ccbb60d6d519f5f0cfc272d7e4072642043641fa964ebdf082bbb34b96f8c_page1_img1.jpeg",
            "hash": "963c69c169799696",
            "position": "Middle Center"
        },
        {
            "page": 10,
            "image_file": "docNAC01FB7453535d8ccbb60d6d519f5f0cfc272d7e4072642043641fa964ebdf082bbb34b96f8c_page10_img1.png",
            "hash": "bf03e0fc89631978",
            "position": "Top Center"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB7453535d8ccbb60d6d519f5f0cfc272d7e4072642043641fa964ebdf082bbb34b96f8c_page14_img1.png",
            "hash": "834987a6cf38ccb6",
            "position": "Top Left"
        },
        {
            "page": 23,
            "image_file": "docNAC01FB7453535d8ccbb60d6d519f5f0cfc272d7e4072642043641fa964ebdf082bbb34b96f8c_page23_img1.jpeg",
            "hash": "c6cc2b23999bb24d",
            "position": "Middle Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "younifiedai.com",
        "name": "N/A",
        "phone": "N/A"
    }
}