{
    "filename": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0028 Proposal Title: SkyLine: Structured Knowledge Graphs with Integrity & Lineage Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: Smart Information Flow Technologies, d/b/a SIFT Address: Website: UEI: DUNS: CAGE: 319 1st Ave North Suite 400, Minneapolis, MN 55401-1689 http://www.sift.net HT19FEFNVXC5 103477993 1NHZ1 SBA SBC Identification Number: 000000276 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 35 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_000000276 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_000000276.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [X] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Title Business Name Date Harry Funk /Harry B.\nFunk/ Vice President, R&D Smart Information Flow Technolo 12/11/2019 gies, d/b/a SIFT",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?\nWas your accounting system approved by the auditing agency?\nWas a rate agreement negotiated with the auditing agency?\nWas an overhead and/or cost audit performed?\nYES Last Audit Date: 02/20/2020 YES Last Update Date: 03/09/2023 YES Last Update Date: 03/14/2014 YES Date of Overhead Audit: 03/07/2014 Date of Cost Audit: 03/07/2014 Are the rates from the audit agreement used for this firms proposal?\nYES Firm Information: Agency Firm: Address: Point of Contact (POC) Name: POC Phone: POC Email: DCAA, Minneapolis Branch Office 316 Robert St N, STE 615 St.\nPaul , Minnesota 55101 Melissa Scherf (763) 744-5520 Melissa.Scherf@dcaa.mil Upload a copy of the audit information: • LETTER 2023MAR Final Determination Accounting System Approved.pdf VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: SIFT proposes to build SkyLine (Structured Knowledge Graphs with Integrity & Lineage) to innovate how human-machine teams collaboratively visualize, revise, and extend all-source knowledge graphs with high integrity.\nKnowledge graphs support",
        "5": "intuitive human visualization and concept-mapping, and they often have formal semantics that supports machine reasoning, so SkyLine will leverage knowledge graphs to (1) help humans express objectives, tasks, and queries to their machine teammates, and (2) help machines express results, conflicts, assumptions, and other tradecraft considerations to their human operators.\nThis incurs some key research challenges, which SIFT proposes to address by leveraging recent R&D advances in AI/ML and human factors.\nOne challenge is integrating data from authoritative, high confidence sources alongside emerging data from unfamiliar sources, without losing track of confidence and data integrity.\nTo this end, SIFT proposes to use our TRL- 7 provenance-based approach that tracks and visualizes the object-based production, sourcing, reliability, conflict, and corroboration of mission data.\nAnother challenge is managing machine collaborators' contributions to the knowledge graph and ensuring that human operators are not overloaded, misled, or distracted by machine inferences.\nSkyLine will prioritize machine contributions by mission relevance (using spreading activation over the knowledge graph), inferential confidence, and source reliability, and will allow sorting by other desiderata, to help surface the most relevant, highest-utility machine contributions.\nSIFT brings technologies for multimodal visualization and provenance analysis that has been used in U.S.\nIC and DoD mission environments to mitigate risk and address these challenges early in Phase I.\nSIFT is well-positioned with transition customers in the DoD and IC to build SkyLine and deliver it to analysts who need it.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: SkyLine will most directly benefit analysts who access information from diverse sources and integrate data into a central knowledge graph or other mission representation.\nThis task of mission-based information integration is often conducted under time pressures and under requirements for analytic standards (IC Directive 203) and sourcing (IC Directive 206), and while analysts may have access to intelligent software tools, these tools may be burdensome to run and understand.\nSkyLine will facilitate this work by letting analysts use the knowledge graph to express objectives and tasks for machine teammates to complete, and then providing the machines an API for tracking their provenance (i.e., operations, inputs, and outputs) to ensure that SkyLine tracks the lineage of machine contributions.\nSkyLine's provenance will jointly (1) improve analysts' sensemaking about machine contributions to the knowledge graph, and (2) facilitate the analysts' compliance with IC Directives, since the provenance connects each knowledge graph node and link back to the foundational sources.\nIn addition to helping military analysts, SkyLine has commercially-viable capabilities of reducing the time and complexity of collecting information, characterizing patterns, and accruing evidence and counter-evidence in a mission-oriented setting.\nSkyLine has the potential to identify novel human-machine interaction patterns for all-source or OSINT analysis, in addition to providing novel graph schemas for human-machine workflows.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.",
        "6": "Addition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: 1 2 3 4 5 6 7 8 9 10 11 12 13 17 18 19 20 21 22 23 24 25 26 List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: knowledge graphs, intelligence analysis, human-machine teaming, HMI, AI, provenance, tradecraft, information extraction Summary: VOL I - Proposal Certification 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 100% 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES 3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES YES 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, YES release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation:",
        "7": "13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO 16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n20% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES VOL I - Contact Information Principal Investigator Name: Dr.\nScott Friedman Phone: (314) 640-9077 Email: sfriedman@sift.net Address: 319 1st Ave North Suite 400, Minneapolis, MN 55401 - 1111 Corporate Official Name: Kara Stegeman Phone: (651) 399-1303 Email: kstegeman@sift.net Address: 319 1st Ave North Suite 400, Minneapolis, MN 55401 - 1111 Authorized Contract Negotiator Name: Kara Stegeman Phone: (651) 399-1303 Email: kstegeman@sift.net Address: 319 1st Ave North Suite 400, Minneapolis, MN 55401 - 1111 Form Generated on 11/05/2024 05:14:08 PM",
        "8": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 SKYLINE: Structured Knowledge Graphs with Integrity & Lineage 1 Identiﬁcation and Signiﬁcance of the Opportunity Analysts and operators in the U.S.\nmilitary and Intelligence Community (IC) must collaboratively attend to complex missions over time, information sources, collection disciplines, and modalities.\nAs Artiﬁcial Intelligence (AI) and machine learning (ML) gains acceptance, analysts also need innovative ways to com- municate with these machines with low ambiguity, high integrity, and high expressiveness, all while avoiding information overload and complying with directives for standards [1] and sourcing [2].\nKnowledge graphs (KGs) have been used for decades to visualize data—notably including cognitive maps [3] and analysis-oriented link diagrams [4, 5, 6, 7]—and they likewise support semantic representa- tions for machine-based reasoning [8], planning [9], and matching [10].\nKGs can support human-machine information interchange, provided (1) humans can use KGs to express and visualize complex mission con- cepts (§2.2), (2) machines can contribute in like fashion with accurate conﬁdence (§2.3), (3) machine con- tributions do not overload analysts (§2.4), and (4) the KG elements are linked to alternative hypotheses and traceable back to the foundational sources to support high rigor [11] and sensemaking [12] (§2.5).\nSIFT proposes to develop SKYLINE to facilitate high-integrity, low-ambiguity, human-machine KG- based interaction.\nAs shown in Figure 1, teams of humans will interact via SKYLINE to articulate mission context and objectives in a diagrammatic UI, with semantic underpinnings for interoperability with machine teammates.\nSKYLINE’s structural knowledge representation will include mission data and domain-general schemas for spatiotemporal qualiﬁers, provenance [13], and quality control (QC) for tradecraft (e.g., [14]) (§2.5).\nSKYLINE is informed by SIFT’s provenance-based intelligence analysis approach [14, 8] that was designed under AFRL SBIRs (§4.2), recognized as an Air Force SBIR Success Story, and transitioned to TS/SCI environments as a data model of DIA’s MARS program (§4.3) to replace MIDB.\nSIFT will leverage this recent work—including a graph store, data models, and UI components—to mitigate risk in Phase I.\nInteractive User Interface (Mission Content, Objectives, and Tradecraft Considerations) Objectives; Approvals; Hypotheses; Context; … Operator Collab.\nTeam Appraisals; Suggestions; Shared content Donovian Missile Program Capt.\nNorman Soro Wonsi Militia allegiance site-director testing-site-of Donovia alias expertise title readiness allegiance allegiance garrison-at 42nd Donovian Rifle Brigade Time Slider Donovigrad Base [Facility] serviced-at Q:Unit garrison-of serviced-at exercise-site location-of Authoritative Untrusted … Assessors Extractors Information Sources Agents & Algorithms considerations objectives candidate content Context Detail Slider Appraised Content Approval Feed Provenance & QC Knowledge Graph Figure 1: SKYLINE ﬂow: the operator and her teammates interact with a graphical UI of the KG, specifying context, hypotheses, and objectives; machine agents attend to objectives by processing diverse information sources and adding content with full provenance, for prioritized human approval.\nThe SKYLINE team brings relevant expertise and usable software in support of SKYLINE’s technical This proposal includes data that shall not be disclosed outside the Government and shall not be duplicated, used, or disclosed-in whole or in part-for any purpose other than to evaluate this proposal.\nIf, however, a contract is awarded to this proposer as a result of-or in connection with-the submission of this data, the Government shall have the right to duplicate, use, or disclose the data to the extent provided in the resulting contract.\nThis restriction does not limit the Government’s right to use information contained in this data if it is obtained from another source without restriction.\nThe data subject to this restriction are contained in pages 1-25.\n1 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "9": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 objectives.\nSIFT PI Dr.\nScott Friedman (§7.1) recently led the Project7 and GEMINI AFRL SBIR projects for high-integrity human-machine intelligence analysis (§4.2) with spatiotemporal and knowledge-graph interfaces [14, 8, 15, 7] advised in part by Air Combat Control (ACC) and the National Air and Space In- telligence Center (NASIC).\nHe led two technology acquisition projects to transition this knowledge graph technology to the Defense Intelligence Agency’s MARS program (§4.3), for all-source analysis of authorita- tive emerging TS/SCI data on JWICS/Dev.\nSIFT Co-PI Dr.\nDrisana Iverson (§7.2) is an AI/LLM specialist, having implemented graph-based interaction with LLMs for DARPA HABITUS and DARPA Civil Sanctu- ary.\nSIFT researcher Dr.\nMatthew McLure (§7.3) is an expert in graph- and pattern-matching (§2.3.1) [10] including in geospatial domains, and leads a DARPA Collaborative Knowledge Curation program (§4.5) for extracting, displaying, and revising knowledge graphs of mission data.\nSIFT brings expertise in knowledge graph analysis, human-machine interaction, analytic integrity, and knowledge-rich missions that combine authoritative and emerging data sources.\nWe expect to leverage technologies in these areas to make early strides and meaningful prototypes of our approach in Phase I.\nThe transition paths that SIFT has already established (§6.2, §4.3) will help ensure that SKYLINE technology reaches the hands of the analysts that need it.\n2 Phase I Technical Objectives Over the course of all SBIR phases SKYLINE will enable high-integrity, low-ambiguity knowledge graph interaction with full provenance in human-machine team intelligence analysis.\nMeeting that objective faces the following high-level technical challenges, expressed as research questions: ▶ (§2.2) How will SKYLINE allow expressive human-machine analysis using knowledge graphs?\nInformed by previous work, SKYLINE will display the domain-level content of knowledge graphs for human perusal and collaboration; however, SKYLINE will also allow analysts to di- agrammatically annotate (1) importance over existing entities and relations, (2) collection tasks on existing entities and relations, and (3) patterns of interest as key attributes or relations that are not yet known.\nSKYLINE will also display tradecraft factors—such as conﬂicts, gaps, risks, and alternatives—to improve the rigor of the analysis.\nWe describe this further in Section 2.2.\n▶ (§2.3) How will SKYLINE facilitate machine contributions to the mission KG?\nWhen backed by formal semantics, KGs can support machine reasoning, e.g., to support consistency- checking and information extraction from documents and semantic web resources.\nAdvised by SIFT’s work on all-source analytics for DIA’s MARS program (§4.3), we propose for SKY- LINE semantic elements to have falsiﬁable identiﬁers that point to remote sources, e.g., so a single military unit in the KG might refer to a single record in an authoritative data source like MIDB, and it may also refer to one or more alternative objects in imagery.\nIdentiﬁers, coreference-tracking, and strong semantics will facilitate machine coordination in SKYLINE, which we describe further in Section 2.3.\n▶ (§2.4) How can analysts approve machine inferences without incurring an information overload?\nAs data and analysis software increase in complexity, many inferences and knowledge graph ex- tensions may be possible, and these inferences risk overloading—or even distracting or misleading— the analyst.\nSKYLINE will include a priority queue that will compute a uniﬁed ranking by scoring each inference over the following dimensions: (1) scoring by mission-relevance using users’ importance annotations (see Section 2.2); (2) scoring by conﬁdence/likelihood using the output of ML models; and (3) scoring by analytic impact based on provenance traversal (see Section 2.5).\nWe describe this further in Section 2.4.\n2 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "10": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 ▶ (§2.5) How can humans and machines to contribute to a KG with transparency & integrity?\nIn addition to accurate judgments, the analysis process should help analysts derive meaning and understand the factors that impact analytic conﬁdence.\nThis is advised, in part, by integrity- focused IC directives [1, 2] and metrics of analytic rigor [11].\nWe discuss SIFT’s provenance- based solution to supporting sensemaking, integrity, and rigor in Section 2.5.\n▶ (§2.6) How will SIFT measure success in human-machine KG interaction?\nIn our R&D we must assess the soundness, relevance, expressiveness, interoperability, and efﬁ- ciency of our approach to assess progress and design trade-offs.\nWe describe relevant industry standard metrics and novel metrics for this R&D in Section 2.6.\n2.1 Relevant Work Informing the SKYLINE Approach SKYLINE is informed by several previous works in viewing, updating, and working with knowledge graphs (KGs).\nAlignment of KGs is essential, since multiple data sources may refer to entities differently, but these sources must be reconciled for a user to incorporate the sources.\nYan et al.\n[16] propose a KG alignment al- gorithm that outperforms several algorithms in the setting where the graphs are static, but, more importantly, leads to two fast algorithms to align dynamic (changing) knowledge graphs, which are relevant to the SKY- LINE use case, where both the environment and the users’ needs may be dynamic.\nAdditional approaches for dynamic KG alignment and completion include the user of LLMs [17].\nAdditionally, previous works have tested the correctness of automated KG updates through algorithmic graph transformations when applied to the public health domain [18].\nAdditionally, viewing KGs at the appropriate level of granularity is crucial in order to avoid, on the one hand, overwhelming a user with too much detail, and on the other hand, providing such a high-level view as to lack information.\nNechasky and Martin’s Interactive KG Browser [19] allows users to ﬁlter the connectivity of the graphs, and allows experts to hide different details that may be less relevant to users.\nVargas et al.’s RDF Explorer [20] addresses the issue that, in order to query KGs, we need to know how to formulate queries in the relevant query language, and how entities of interest are described within the graph, both of which may pose problems depending on a user’s expertise level.\nThey explore various methods that allow lay users to leverage information within KGs, such as keyword search, faceted browsing, query building, graph summarization, and visualization techniques.\nTheir tool emphasizes the importance of avoiding interactions with the graph that yield empty results, so the RDF Explorer allows users to visually build relevant queries.\nFurther, Ehrhart’s KG Explorer [21] adjusts based on both the domain that is covered by the KG and the ”persona”, or user proﬁle, of a user (e.g., novice, stakeholder, expert) while explaining the key needs of each type of user.\nSKYLINE is also informed by various approaches to gauge attention on different KG nodes.\nSpreading activation theory [22] provides a framework for semantic search between various concepts in a KG.\nThis can be applied to an analyst’s KG in order to view parts of the graph that may be important to them, given prox- imal nodes they’ve paid attention to before.\nSpreading activation models can also be helpful for information retrieval both in terms of associative feedback and relevance feedback [23], and can be useful in order to help with querying and keyword search when a user wants to actively search a KG [24].\n2.2 Expressive, Low-Ambiguity Communication in Knowledge Graphs Previous work on KG user interfaces (UIs) facilitate human understanding of causal relationships [3] or semantic relationships [20], including relational information extracted by machines [6, 7].\nPrevious work has also explored dynamic KG UIs that modulate the level of detail [19], e.g., for dynamic or rapid display 3 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "11": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 Mission Data is displayed, with identifiers that relate to records in (potentially many) data sources.\nTradecraft Considerations are [optionally] displayed to call out data conflicts, alternatives, and updates (e.g., to confidence or sourching).\nWonsi Militia Importance Markers express the relevance or centrality of a topic to the mission at hand.\nDonovian Missile Program Capt.\nNorman Soro alias expertise title readiness allegiance site-director testing-site-of Donovia allegiance garrison-at Donovigrad Base [Facility] allegiance serviced-at 42nd Donovian Rifle Brigade Q:Unit garrison-of serviced-at exercise-site location-of Context Detail Slider Time Slider Connections of Interest express an information collection objective.\nAttributes of Interest express an information collection objective for a given entity.\nSchemas help analysts express machine-readable data and tasks.\nPatterns of Interest express a target of information collection and analysis.\nFigure 2: SKYLINE’s expressive KG interface will allow human users to (1) inspect mission data and trade- craft considerations in an intuitive fashion, and (2) express importance and analytic tasks to ma- chine teammates in the same interface.\nof relevant information [16].\nSKYLINE is informed by these recent developments, and also brings novel expressivity and dynamics to KGs.\nAs illustrated in Figure 2, we propose to enhance the KG display to enrich the traditional plot of mission data with other annotations that use the mission data as a scaffold.\nTheses include the following: • Tradecraft Considerations are alerts or updates that impact the integrity or the direction of subse- quent analysis, such as the red conﬂict between the two mutually-inconsistent allegiance edges in Figure 2.\nTradecraft considerations may be recognized by consistency-checking software agents, or they could comprise alerts when new information is available, when a supporting source has been refuted (by traversing provenance, as we show in Section 2.5), or when a colleague has rated or ap- praised a hypothesis (see Figure 8).\n• Importance Markers are annotations that an analyst adds atop the mission data to indicate the cen- trality or priority of a topic or relationship for the mission-at-hand.\nThese will be used to prioritize SKYLINE’s feed of content for analyst approval (§2.4), and they could also be used to guide the attention of proactive machine information-collectors that integrate with SKYLINE.\n• Connections of Interest are annotated links between entities in the KG that are of interest for addi- tional information collection.\nFor instance, in Figure 2, the analyst expressed an interest in connecting “Capt.\nNormal Soro” to the “Donovian Missile Program.” We envision that these could be speciﬁed further, e.g., so the analyst can express collection disciplines of interest (e.g., COMINT, IMINT) or speciﬁc data sources of interest.\n• Attributes of Interest are ﬁeld-level interests for information collection, e.g., ﬁnding the “expertise” of the individual “Capt.\nNorman Soro.” Attributes could comprise any data ﬁeld that is not relational in nature.\n• Patterns of Interest express an interest in an unknown or hypothetical entity, e.g., Figure 2 expresses an interest in ﬁnding all units that are serviced at the “Donovigrad Base” facility.\nAs with the above annotations, these are useful for guiding machine teammates and prioritizing mission-relevance.\n• Two of the annotations use schemas (i.e., listings of attributes or relations) for specifying tasks.\nFor- mal schemas, such as those employed by MIDB, Wikidata, DBPedia, DICO, etc., improve the unifor- mity of data and ensure that tasks and objectives conform to a machine-readable, doctrinal semantics.\nWhen possible, SKYLINE will encourage users to use formal schemas rather than arbitrary textual relations, though the latter will also be available.\n4 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "12": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 The above expression strategies will improve SKYLINE’s responsiveness to use objectives as well as its ability to assess the relevance of new content to the mission-at-hand (§2.4).\nMoreover, we hypothesize that expressing the intelligence collection goals and tasks as shown in Figure 2 may also improve human-human collaboration and analysts’ situation awareness, which would comprise dependent variables for human sub- ject research in future phases.\nIn addition to the various annotations shown in Figure 2, we envision dynamic “sliders” for modulation: 1.\nThe horizontal Time Slider in Figure 2 will be a point or window of enabled time, fading out the content that has no evidence within the speciﬁed temporal window.\nFor instance, if the allegiance of the Brigade in Figure 2 was once “Donovia” and then it changed subsequently to “Wonsi Militia” at a later time, this may not be a true data conﬂict, since they are temporally disjoint.\nThe temporal slider will help bring these insights to light.\n2.\nThe vertical Context Detail Slider in Figure 2 will marshal additional connected nodes and rela- tions into the visible knowledge graph, prioritizing entities and connections adjacent to nodes with importance-markers.\nThe user will be able to “pin” these retrieved elements to their mission-level KG.\nLikewise, when they dial down the detail, the un-pinned contextual entities will vanish again.\nAs we describe later in Section 2.5’s discussion of provenance, we propose tracking conﬁdence, sen- sitivity, and foundational sources, so SKYLINE could also exploit these dimensions to display conﬁdence sliders (e.g., only showing elements with high analytic conﬁdence) and so-forth.\ndeep serial focus, domain expertise, creative inference, common sense translate interface actions into knowledge graphs & goals broad parallel processing, inductive inference, logical structure Pluggable Visual Displays Local tech.\nsensitivity [and 3 other SVIs] impact scenario resilience [view sources].\nIsrael country-of Mossad Iran program-of Mostafa Roshan [Iranian Scientist] deputy-director employed-by birthplace [0] title [2] nationality [1] ﬁrst name [2] last name [3] country-of supports Iranian Nuclear Program Natanz Nuclear Facility resource-of Iranian Atomic Energy Organization employed-by Q:Person advocate-of employed-by founder-of member-of opponent-of % No-POV [Census] vs.\nLifeline Infra.\n[SVI] Analyst 1.0 0.5 0.0 ] I V S [ .\na r f n I e n i l e f i L 0% 50% 25% % Tech Dependency [Census]: (Oxygen, home medical, nursing home ventilator, etc.) 75% 100% manipulate UI assign agents Diagrammatic UI Interface- Knowledge Adapter Autonomy Manager agriculture 12 Shaul Mofaz, former Chief of Staff of the Israeli Defense Forces, head of Kadima, and leader of the opposition in the Knesset, ( 117) has lashed out against what he describes as Netanyahu's \"dangerous and irresponsible\" policy ( 118) towards Iran.\nAnd Israeli President Shimon Peres ( 119), reflecting the concerns of many, said a few days ago that \"It is clear to us now that we cannot do this alone.\nIt is clear to us we need to work together with America.\" ( 120) That view, we are told, is widely shared within the Israeli defense and intelligence establishments.\nThe military people charged with conducting a preemptive strike on Iran are the most likely to resist starting something that they know they cannot finish on their own.\nThey are the ones who realise, despite the uninformed and wishful thinking of some civilians, that longrange air attacks on Iran are unlikely to have more than a marginal impact on its nuclear programme unless they are sustained ( 121).\nIsrael cannot sustain these attacks.\nOnly … intuitive visualization map relevant info to visual displays integrate agent output Pluggable Autonomy Info Retreival NLP Plan Recog.\nGraph-Match Image Proc.\n… External Info Sources Figure 3: Conceptual view of shared human-machine perception, developed under “Project7” AFRL 711 HPW/RHXM SBIRs (§4.2), persistently mapping between (a) analysts’ diverse displays and (b) machine knowledge graphs, marshaling information between teammates to communicate infer- ences and attention.\n2.3 Facilitating Machine Reasoning with KGs Semantically-grounded KGs have the advantage of supporting structured (i.e., graph-based, database-based, or symbolic) machine reasoning, and also depicting information intuitively for human users.\nWe refer to this as shared human-machine perception and we have developed this concept under AFRL SBIRs (§4.2), as shown in Figure 3.\nThis human-machine team framework allows autonomous machines to collaborate in concert with hu- mans, in the same workspace, with low ambiguity.\nAs exempliﬁed in Figure 3 (right side), we envision diverse autonomy integrating with the SKYLINE knowledge graph software, tasked by the user as described in Section 2.2.\nPlausible autonomous agents include: 5 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "13": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 • Information Retrievers that query structured data sources for items of interest using names, identi- ﬁers, and other properties, for ingestion into the SKYLINE graph store.\n• NLP / Information Extractors process retrieved unstructured data and extract relations and attributes of interest to the mission.\n• Plan Recognizers process raw observations to infer higher-level events, relations, and red-force tac- tics, techniques, and procedures (TTP) to advance the analysis.\n• Graph-Matchers use the central mission knowledge graph as a probe and then match it against a library of previous observations to retrieve useful precedents, e.g., for context and predictive analysis (see Section 2.3.1 for more on the ALIGN algorithm).\n• Image Processors and other media analytics extract and characterize objects and activities from feeds to advance the analysis.\nThe user’s task-based and importance-based annotations in the KG (§2.2) will help trigger and guide these autonomous agents, and SKYLINE will also provide an API for these agents to store their inferences with full provenance (§2.5).\nImportantly, these diverse software agents may generate a massive volume of results with varying accu- racy and source-reliability.\nPrioritizing these results for human approval and sensemaking is the responsi- bility of SKYLINE’s priority feed (described in Section 2.4).\nIn future SKYLINE phases, we envision using NLP that SIFT developed under DARPA programs (§4.4, §4.1, §4.5), and information extraction agents (e.g., from Wikidata and websites) that SIFT developed under SBIRs, to implement practical machine tasking via SKYLINE’s KG.\nDepending on the Phase I research in- terests of AFRL program management, SIFT could potentially demonstrate a full-loop human-machine KG interaction where (1) the human expresses an objective (§2.2), (2) a software agent executes a relevant task for the objective and stores its results with provenance (§2.5), (3) SKYLINE ranks the results for relevance (§2.4), and (4) the user approves it to extend the KG.\nSIFT will identify practical use-cases for incorporating semantic graph-matching in SKYLINE Phase I.\nFor instance, one important question analysts face when presented with new observations is “is this nor- mal?” Software agents can help answer this question with graph-matching over new and historical KGs, e.g., using our ALIGN algorithm.\n2.3.1 ALIGN: Comparative Analysis and Graph Abstraction SKYLINE key personnel Dr.\nMatthew McLure (§7.3) developed the ALIGN (Analogical Learning by Inte- grating Generalization and Near-misses) system for inductively matching, comparing, and abstracting struc- ture from knowledge graphs [10].\nAnalogical comparison (i.e., labeled graph-matching) underlies both of the core learning processes in ALIGN: (1) Comparing positive examples to negative examples to ﬁnd struc- turally similar pairs that reveal hypotheses about concept criteria—so called near-miss hypotheses—and (2) comparing positive examples to one another to cluster and merge them into structurally similar abstractions (or “prototypes”) that can then be used to reﬁne near-miss hypotheses.\nThe result of ALIGN is a small set of representative knowledge graphs for each concept in which the nodes of the graph have associated probabilities to tease apart characteristic structure from noise, and some nodes inferred as central to the concept.\nALIGN’s structured, probabilistic concept prototypes are highly interpretable and modiﬁable by human operators, and they can be converted into rules, patterns, and templates.\nWe have also used ALIGN for similarity-based retrieval: Given a graph (or subgraph) of interest, re- trieve similar examples or prototypes from ALIGN’s graph library.\nALIGN can then draw inferences from the retrieved graph into the graph-of-interest by matching the graphs and then projecting unmatched-but- connected nodes and edges from the previous graph into the graph of interst.\nOptimal graph matching is NP-complete, so ALIGN is built on an approximate matching algorithm 6 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "14": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 motivated by cognitive science [25] that uses a greedy heuristic to avoid large search spaces.\nALIGN’s approach is agnostic to the graph matching process used, provided that this process produces an injective mapping (one-to-one allowing leftovers) and a numeric similarity score that is sensitive to structure and semantics.\nALIGN has been used to learn spatial concepts from datasets that include sketched objects, geospatial concepts, and cause-and-effect concepts.\nIn SKYLINE, we will to apply ALIGN to more diverse knowl- edge graphs and subgraphs that mix spatial representations, authoritative Order-of-Battle relationships, and simulated raw intelligence data.\n2.4 Prioritized KG Approval Feeds to Conserve Attention High Relevance, Low Confidence: High Relevance, High Confidence: • Assimilate into base KG as a low-confidence addition • Add to analyst’s workspace approval feed • Assimilate into base KG as a high-confidence addition • Add to analyst’s workspace approval feed Low Relevance, Low Confidence: Low Relevance, High Confidence: • Assimilate into base KG as a low-confidence addition • Do not alert analyst • Assimilate into base KG as a high-confidence addition • Do not alert analyst Figure 4: SKYLINE will allow for updates to the base (background) KG, while prioritizing the most relevant updates for the analyst’s immediate review.\nSKYLINE will strike a balance between informing analysts of important updates while avoiding infor- mation overload.\nTo do so, we propose two distinct areas to update the KG: • Approval to the Base KG will involve updating the base KG.\nAs shown in Figure 4, the base KG may be updated to include sources with various levels of conﬁdence.\nHowever, addition to the background KG does not mean that an analyst necessarily needs to review every update.\nRather, their attention can be focused on updates that they have expressed interest in.\n• Approval to the Analyst’s Workspace will focus on bringing the highest-relevance updates to the analyst.\nAs shown in Figure 4, low-relevance updates can be assimilated without alerting the ana- lyst, but high-relevance updates can be displayed.\nAdditionally, high-relevance and low-conﬁdence updates may be ﬂagged for review.\nSKYLINE’s priority queue for approval to the analyst’s workspace will be based on the criteria of mission relevance and analytic impact.\nMission relevance is determined by the analyst’s importance annotations, as seen in Section 2.2.\nNodes that are highlighted as important by the analyst will be assigned the highest priority, and additional nodes will be assigned a priority score based on proximity to the annotated nodes, using algorithms based on spreading activation [22, 23, 24].\nAnalytic impact will be based on traversal through the provenance, as discussed in Section 2.5.\nIn doing so, priority will be given to nodes that have high conﬁdence.\nIn the background, SKYLINE will add updates to the base KG, but can also provide snapshots of the base KG if an analyst prefers to freeze the state of the KG.\nThis can provide the analyst an opportunity 7 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "15": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 to create a ﬁnalized intelligence product based on the state of the world at a given time, without creating inconsistencies as new updates are brought in.\nIn SKYLINE Phase I, we plan to explore tradeoffs between sharing updates of low quality and high relevance, and consider future HSR work in order to observe the level of feedback that is useful to an analyst without being misleading.\nThe balance between conﬁdence and relevance can be determined by observing the impact on metrics such as efﬁciency, F1, and other metrics discussed in Section 2.6.\n2.5 Supporting meaning-making, integrity, and rigor Machine analytics and raw intelligence data have become more complex in recent years, but the directives and standards for integrity [1, 2] and rigor [11] remain the same, and are arguably more important than ever.\nAlso, integrity aside, SKYLINE’s machine inferences and additions to the shared knowledge graph are only useful if analysts can understand the machine-generated conclusions and meaningfully assess their conﬁdence.\nTo this end, SKYLINE will include interactive user interfaces (UIs) for visualizing, inspecting, validat- ing, and comparing machine inferences.\nAs shown in the SKYLINE overview in Figure 1, SKYLINE’s users and agents will amend the KG, and these will then feed into these analyst-centric UIs.\nAs a start, we will incorporate the interpretation UIs developed for the AFRL Project7 SBIRs (§4.2) and in transition to DIA’s MARS program (§4.3).\nThese interfaces have been informed by demonstrations and evaluations with trade- craft experts in DIA, ACC, and NASIC, and were developed by SIFT’s Dr.\nMatthew McLure (§7.3) and Dr.\nScott Friedman (§7.1).\nWe have shown that these interfaces make inroads for analytic awareness and ICD compliance and improve explainability of complex analyses [14, 8].\nInteractive Provenance UI (Record of Object-Based Production and Sourcing) Interactive Mission-Level KG UI (Mission Content, Objectives, and Tradecraft Considerations) All KG Nodes & Edges have Provenance Underpinnings Donovian Missile Program Capt.\nNorman Soro allegiance testing-site-of Donovia site-director allegiance garrison-at Donovigrad Base [Facility] allegiance serviced-at 42nd Donovian Rifle Brigade Q:Unit Wonsi Militia Figure 5: Informed by SIFT’s provenance-analysis work under Project7, we propose for all of the mission- level data displayed in the user-facing UI (sketched at right) has full provenance underpinnings (screenshot at left).\nAlthough some inferences are represented as KG edges (e.g., the allegiance links), they are nodes with full lineage and sourcing in the underlying provenance graph (at left), which also has an interactive UI.\nOne of the primary meaning-making interfaces in Project7 (§4.2)—which was a prominent feature of our work on the MARS program (§4.3)—is the provenance interface.\nWe deﬁne provenance as the record 8 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "16": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 of production: how, when, why, and by-whom something was generated.\nTo understand the relationship between provenance data (i.e., the record of production) and mission data (i.e., the data in maps and user- facing link diagrams), see Figure 5: all of the data in the user-facing link diagram (e.g., the nodes, links, objectives, and conﬂicts) have corresponding data in the provenance record, which can also be viewed as a knowledge graph (this is a screenshot from Project7, where we created a simple SKYLINE vignette).\nThe data in the provenance record (left side of Figure 5) includes data records about geopolitical enti- ties (e.g., the ﬁctional “Donovia” and “Wonsi Militia”), military units (e.g., “42nd Donovian Riﬂe Bgd”), and hypotheses about them (e.g., the brigade’s allegiance is Donovia [top] or alternatively, Wonsi Militia [bottom]).\nThere’s also a “Hypothesis Conﬂict” between the two allegiance hypotheses, since (for instance) the unit cannot be allegiant to two disjoint organizations.\nThe magenta links trace these provenance un- derpinnings to the right, to the mission-level KG UI, where some of these elements are rendered as edges (e.g., the allegiance labels), and others are rendered as nodes (e.g., the units and countries).\nRegardless their visualization in a link diagram, every semantic element has a corresponding provenance record.\nNote that the provenance network in Figure 5 also contains information about production: Imagery Analysis and NLP Relation Extraction activities support the Wonsi Militia allegiance hypothesis, and a Conﬂict Detector agent has produced the hypothesis conﬂict.\nThe mission-level KG hides these elements, since the mission-level KG should help the user attend to the content of the analysis and not the process of the analysis.\nThat said, SKYLINE will include these provenance views for when the operator wishes to “drill down” and understand the rigor, sourcing, conﬁdence, diversity, reliability, and alternatives.\nWe describe how SKYLINE will help users exploit the provenance.\nFigure 6: Screenshot of Project7 displaying a provenance graph of a ﬁctional vignette representative of a SKYLINE analysis that integrates authoritative data sources (e.g., MIDB, upper left) with other emerging multi-INT data sources (e.g., a satellite feed and message intercepts, middle and lower left), supporting two conﬂicting hypotheses of a military unit’s allegiance.\n9 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "17": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 Retrieving and summarizing provenance.\nSuppose the operator wants to understand the conﬂict be- tween the two allegiance hypotheses shown in Figure 5 to assess whether this brigade is allegiant to either of the alternatives.\nSKYLINE will use Project7’s provenance traversal to start from the hypothesis-conﬂict- node, and trace back (i.e., leftward) through the provenance relations to the foundational sources and con- tributors.\nThe result is shown in the provenance graph shown in Figure 6, a screenshot from Project7.\nThe left sidebar of Figure 6 shows the contributing agents (machines and humans), sources (per ICD 206 [2]), information types (i.e., INTs, supporting ICD 203 [1]), classiﬁcations (S and TS are labeled S- TEST and TS-TEST to avoid ambiguity), and releasibility markings (supporting ICD 403).\nThe ﬂow graph shows that many records are pulled from MIDB (though this is a ﬁctional scenario), which has “S-TEST” classiﬁcation.\nA Satellite Feed (also S-TEST) supports satellite imagery of a base, and a human user “Alice Operator” has conducted an “Imagery Analysis” activity that supports one of the allegiance hypotheses.\nThat hypothesis is corroborated by an “NLP Relation Extraction” operation that was conducted by a machine, using an “Intercepted Message” from “Message Trafﬁc” (TS-TEST).\nTo the right, a “Conﬂict Detector” agent has generated a “Hypothesis Conﬂict.” The colors in Figure 6 indicate relative conﬁdence, computed by graph propagation when a node (i.e., record or judgment) has not been directly appraised for conﬁdence.\nConﬁdence propagates from sources (left) to conclusions (right) to facilitate conﬁdence judgments [1] and information validation [11], also help- ing analyze competing hypotheses [11].\nThis approach is enabled by provenance capture (i.e., all user interfaces and machine agents must cor- rectly record their provenance) and provenance visualization (i.e., we display the provenance to facilitate understanding).\nIntuitively, if we do not capture provenance correctly or completely, the visualization may be incorrect, incomplete, or misleading.\nWe use the W3C’s PROV ontology [26] and SIFT’s DIVE ontology [14] to track provenance and tradecraft factors (e.g., INT types and other considerations).\nWe propose to use this approach in SKYLINE.\nFigure 6 depicts a moderately simple all-source analysis that uses authoritative data (MIDB) to support a hypothesis and emerging data to support an alternative.\nThe timeline at the bottom of Figure 6 is also interactive, so we can assess the recency of the authoritative and emerging data.\nThis UI is designed to facilitate a “conversation” with the data, so the user can ask “what-if” questions, as we describe next.\nSensitivity analysis.\nFor various reasons, an analyst may want to—at least, temporarily—remove a source, contributor, assumption, or operation from their analysis and assess the impact.\nPer ICD 732, we may have acquired corrupt or misleading information, and we want to assess its impact; alternatively, we may want to see how conﬁdent we can be about a hypothesis if we remove a highly-classiﬁed source, for eventual release of the hypothesis to a non-U.S.\ncollaborator.\nFigure 7 illustrates the process of refutation: we have clicked the buttons for “Satellite Feed” and “TS- TEST” button in the left side-bar to disable these in our local view.\nBoth elements are shown with red strike-through, and the ﬂow-graph also depicts all TS-TEST elements (e.g., “Message Trafﬁc”) and the “Satellite Feed” as disabled, as well as all elements that necessarily rely on them.\nThis ultimately disables the allegiance hypothesis downstream, leaving only one remaining allegiance hypothesis, from MIDB.\nThis allows the user to understand the information necessity and dependency structure of complex human-machine analyses that support their mission data.\nImportantly, Project7 only uses this refutation strategy on the provenance graph, but SKYLINE will also allow users to refute sources, INT-types, etc., and see the real-time impact in their mission-based knowledge graph.\nThe USPTO recently allowed SIFT patent 16/948,297 for these provenance analyses funded under the Project7 AFRL SBIR, and Dr.\nScott Friedman and Dr.\nMatthew McLure have published papers about high- integrity, explainable AI using provenance [8, 9, 14].\n10 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "18": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 Figure 7: A ”what-if” sensitivity analysis: When the user refutes TS-TEST classiﬁed data from the critical thinking panel, it displays with a red strikeout and removes all elements that necessarily rely on TS-TEST data from the analysis.\nLikewise, refuting the Satellite Feed removes that source and all dependent data.\nThis removes all support for one of the allegiance hypotheses.\nConﬁdence of mission data.\nProvenance and lineage alone cannot accurately dictate how conﬁdent we should be of our mission data; human experts and domain-speciﬁc reasoners are much better sources of con- ﬁdence judgments.\nSIFT’s provenance approach uses Appraisals to represent the conﬁdence and quality judgments that any agent (human, machine, or organization) attributes to a data source or analytic judgment.\nOne such appraisal is shown in Figure 8: a human analyst “Bob Operator” ascribes low conﬁdence to the MIDB record about the brigade’s allegiance, commenting that it may be outdated.\nMultiple users or ma- chines can appraise a single element in the provenance, and appraisals are applied wherever the information is used, potentially across many scenarios.\nThe conﬁdence of each local element is propagated downstream (i.e., to the right) to estimate the conﬁdence of un-appraised elements.\nThis allows experts to weigh in on a single node or link, and their appraisal will have a potentially broad focus.\nIn addition to propagating forward (i.e., downstream, to the right) to A Report Card for mission data.\nspread conﬁdence, the provenance analysis traverses backward (i.e., upstream, to the left) from a hypothesis or conclusion of interest to identify foundational sources, supporting observations, contributors, assump- tions, and so-forth.\nIn IC doctrine, these upstream factors are critical for tradecraft [1] sourcing [2], and they help populate an intelligence product, e.g., to articulate conﬁdence.\nWe aggregate this information into a report card.\nFigure 9 depicts a report card for one of the allegiance hypotheses, including the estimated conﬁdence and INT support (top) and many other considerations below, including conﬁdence sensitivities, which lists the conﬁdence that would be lost if various elements were unilaterally removed from the analysis.\nThis shows us that—of the sources that support this hypothesis— much of the conﬁdence is drawn from the Intercepted Message.\nThis helps make sense of information sufﬁciency and information necessity, and we envision that elements of this report card will be available when inspecting nodes and links of SKYLINE’s mission-level KG UI.\n11 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "19": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 Figure 8: An appraisal by Bob Operator, ascribing low conﬁdence to an MIDB record, and commenting that it may be outdated.\nAppraisals may be shared across many analyses, and they impact the estimated conﬁdence in downstream conclusions.\nAnswering integrity questions of mission hypotheses.\nSKYLINE will use the interfaces shown above, in addition to others, to facilitate analyst sensemaking in complex data environments.\nIt will help answer the following questions for any piece of content in SKYLINE’s mission-level KG: • How diverse (and independent) is the support for this inference?: By traversing the provenance of inferences upstream, SKYLINE can identify sensors, reports, and collection disciplines that con- tributed to it, helping articulate the diversity, authority, sourcing, and corroboration of the conclusions [1, 2, 11].\n• What assumptions, risks, and information gaps does this inference rely on?: Humans and machines can make explicit assumptions about the world, and SKYLINE will identify these within the prove- nance and marshal them to the human analyst’s attention.\nUnsupported assumptions could be risks or information gaps, or if an assumption will occur in the future, it could be a prediction and support subsequent collection goals.\n• What impact has this (data source or inference) had on my analyses?: SKYLINE will trace forward through the provenance to identify all information that has been derived from the given element, in order to assess how central it is to the mission.\nThis is especially important for damage assessment (ICD 732) if a data source or record is later known to be deceptive or misleading.\n• What if this (inference or source) was absent or different?: SKYLINE will support counterfactual “what-if” questions (including sensitivity analyses) by both (1) displaying the result of disabling ele- ments, as shown in Figure 7, thereby creating a hypothetical situation in provenance without damaging the integrity of the world state.\n• How conﬁdent should I be of this inference?: Machines should not make ﬁnished-intelligence con- ﬁdence judgments, but as we show in Figure 9, we can bring upstream information (foundational sources, assumptions, etc.) to the analyst’s attention while they manipulate the interactive KG, to ensure they understand the processes of analysis that underpin the mission-level content.\n• What alternatives are there to this inference?: The mission-level schema, e.g., from data sources like MIDB or MARS, dictate that some ﬁelds may only have one value, and alternative values may be alternative hypotheses.\nOur example in Figure 5 and Figure 6 shows one such pair of alternatives (for allegiance), and SKYLINE can ﬂag these in the provenance (Figure 5, left) and display them in mission-level knowledge graphs (Figure 5, right).\nMany of the above sensemaking activities are diagrammatic “conversations” between the human and 12 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "20": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 Figure 9: The “report card” displaying factors that impact a hypothesis’ conﬁdence, including a sensitivity analysis that shows the estimated conﬁdence that is afforded by various sources, contributors, and collection disciplines.\nmachine, using the knowledge graph as a basis for shared human-machine perception of the intelligence analysis problem.\nSIFT will not need to make any improvements to the Project7 software under the SKY- LINE SBIR effort, but we can utilize the data store and some pre-existing UIs to boost our productivity and prototyping early in Phase I.\n2.6 Metrics for quality and success in interactive KGs We propose to use current industry standard metrics to measure the quality of SKYLINE’s machine inference, accuracy of priority rankings, and accuracy.\nWe will use these metrics throughout the SKYLINE SBIR effort, but we expect some metrics (e.g., for human-machine team analysis) not to appear until Phase II.\nFor each metric, we brieﬂy provide its purpose and, when practical, an equation.\nWe ﬁrst review metrics for machine inference.\nWe plan to use these metrics to compare different algo- rithms and strategies, helping illustrate trade-offs in the performance space.\n• Ground Truth: Labels from human experts describing the behaviors, actions, and intents that the machine should predict or retrieve, such that all others are either irrelevant or incorrect.\nThis is a type of data; it is not a metric, but it is used by the metrics below.\n• Precision: Fraction of positive machine predictions that are actually correct (i.e, in ground truth).\nThis is a measure of correctness when an inference is made by the machine.\n• Recall: Fraction of ground truth (i.e., expected) predictions that are predicted by the machine.\nThis is a measure of completeness or coverage of the machine inference capabilities.\n• F1 Score: The harmonic mean of precision p and recall r, to compactly report both values with a p+r .\nWe propose using F1 score to measure how well SKYLINE adds context single score: F1 = 2pr 13 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "21": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 via the Contextual Detail Slider (§2.2) and how well SKYLINE identiﬁes and labels tradecraft factors such as alternatives and sourcing alerts (§2.2, §2.5) in our evaluation.\n• Mean Average Precision (MAP): A ranking quality metric that considers the number of relevant recommendations (i.e., from a ground-truth) and their position in a machine-generated ranking.\nWe will use MAP to evaluate SKYLINE’s priority feed of relevant information (§2.4).\n• Efﬁciency: Since time pressures are a central consideration in the IC with massive volumes of infor- mation, we envision tracking efﬁciency of the system in multiple regards: (1) full inference duration measures machine duration to make all relevant inferences until its termination condition, (b) time to analytic milestone(s) measures time to reach key solutions in the analysis, potentially using heuris- tics as shortcuts, and (c) incremental utility measures the proportion of correct or mission-relevant machine inferences over time.\nWe will assess the efﬁciency of SKYLINE’s provenance-based detec- tion of tradecraft considerations in Phase I, but larger human-machine team efﬁciency metrics are important for later phases.\n• Expressiveness: Proportion of domain events, relations, goals, and tasks that are expressible in the knowledge graph.\nThis measures the ﬁt of the knowledge representation against the problem to be solved, allowing us to measure the ﬁt of the KG against the mission, over time.\nWe will assess expressiveness in Phase I.\n• Workload and Usability: Since the machine inference has to accommodate the needs and workﬂow of the user, we propose utilizing some existing instruments such as workload assessment using NASA’s TLX, Situation Awareness using SART or SAGAT, and/or system usability using SUS.\nWe will use these metrics in Phase II and beyond.\n• Accessibility and Compliance with Directives: Analytic tradecraft requires access to sources, assump- tions, sensitivity, risk, conﬂicts, corroboration, alternatives, and more [1, 2, 11].\nSIFT has measured this in the Project7 SBIR (§4.2) with (1) timed surveys of users’ ability to identify these factors within an analysis and (2) subjective scalar assessments of information accessibility and trust in machine teammates.\nMeasuring how well users characterize these tradecraft-relevant aspects of machine infer- ences will help us characterize how SKYLINE complements the analytic workﬂow.\nWe will use these metrics in Phase II and beyond.\n3 SKYLINE Phase I Work Plan (Non-Proprietary) Scope.\nThe SKYLINE Phase I SBIR effort will design, prototype, and demonstrate knowledge graph in- teraction in an all-source (i.e., Multi-INT) setting, with human and machine collaborators and full analytic provenance.\nWe plan to use a mix of off-the-shelf data, SIFT-simulated data, and data from SIFT-generated vignettes that SIFT used for DIA’s MARS program to demonstrate the integration of authoritative and emerg- ing data for all-source analyses.\nThe SKYLINE prototype we build in Phase I will focus on knowledge graph interaction, building on SIFT’s existing graph-based reasoning and IC tradecraft interface.\nIt will also leverage SIFT’s NLP information extraction capabilities for demonstrative purposes.\nSIFT will rigorously evaluate the prototype to ensure the feasibility of our approach and characterize trade-offs.\nThe evaluations in Phase I will occur near the end of the effort, focusing on the expressivity, provenance capture, contextual information access, and priority rankings.\nWe plan to engage prospective transition partners for brieﬁngs throughout the Phase I effort.\n3.0.1 Task Outline: Phase I (6 months).\nBelow we describe each task and corresponding milestones.\nFigure 10 shows the schedule with milestones indicated by black triangles.\n14 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "22": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 Requirements— SIFT will design the SKYLINE speciﬁcations for human-machine team analysis with in- teractive knowledge graphs.\nThe speciﬁcations will include user interface (UI) requirements and a taxonomy of user and machine KG interactions, e.g., manners in which the user can specify objectives for their ma- chine teammates.\nWe will also identify useful datasets—such as SIFT’s Unclassiﬁed vignettes for DIA’s MARS program, online message feeds, semantic web repositories like Wikidata1 and DBPedia2—and gen- erate synthetic data as needed to support the prototyping.\nSIFT will also incorporate datasets of interest from AFRL program management.\nThese datasets and data-sources will support autonomous SKYLINE agents that users can task with information-collection objectives via the knowledge graph UI.\nThe design of SKYLINE will comprise a signiﬁcant portion of the SKYLINE Phase I ﬁnal report.\nDesign of Algorithms/User Experience (UX)— SIFT will prototype the SKYLINE algorithms and user interactions, including a diverse set of user-to-machine directives (for collection, relevance) and tradecraft considerations (e.g., conﬂicts, alternative hypotheses, and elements with high or low conﬁdence).\nMile- stones: (1) KG UI produces a user interface (UI) display of semantic content in a knowledge graph, in- cluding semantic data and multiple types of user objectives (e.g., for relevance and collection tasks).\n(2) Priority Queue produces a prototype of the priority queue that displays ranked data that was extracted by machines—designed to avoid the inundation of new data—using the user’s relevance objectives (from the KG UI milestone) to ﬁlter and prioritize new data.\nPrototyping & Evaluation— SIFT will periodically evaluate SKYLINE’s human-machine interface and agent capabilities, using industry standard metrics for relevance-rankings and information retrieval as ap- propriate given the datasets and scenarios.\nSIFT will conduct demonstrations to gather formative feedback to guide the effort and advise the direction of a future SKYLINE Phase II effort.\nMilestones: (1) Prov Demo demonstrates SKYLINE’s provenance capabilities, with an early integration with Project7 (§4.2).\n(2) KG Demo demonstrates the KG UI—and potentially agent responsiveness to collection tasks—for AFRL program management and potential transition customers for formative feedback.\n(3) KG Eval conducts a formal evaluation of the Phase I approach using the metrics we’ve identiﬁed (see Section 2.6 for a listing) under different operating assumptions, method choices, and knowledge states in order to illustrate trade-offs.\nReporting & Administration— SIFT will manage the direction of the program, write interim and ﬁnal reports, and attend to research interests of AFRL program management.\nMilestones: (1) Monthly reports (see Deliverables); (2) Final report (see Deliverables).\nMilestone Schedule.\nThe SKYLINE Phase I schedule overlaps requirements, algorithm/UX design, and prototyping to allow us to inform design-work with early prototype feedback.\nThis is adjustable as desired by AFRL program management.\nMilestones are shown in the Figure 10 as black triangles in their respective tasks.\nWe include a proposed trip to visit AFRL program management within the milestone schedule and also in the deliverables.\nDeliverables.\nThe SKYLINE Phase I SBIR deliverables include: • Kickoff Meeting with AFRL program management within 30 days of contract to discuss the effort.\n• Monthly Progress Reports describing interim progress within each reporting period.\n• Interim Demonstration of the prototype in or around months 4-5.\n• Final Program Review Meeting with AFRL program management in the ﬁnal month of Phase I.\n• Final Report with SF-298 summarizing SKYLINE architecture, feasibility, lessons learned, trade- off analysis on the best technical development path, algorithm and method choice, data management 1https://www.wikidata.org/wiki/Wikidata:Main Page 2https://www.dbpedia.org/resources/ 15 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "23": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 1 2 3 4 5 6 Requirements ▲ Taxonomy Design of Algorithms/UX Prototyping & Eval Reporting & Admin ▲ Design Doc ▲ Prioritity Queue ▲ KG UI ▲ Prov Demo ▲ KG Demo ▲ KG Eval ▲ Final Report Trips ▲ Kickoff Figure 10: Monthly schedule for SKYLINE over the nine months of the effort.\nand software framework decision, and potential risk and negation strategy.\nIf desired, SIFT is also prepared to deliver a draft ﬁnal report for AFRL program management review.\nCo-harmful: Two entities are frequently co- mentioned as “harmful.” Preference: Advocacy is expressed toward one entity while opposition is simultaneously expressed toward another.\nEntities are stemmed, so all mentions of “civilians” are joined into “civilian.” Co-victimized: Two entities are frequently co-mentioned as “harmed.” Harm: One entity is often expressed as harmful when another is expressed as harmed.\nNote: This does not mean that there’s a direct harmful event from one to the other.\nFigure 11: Thematic knowledge graph screenshot from SIFT’s RADII tool for the DARPA INCAS program, with added call-outs.\nEach edge in the graph represents a listing of messages conforming to that theme (e.g., Russia harming Ukraine); clicking any displays the message feed for that theme.\n4 Related Work 4.1 RADII: NLP Tools for Inﬂuence Operations SIFT is developing RADII under the ongoing DARPA INCAS program (PoC: Dr.\nVictoria Romero, victo- ria.romero@darpa.mil), aimed at characterizing inﬂuence attempts over millions of online messages across platforms, languages, topics, and time.\nRADII is a micro-service architecture that includes a suite of con- tainerized NLP tools—for assessing themes, regard, emotions, moral framing, narratives, and stance—and a knowledge-graph UI for visualizing and exploring the results.\nFigure 11 shows a knowledge graph plot of RADII’s dyadic (i.e., pair-wise) themes, and Figure 12 shows a comparative sentiment density plot of two different topics over time.\nRADII is lead by SIFT’s Dr.\nChris Miller and Dr.\nScott Friedman (§7.1).\nSIFT’s RADII tools have transitioned to the U.S.\nDepartment of State (PoC: Aaron Holm, HolmAL@state.gov) for inclusion in their Northstar system that will roll out to over 190 mission stations next year.\nRADII is also 16 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "24": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 Density is altitude: “civilian” often advocated; “russia” often opposed.\nCollection gap.\nY-axis expresses opposition (neg) to advocacy (pos), where zero is neutral.\nX-axis is message publication timeline Figure 12: Timeline density plot from SIFT’s RADII tool for the DARPA INCAS program, with added call-outs.\nThis interactive density map compares messaging about Russia (in blue) vs.\ncivilians, women, and children (in red).\nThe x-axis is time, the y-axis is sentiment (positive and negative), and the altitude bands are density.\nCivilians are generally advocated, whereas Russia has peaks of opposition, especially near their invasion of Ukraine.\nin active or near-term testing with three separate groups in the U.S.\nmilitary, with potential for transition into a program of record.\n⇒ Transition Potential Advances in SKYLINE knowledge graph techniques could potentially be inte- grated into RADII along our existing technology transition paths, impacting how information opera- tions (IO) analysts interact with machine teammates to specify IO objectives to machines and consume complex NLP results.\n4.2 Project7, SIFT’s Human-Machine Analysis Workspace SIFT initially developed Project7 under SBIR efforts funded by AFRL 711 HPW (PoC: Dr.\nKellie Turner, kellie.turner@us.af.mil).\nProject7’s shared human-machine perception, allows both humans and machines to consume, assess, and add information in modalities that they natively understand, to maximize the ﬂexi- bility, transparency, and trust of human-machine team intelligence analysis.\nFigure 3 shows how Project7 achieves shared human-machine perception by mapping the content of analysts’ displays—including maps, link diagrams, reports, tables, and provenance graphs—to semantic knowledge graph elements, supporting expressive, unambiguous communication and tasking.\nFigure 13 shows three such UIs—two geospatial and one tabular—that grounds semantic elements and user-provided sketches and annotations in machine-readable knowledge graphs.\nOne of the most valuable aspects of Project7 for military transition is the tracking of human-machine provenance for object-based production: whenever a machine or human produces an inference or hypothesis, Project7 associates the sources that were used, the inference that was produced, and the types of operations that occurred.\nProject7 thereby helps maintain a view of dependency, lineage, pedigree, sourcing, and reliability of information, facilitating compliance with Intelligence Community Directives (ICDs) [1, 2].\nProject7 has been deployed on JWICS/Dev for processing TS/SCI mission data as part of the MARS program (§4.3), on RTX BBN servers, and on SIFT’s internal cloud.\nIt uses horizontally-scalable open- source data services: JanusGraph or Neo4j as its graph database, Elasticsearch as its document indexer, and 17 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "25": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 Cassandra as its broad column data store.\n⇒ Risk Mitigation We propose for SKYLINE to use Project7 as its knowledge graph and user interface solution, allowing the team to attend to the research challenges rather than infrastructure questions early in Phase I.\nThis will also support SKYLINE’s technology transition to our existing customers.\nThroughout the Project7 SBIR contracts, SIFT conducted brieﬁngs and demonstrations with AFRL 711 HPW/RHXM, NASIC, ACC, and DIA.\nThe proposed SKYLINE PI Dr.\nScott Friedman (§7.1) was PI on the GEMINI and Project7 SBIR efforts.\nA.\nRetrieving and browsing geospatial data to integrate into a project, each glyph corresponding to knowledge graph elements.\nB.\nMachine wavefront analysis integrating terrain data, mission data, and user sketches.\nC.\nComparative analysis of knowledge graph elements.\nFigure 13: Project7 UIs: (a) browsing geospatial data about Caracas, including complex geometries, (b) sketch-based human-machine communication supporting machine wavefront analysis, and (c) comparative analysis of North Korean missiles automatically collected from Wikidata.\n4.3 DIA MARS (Machine-Assisted Analytic Rapid-Repository System) Program Building on success with the SBIR program, SIFT has won three programs from DIA to explore and migrate provenance advances to their MARS program that will transform MIDB (Modernized Integrated Database) with innovative human-machine analytics.\nThe MARS program acquires technology to integrate novel approaches such as Project7’s data model into all-source analysis, primarily tracking Order of Battle un- der many dimensions of uncertainty.\nAll three of our MARS programs were lead by the SKYLINE PI Dr.\nScott Friedman (§7.1) and teamed with RTX BBN.\nMARS projects included: COMET (2019-2020, PoC John T Dillaplain, John.Dillaplain@dodiis.mil), an application of provenance technology on Unclassiﬁed data to demonstrate provenance-tracking many units over space and time with high-integrity; COLONY (2021-2023, PoC Kathleen Todd, Kathleen.Todd2@dodiis.mil), which used provenance-based analyses to answer questions of conﬁdence, data quality, counterfactuals, and distribution and release; and CONSUL (2021-2024, PoC Edward Clifton, Edward.Clifton@dodiis.mil), which tracked large-scale Order of Battle assessments, including the allegiance, equipment type, operational status, and locations of diverse assets, under uncertainty.\nAll of these projects transitioned provenance-tracking approaches from Project7 and RADII, and both COLONY and CONSUL were deployed to JWICS/Dev to process TS/SCI mission data.\nSKYLINE will leverage aspects of SIFT’s MARS efforts, such as (1)provenance-tracking for high- integrity analyses and (2) containerization and security adjudication for military software transition.\nWe plan to inform DIA customers about SKYLINE advances to assess transition opportunities for human-machine teaming.\n⇒ Transition Potential SKYLINE knowledge graph technology could improve all-source analysis work- ﬂows that consume authoritative military data, e.g., from MIDB/MARS.\nSince SIFT helped design and demonstrate aspects of the MARS data model, SKYLINE could be demonstrated to the MARS program ofﬁce as an intuitive way for military users to visualize and consume authoritative data.\n18 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "26": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 LLM Input: Prompt & KG (FCM) LLM Output: Answer & Subgraph {\"answerchoice\": 3, \"explanation\": \"The largest driver of internal unrest in Zamfara State, Nigeria is likely to be related to food security.\", \"relevant_subgraph\": [ {‘src': 'fuel price', 'target': 'food security’, ‘w': -1.0}, {‘src': 'banditry', 'target': 'food security’, ‘w': -1.0}, {‘src': 'food security', 'target': 'cost of rice’, ‘w': -0.5}, …} Question: What is the largest driver of internal unrest in Zamfara State, Nigeria?\nANSWER CHOICES: 1.\nIDPs and refugees/other internal migration 2.\nEconomic stability 3.\nFood security 4.\nSome other reason not specified here.\nt x e T t u p t u O h p a r G t u p t u O t x e T t u p n I h p a r G t u p n I Figure 14: A dual-view of the input (left) and output (right) of a LLM query that includes both unstructured text and structured data (i.e., knowledge graph) in both its input and its output.\nThis allows the LLM to use structured knowledge for context (e.g., a large causal graph, at left), and also con- tribute structured knowledge in its output (e.g., the subgraph that the LLM identiﬁes as relevant to the problem-at-hand, at right).\n4.4 DARPA HABITUS: Approaches for Structured Knowledge I/O for LLMs Dr.\nScott Friedman (§7.1) and Dr.\nDrisana Iverson (§7.2) lead SIFT’s project for DARPA HABITUS (PoC: William Corvey), subcontracted by TwoSix Technologies for NLP and knowledge graph approaches.\nSIFT’s HABITUS technology processes diverse datasets—ranging from Nigerian interviews about maternal and child health to Indonesian news articles about China’s Belt and Road Initiative (BRI)—to extract fuzzy cognitive map (FCM) [3] knowledge graphs describing cause-and-effect and local beliefs.\nSIFT’s approach uses LLMs to extract the structured knowledge graphs from news articles, social media, academic journals, and ethnographic interview transcripts.\nMore notably, Dr.\nDrisana Iverson devised an approach for mixed structured-and-unstructured interac- tion with LLMs, as shown in Figure 14.\nThis allows us to read knowledge graphs into LLMs as context for queries and inference, and then have LLMs respond with structured knowledge outputs, e.g., to express additions, revisions, deletions, or relevant subgraphs of the knowledge graph.\nThe knowledge graph is de- terministically tokenized in the input, and then can be read out with constrained decoding, to ensure that the graph is speciﬁed with proper syntax and in the proper schema (i.e., only using the allowed nodes and edges).\nThis is an important step in developing machine teammates to contribute to KG-based analyses.\n4.5 CASCADE: Knowledge Graphs for DARPA Collaborative Knowledge Curation (CKC) Dr.\nMatthew McLure (§7.3) leads SIFT’s CASCADE project (DARPA I2O: Collaborative Knowledge Cu- ration) that processes and consolidates a corpus of documents covering a domain of interest into a knowl- edge graph.\nCASCADE extracts and analyzes the latent structural similarities of documents’ knowledge graphs, using a domain-speciﬁc graph schema for describing cases at multiple layers of granularity, clus- tering and indexing the documents using KG subgraphs.\nCASCADE empowers domain users to rapidly 19 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "27": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 Figure 15: Screenshot of a knowledge graph in SIFT’s CASCADE project for DARPA CKC.\nobserve the landscape of a new domain in either focused or exploratory use-cases.\nCASCADE incorporate recent advancements from ALIGN (§2.3.1) [10] and GraphRAG [27]—including hierarchical summarization and entity summaries—to generate a knowledge graph that is more expressive, concise and parsimonious.\nCASCADE avoids GraphRAG’s reliance on domain-tailored prompts to incorporate domain-speciﬁc repre- sentations using comparative analysis (§2.3.1) [10] across cases to converge on a domain-relevant schema.\nFigure 16: PRIMROSE takes unordered reports of events (left) to infer benign and adversarial plans (center) and populate network analysis diagrams of benign and adversarial behavior (right).\n4.6 PRIMROSE: Plan Recognition for Intelligence Analysis PRIMROSE (Figure 16) was a SIFT Phase I SBIR for the Defense Threat Reduction Agency, managed by Mr.\nWilliam Young (william.t.young@leidos.com) and Dr.\nDonald Jones (donald.r.jones284.civ@mail.mil), led by SIFT’s Dr.\nRobert Goldman and Dr.\nScott Friedman.\nPRIMROSE applies probabilistic plan recognition, augmented by temporal, analogical, and provenance reasoning, to the challenge of network analysis for the intelligence community.\nIn Phase I, PRIMROSE processed activity reports to (1) extract key entities (agents, equipment, locations, etc.), (2) use plan recognition to infer high-level goals and predict unobserved actions, (3) infer roles and relationships from observed and predicted behaviors, and (4) populate network analysis graphs [15].\nDr.\nScott Friedman (§7.1) developed probabilistic KG-based inference for PRIMROSE, and PRIMROSE uses SIFT’s Project7 as a knowledge management and user interaction platform, which provides 20 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "28": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 evidence that Project7 can be leveraged to the same end in the SKYLINE effort.\n5 Relationship with Future Research and Development If the SKYLINE Phase I effort is successful, it will produce a design and prototype that will inform and mitigate the technical risk of a focused Phase II implementation effort.\nIn its entirety, future phases of SKYLINE could produce human-machine teaming paradigms that are facilitated by knowledge graphs, and augment U.S.\nanalysts’ reach and effectiveness across missions.\nSKYLINE will also improve SIFT’s human-machine analysis technology (i.e., improving the breadth and depth of machine analysis capabilities) and also improve SIFT’s machine inference technology (i.e., improving its interpretability and predictive capability).\nSince SIFT brings many existing components to SKYLINE Phase I—including a knowledge graph analytic workspace (§4.2), other knowledge graph use- cases (§4.1, §4.6), and security-adjuticated containers for eventual classiﬁed deployments (§4.3)—we expect to be able to focus our Phase I effort on the principle technical challenges and the research interests of AFRL program management and transition partners.\nThe SIFT PI for SKYLINE is cleared TS/SCI, and SIFT has additional cleared personnel at this level.\nSIFT’s facilities are cleared at TS level.\nWe do not anticipate additional clearances for the SKYLINE effort, and all data proposed for use in Phase I is Unclassiﬁed.\nSIFT’s CAGE code is 1NHZ1, and SIFT’s Facilities Security Ofﬁcer may be reached at fso@sift.net.\n6 Commercialization Strategy SIFT envisions dual-use technology transfer of SKYLINE to analysts in both military and industry.\nWe describe IC and cloud technology considerations (§6.1), the envisioned SKYLINE dual customer base (§6.2) and then we describe our commercialization and market entry plan for rolling out SKYLINE technology to military and industrial organizations, within and beyond the SKYLINE SBIR effort (§6.3).\n6.1 Commercialization: Supporting Technology Through brieﬁngs and R&D efforts with the U.S.\nIntelligence Community (IC), SIFT understands the technology transition priorities, including horizontal and vertical scalability, cloud support, preference for actively-supported open-source software, and security considerations for deploying containerized software to JWICS servers.\nConsequently, the existing software that SIFT brings for the SKYLINE effort as part of the Project7 package—including JanusGraph/Neo4j graph stores, Cassandra column store, Elasticsearch in- dexer, NodeJS UI servers, and Python-based analytics—have undergone DoD security adjudication and are compatible with Government cloud infrastructure.\nWe have held tutorials for technologists in Raytheon/RTX, Lockheed Martin, and personnel in the DoD/IC for running SIFT’s tools, and have already removed obsta- cles for deployment.\n6.2 Commercialization: Customer Base IC analysts face volumes of diverse intelligence data—including authoritative- Military customer base.\nbut-dated information, emerging-but-raw information with uncertain pedigree, and intermediate intelligence from collaborators—and tremendous time pressures to solve complex intelligence problems, all while ad- hering to tradecraft standards.\nAs described throughout this proposal, SKYLINE will facilitate their mission 21 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "29": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 by providing interactive mission-level KG (and spatiotemporal) displays that (1) visually coalesce informa- tion into [alternative] hypotheses, (2) help operators express objectives and tasks, and (3) track and visualize analytic provenance to explain tradecraft factors.\nIn the MARS technology acquisition program (§4.3), SKYLINE PI Dr.\nScott Friedman briefed DIA ana- lysts and tradecraft experts on a biweekly basis for three years, and under the AFRL Project7 SBIRs (§4.2), he briefed Air Combat Control (ACC) and National Air and Space Intelligence Center (NASIC) person- nel semiannually for four years.\nThese military customer engagements provided SIFT with feedback and insights for understanding agency-speciﬁc analytic tradecraft and improving the value of our analysis tech- nology, while introducing the customers to new technology possibilities.\nConsequently, SKYLINE addresses real analytic standards, real metrics of rigor, and real data.\nCorporate and law enforcement customer base.\nSKYLINE offers the ability to collect, organize, and visualize hypotheses—such as threats and indicators—in structured data, providing commercial customers the following abilities: 1.\nAssess and forecast insider threat by automatically processing ﬁnancial events, security-relevant events, and communications with known bad actors.\n2.\nAssess patterns of life of criminal elements and assemble data collected from metropolitan sources into a common operating picture.\nThe SKYLINE effort will not speciﬁcally improve NLP capabilities and source-speciﬁc analysis capabil- ities, but it provides human-machine interaction patterns where AI-based agents can “plug into” the analysis and ﬁeld SKYLINE-speciﬁed tasking.\nIn addition to threat intelligence, competitive intelligence tools—including AI and information collec- tion tools to gain insights about competitor behavior—reached USD $37.6 Million in 2019 and is estimated to Reach USD $82 Million by 2027.3 SKYLINE’s ability to transform observations into interpretable, ac- tionable inferences of competitors’ intentions and goals will also generalize from military actions into the domains of logistics and market analysis.\n6.3 Commercialization: Market Entry Plan SIFT will prioritize technology transfer to military customers, leveraging our previous technology transfer relationships (§4.3).\nWe will also assess transition of SKYLINE to users in ACC and NASIC.\nWe believe that ACC and NASIC transition will be consistent with our work with MARS, since MARS (MIDB’s re- placement) will be utilized by many IC agencies.\nToward this end, we would appreciate AFRL program management facilitating engagements with ACC and NASIC within Phase I and throughout Phase II, as the program progresses.\nSIFT will use successful results from Phase II to attract additional transition partners, such as RTX, Northrup Grumman, and Lockheed Martin, all of which SIFT has partnered with in the past, to explore technology licensing and collaborative R&D.\nWhile SIFT pursues technology transition, we will purse patents on SKYLINE technology, building on our recently-allowed Project7 AFRL SBIR patent 16/948,297 for provenance-guided analytics to patent the proposed SKYLINE approach to provenance-backed situational knowledge graphs.\nWe will pursue a provisional patent early in Phase I and then a full patent before the start of a prospective Phase II SBIR effort.\nThese patents will support technology licensing, which will also attract venture capitalists and contribute to commercialization potential, while allowing the U.S.\nGovernment to utilize the technology.\n3https://www.globenewswire.com/news-release/2021/10/11/2311529/0/en/Competitive-Intelligence-Tools-Market-to-Develop- Fundamentally-Growing-Popularity-of-AI-powered-Competitive-Tools-to-Foster-Growth-states-Fortune-Business-Insights.html 22 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "30": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 Follow-On R&D Contracts Integrator upfront license fees Commercial Royalties Table 1: Summary of Financial Projections 2027 $500,000 $500,000 $50,000 2026 $250,000 $500,000 $- 2028 $500,000 $500,000 $500,000 2029 $750,000 $- $12,500,000 2030 $750,000 $- $20,500,000 Success in the DoD market will allow us to attract venture capitalists to market our software as an industrial threat- and competitor-analysis tool, as described above.\nThe rapid growth in the market over the next ﬁve years makes the adoption of SKYLINE technology much more likely as competitors look for new technology to distinguish their product.\nSIFT engaged Brimacomb & Associates (www.brimacomb.com) and RTI, ﬁrms that aid startups to ob- tain venture capital funding, to develop SIFT’s commercialization strategy and provide us realistic estimates on revenue for new products.\nTable 1 shows our ﬁnancial projections for SKYLINE based on our discussions with these groups.\nTable 1 assumes an additional $750K in funding beyond SKYLINE Phase II.\nThe funding will either come from further DoD contracts with SIFT teamed with a large integrator, or internal integrator funds, which we have received in the past from Lockheed Martin.\nSIFT has a history of leveraging SBIR projects to seed additional R&D contracts from government or commercial partners, which we also account for in Table 1, increasing over time as SKYLINE improves SIFT’s intelligence analysis and human-machine teaming portfolio.\n7 Key Personnel (All personnel are U.S.\ncitizens) 7.1 Dr.\nScott Friedman, SIFT Research Fellow, SKYLINE PI • Ph.D., Computer Science, Northwestern University, 2012.\n• B.S.\n/ M.S., Computer Science, Washington University in St.\nLouis, 2003 / 2005.\nDr.\nFriedman is a Research Fellow at SIFT specializing in AI, Machine Learning, and Cognitive Science with over 15 years of experience in applied AI R&D.\nHe has authored over 70 publications and book chapters in AI/ML, human-machine team analysis, cognitive science, and cybersecurity, and has authored three SBIR- funded patents.\nHis research interests include NLP [28, 29, 30], human-machine collaborative analysis [7, 15], provenance [14, 8], graph and pattern-matching [10], and automated planning and plan recognition [9, 15].\nHe is a reviewer and program committee for AI Journal, AAAI, EMNLP, NeurIPS, CogSci, Advances in Cognitive Systems, and Informatica, and he chaired the 2015 Workshop on Qualitative Reasoning.\nHe has delivered invited talks for NATO’s Human Factors and Medicine panel (RTO-HFM 330), the DoD Human Factors Technology Advisory Group, University of Minnesota, and University of Florida.\nHe is presently SIFT’s PI on DARPA HABITUS, Co-PI on DARPA INCAS, and recently PI on SIFT’s Project7 SBIR efforts (§4.2) funded by AFRL, resulting in an AFRL SBIR Success Story at the 2021 Human Systems COI Annual Meeting.\nHe was also PI on two successful technology transition programs that tran- sitioned Project7 to JWICS/Dev mission environments under DIA’s MARS technology acquisition program (§4.3).\nHe previously led NLP efforts for DARPA Understanding Group Bias, DARPA Big Mechanism, and DARPA CWC projects.\nBefore joining SIFT in 2012, he received university graduate fellowships, in- cluding a Cognitive Science Advanced Graduate Research Fellowship to support his dissertation research on large-scale belief revision and knowledge representation in scientiﬁc domains.\nDr.\nFriedman holds a TS/SCI clearance.\nA complete list of publications is listed on his website,4 but some relevant publications include: 4http://sites.google.com/site/scottfriedmanresearch 23 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "31": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 • S.\nE.\nFriedman, J.\nRye, M.\nMcLure, H.\nC.\nWauck, P.\nPatel, R.\nWheelock, M.\nA.\nValovage, S.\nJohnston, and C.\nMiller.\n(2021).\nProvenance as a substrate for human sensemaking and explanation of machine collaborators.\nIEEE SMC.\n1014-–1019.\n• S.\nFriedman, M.\nBurstein, D.\nMcDonald, R.\nRosewall, and J.\nBenton.\n(2016).\nStrider: Toward an AI collaborator for intelligence analysis.\nIJCAI Cognitive Computation Workshop.\n• S.\nE.\nFriedman, R.\nP.\nGoldman, R.\nG.\nFreedman, U.\nKuter, C.\nGeib, and J.\nRye.\n(2020).\nProvenance-based assessment of plans in context.\nICAPS Workshop on Explainable AI Planning.\n• R.\nP.\nGoldman, S.\nE.\nFriedman, and J.\nRye.\n(2018).\nPlan recognition for network analysis: preliminary report.\nAAAI Workshop on Plan, Activity, and Intent Recognition, Munich, Germany, pp.\n8–14.\n• M.\nD.\nMcLure, S.\nE.\nFriedman, and K.\nD.\nForbus.\n(2015).\nExtending analogical generalization with near-misses.\nProceed- ings of AAAI.\npp.565– 571.\n• S.\nE.\nFriedman, J.\nRye, D.\nLa Vergne, D.\nThomsen, M.\nAllen, and K.\nTunis, (2020).\nProvenance-based interpretation of multi-agent information analysis.\nProceedings of the 12th USENIX Conference on Theory and Practice of Provenance.\n7.2 Dr.\nDrisana Iverson (Mosaphir), SKYLINE Autonomy Lead • Ph.D., Mathematics, University of Minnesota, 2022 • B.A., Applied Mathematics, Harvard University, 2017 Dr.\nDrisana Iverson is a Researcher at SIFT specializing in AI, Machine Learning, and modeling.\nHer re- search interests include NLP, applications of LLMs/image generation models, optimization, and veriﬁcation of mathematical model properties.\nShe is presently SIFT’s PI on Phase II of an annotation/data collection project with JIGSAW, and recently SIFT’s PI on DARPA Civil Sanctuary, where she contributed to the cre- ation of a user interface and plugin for online forum moderation and human subjects research to evaluate the effectiveness of moderation strategies.\nShe has also contributed NLP efforts to DARPA HABITUS, which included automated reasoning over knowledge graphs, and has contributed both to SIFT’s SMT solver-based tools and design of a UI for scientiﬁc stakeholders in DARPA ASKEM.\nMore information is listed on her SIFT staff website.5 7.3 Dr.\nMatthew McLure, SKYLINE Knowledge Graph Learning Lead • Ph.D., Artiﬁcial Intelligence, Northwestern University, 2019.\n• B.S., Computer Engineering, Pennsylvania State University, 2009.\nDr.\nMatthew McLure is a Research Scientist at SIFT with over 10 years of experience in Artiﬁcial In- telligence, primarily graph-based learning and compression [10, 31], novelty detection [32], and qualitative spatial representations and reasoning [33, 34].\nHe completed his Ph.D.\nin Artiﬁcial Intelligence from North- western University, where he was a member of the Qualitative Reasoning Group.\nHis thesis work, funded by AFOSR, developed an AI system that learned to recognize sketched objects given few training examples using analogical learning and hierarchical spatial processing, and even sketch novel instances of learned concepts using constraint satisfaction based on spring systems.\nHe has served as a reviewer and program committee member CogSci and Advances in Cognitive Systems.\nAt SIFT, Dr.\nMcLure is PI on the CASCADE project for DARPA (§4.5), he leads hypothesis-based reasoning R&D for DARPA’s ShELL project, and he led geospatial and network analyses for SIFT’s DIA MARS programs (§4.3), where he has also helped develop the user interface.\nDr.\nMcLure is also a contrib- utor to DARPA’s SAIL-ON where his work has produced new domain-general novelty detection methods, and he has contributed to DARPA’s HABITUS and INCAS projects.\n8 Foreign Citizens This project involves no foreign citizens or dual citizenship holders.\n5https://www.sift.net/staff/drisana-iverson 24 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "32": "SIFT 9 Facilities SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 SIFT will conduct the work at SIFT’s facility in Minneapolis, Minnesota, which holds a TS facility clear- ance.\nSIFT maintains a leading-edge computer network—including an internal cloud with Kubernetes sup- port, multiple GPU servers, and web services support—providing the requisite development environment for SKYLINE and other applications, from AI to conventional software engineering environments.\nSIFT’s facilities meet all applicable federal, state, and local government regulations, including all environmental laws and regulations.\nWe will not acquire additional equipment under this effort.\n10 Subcontractors/Consultants No consultants will be used on SKYLINE.\n11 Prior, Current, or Pending Support No prior, current, or pending support for proposed work.\nReferences [1] Director of National Intelligence, “Intelligence community directive 203: Analytic standards,” January 2015.\n[2] Director of National Intelligence, “Intelligence community directive 206: Sourcing requirements for disseminated analytic products,” January 2015.\n[3] S.\nA.\nGray, E.\nZanre, and S.\nR.\nGray, “Fuzzy cognitive maps as representations of mental models and group beliefs,” in Fuzzy cognitive maps for applied sciences and engineering: From fundamentals to extensions and learning algorithms, pp.\n29–48, Springer, 2013.\n[4] CIA, “Structured analytic techniques for improving intelligence analysis,” CIA Center for the Study of Intelligence, 2009.\n[5] R.\nJ.\nHeuer, Psychology of intelligence analysis.\nLulu.com, 1999.\n[6] E.\nBudlong, C.\nPine, M.\nZappavigna, J.\nHomer, C.\nProefrock, J.\nGucwa, M.\nCrystal, and R.\nWeischedel, “Interactive informa- tion extraction and navigation to enable effective link analysis and visualization of unstructured text,” in Proceedings of the AAAI Conference on Artiﬁcial Intelligence, vol.\n27, pp.\n1493–1500, 2013.\n[7] S.\nFriedman, M.\nBurstein, D.\nMcDonald, R.\nRosewall, and J.\nBenton, “Strider: Toward an ai collaborator for intelligence analysis,” in Proceedings of the IJCAI Cognitive Computation Workshop, 2016.\n[8] S.\nE.\nFriedman, J.\nRye, M.\nMcLure, H.\nC.\nWauck, P.\nPatel, R.\nWheelock, M.\nA.\nValovage, S.\nJohnston, and C.\nMiller, “Provenance as a substrate for human sensemaking and explanation of machine collaborators,” in 2021 IEEE International Conference on Systems, Man, and Cybernetics (SMC), pp.\n1014–1019, IEEE, 2021.\n[9] S.\nE.\nFriedman, R.\nP.\nGoldman, R.\nG.\nFreedman, U.\nKuter, C.\nGeib, and J.\nRye, “Provenance-based assessment of plans in context,” ICAPS Workshop on Explainable AI Planning, 2020.\n[10] M.\nD.\nMcLure, S.\nE.\nFriedman, and K.\nD.\nForbus, “Extending analogical generalization with near-misses.,” in AAAI, pp.\n565– 571, 2015.\n[11] D.\nJ.\nZelik, E.\nS.\nPatterson, and D.\nD.\nWoods, “Measuring attributes of rigor in information analysis,” Macrocognition metrics and scenarios: Design and evaluation for real-world teams, pp.\n65–83, 2010.\n[12] D.\nT.\nMoore, Sensemaking: A structure for an Intelligence Revolution.\nGovernment Printing Ofﬁce, 2013.\n[13] L.\nMoreau, B.\nClifford, J.\nFreire, J.\nFutrelle, Y.\nGil, P.\nGroth, N.\nKwasnikowska, S.\nMiles, P.\nMissier, J.\nMyers, et al., “The open provenance model core speciﬁcation (v1.\n1),” Future generation computer systems, vol.\n27, no.\n6, pp.\n743–756, 2011.\n[14] S.\nFriedman, J.\nRye, D.\nLa Vergne, D.\nThomsen, M.\nAllen, and K.\nTunis, “Provenance-based interpretation of multi-agent information analysis,” in Proceedings of the 12th USENIX Conference on Theory and Practice of Provenance, 2020.\n[15] R.\nGoldman, S.\nFriedman, and J.\nRye, “Plan recognition for network analysis: preliminary report,” in Proceedings of the AAAI 2018 Workshop on Plan, Activity, and Intent Recognition, Munich, Germany, pp.\n8–14, 2018.\n25 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "33": "SIFT SKYLINE SBIR Topic AF244-0001, Proposal F244-0001-0028 [16] Y.\nYan, L.\nLiu, Y.\nBan, B.\nJing, and H.\nTong, “Dynamic knowledge graph alignment,” in Proceedings of the AAAI conference on artiﬁcial intelligence, vol.\n35, pp.\n4564–4572, 2021.\n[17] Z.\nHuang, Z.\nLi, H.\nJiang, T.\nCao, H.\nLu, B.\nYin, K.\nSubbian, Y.\nSun, and W.\nWang, “Multilingual knowledge graph completion with self-supervised adaptive graph alignment,” arXiv preprint arXiv:2203.14987, 2022.\n[18] J.\nH.\nBrenas and A.\nShaban-Nejad, “Proving the correctness of knowledge graph update: a scenario from surveillance of adverse childhood experiences,” Frontiers in big Data, vol.\n4, p.\n660101, 2021.\n[19] M.\nNeˇcask´y and ˇStˇep´an Stenchl´ak, “Interactive and iterative visual exploration of knowledge graphs based on shareable and reusable visual conﬁgurations,” Web Semantics, vol.\n73, p.\n100713, jul 2022.\n[20] H.\nVargas, C.\nBuil-Aranda, A.\nHogan, and C.\nL´opez, “Rdf explorer: A visual sparql query builder,” in The Semantic Web – ISWC 2019: 18th International Semantic Web Conference, Auckland, New Zealand, October 26–30, 2019, Proceedings, Part I, (Berlin, Heidelberg), p.\n647–663, Springer-Verlag, 2019.\n[21] T.\nEhrhart, P.\nLisena, and R.\nTroncy, “Kg explorer: a customisable exploration tool for knowledge graphs,” in VOILA 2021, International Workshop on the Visualization and Interaction for Ontologies and Linked Data, 2021.\n[22] A.\nM.\nCollins and E.\nF.\nLoftus, “A spreading-activation theory of semantic processing.,” Psychological review, vol.\n82, no.\n6, p.\n407, 1975.\n[23] F.\nCrestani, “Application of spreading activation techniques in information retrieval,” Artiﬁcial Intelligence Review, vol.\n11, pp.\n453–482, 1997.\n[24] D.\nAswath, S.\nT.\nAhmed, J.\nD’cunha, and H.\nDavulcu, “Boosting item keyword search with spreading activation,” in The 2005 IEEE/WIC/ACM International Conference on Web Intelligence (WI’05), pp.\n704–707, IEEE, 2005.\n[25] K.\nD.\nForbus, R.\nW.\nFerguson, A.\nLovett, and D.\nGentner, “Extending sme to handle large-scale cognitive modeling,” Cogni- tive Science, vol.\n41, no.\n5, pp.\n1152–1201, 2017.\n[26] T.\nLebo, S.\nSahoo, D.\nMcGuinness, K.\nBelhajjame, J.\nCheney, D.\nCorsar, D.\nGarijo, S.\nSoiland-Reyes, S.\nZednik, and J.\nZhao, “PROV-O: The PROV Ontology,” W3C recommendation, vol.\n30, 2013.\n[27] D.\nEdge, H.\nTrinh, N.\nCheng, J.\nBradley, A.\nChao, A.\nMody, S.\nTruitt, and J.\nLarson, “From local to global: A graph rag approach to query-focused summarization,” arXiv preprint arXiv:2404.16130, 2024.\n[28] S.\nFriedman, N.\nBenkler, D.\nMosaphir, J.\nRye, S.\nSchmer-Galunder, M.\nGoldwater, M.\nMcLure, R.\nWheelock, J.\nGottlieb, R.\nGoldman, and C.\nMiller, “Bottom-Up and Top-Down Analysis of Values, Agendas, and Observations in Corpora and LLMs,” NeurIPS Workshop on Pluralistic Alignment, 2024.\n[29] J.\nZheng, S.\nFriedman, S.\nSchmer-Galunder, I.\nMagnusson, R.\nWheelock, J.\nGottlieb, D.\nGomez, and C.\nMiller, “Toward a theory-based model for characterizing directed social regard in online messaging,” pp.\n203–208, 2022.\n[30] S.\nFriedman, J.\nZheng, and H.\nSteinmetz, “Debiasing multi-entity aspect-based sentiment analysis with norm-based data augmentation,” in Proceedings of the 2024 Joint International Conference on Computational Linguistics, Language Resources and Evaluation (LREC-COLING 2024), pp.\n4456–4461, 2024.\n[31] M.\nMcLure, S.\nKandaswamy, and K.\nForbus, “Finding textures in sketches using planar ising models,” in 28th International Workshop on Qualitative Reasoning (QR2015), 2015.\n[32] M.\nD.\nMcLure and D.\nM.\nMusliner, “A changepoint method for open-world novelty detection,” 2022 IEEE International Geoscience and Remote Sensing Symposium (IGARSS 2022), in press.\n[33] M.\nMcLure and K.\nForbus, “Encoding strategies for learning geographical concepts via analogy,” in Proceedings of the Twenty-Sixth International Workshop on Qualitative Reasoning, 2012.\n[34] M.\nD.\nMcLure, S.\nE.\nFriedman, A.\nLovett, and K.\nD.\nForbus, “Edge-cycles: A qualitative sketch representation to support recognition,” in Proceedings of the 25th International Workshop on Qualitative Reasoning, 2011.\n26 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "34": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Duns Cage F244-0001-0028 AF244-0001 SkyLine: Structured Knowledge Graphs with Integrity & Lineage 11/05/2024 05:14:05 PM Smart Information Flow Technologies, d/b/a SIFT 319 1st Ave North Suite 400, Minneapolis, Minnesota, 55401 http://www.sift.net HT19FEFNVXC5 103477993 1NHZ1 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 49.43%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (10%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) $139,481.78 $139,481.78 $0.00 $0.00 $0.00 $83,915.96 $0.00 $0.00 $0.00 $1,406.00 $0.00 $41,479.66 $126,801.62 $0.00 -$0.00 $12,680.16 $139,481.78 $0.00 $0.00 $0.00",
        "35": "Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 49.43%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (10%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Computer and Information Research Scientist/ Principal Investigator (Scott Friedman) Computer and Information Research Scientist/ Researcher (Drisana Iverson) Computer and Information Research Scientist/ Researcher (Matt McLure) Subtotal Direct Labor (DL) Labor Overhead (rate 59.3%) x (DL) Total Direct Labor (TDL) Direct Travel Costs Project Kickoff Total Direct Travel Costs (TDT) G&A (rate 49.43%) x Base (TDL+TOH) Cost Sharing Profit Rate (10%) Total Estimated Cost TABA Year 2 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $132.58 132 $17,500.56 $67.91 269 $18,267.79 $67.91 249 $16,909.59 $52,677.94 $31,238.02 $83,915.96 $1,406.00 $1,406.00 $41,479.66 -$0.00 $12,680.16 $139,481.78 $0.00",
        "36": "Direct Labor Costs Category / Individual-TR Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost Computer and Information Research Scientist/ Principal Investigator (Scott Friedman) $132.58 0 Subtotal Direct Labor (DL) Labor Overhead (rate 59.3%) x (DL) Total Direct Labor (TDL) Direct Travel Costs N/A Total Direct Travel Costs (TDT) G&A (rate 49.43%) x Base (TDL+TOH) Cost Sharing Profit Rate (10%) Total Estimated Cost TABA Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Scott Friedman Phone: (314) 640-9077 Phone: sfriedman@sift.net Title: Proposal Owner $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: Yes Audit Agency Name: DCAA, Minneapolis Branch Office Audit Agency POC: Melissa Scherf Address: 316 Robert St N, STE 615, St.\nPaul, Minnesota,55101 Phone: (763) 744-5520 Email: Melissa.Scherf@dcaa.mil Select the Type of Payment Desired: Partial payments",
        "37": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Computer and Information Research Scientist Principal Investigator PhD Computer and Information Research Scientist Researcher PhD Computer and Information Research Scientist Researcher PhD 20 7 13 132 $132.58 $17,500.56 269 $67.91 $18,267.79 249 $67.91 $16,909.59 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nDirect labor costs are estimated using an avg hourly rate for each labor grade in FY2025 with a 3.5% escalation for each year thereafter, which is a combo of cost of living and merit-based increases.\nDirect Labor Cost ($): Year2 Category Description Education Yrs Experience Hours Rate Fringe Rate Computer and Information Research Scientist Principal Investigator PhD 20 0 $132.58 Are the labor rates detailed below fully loaded?\nProvide any additional information and cost support data related to the nature of the direct labor detailed above.\nDirect labor costs are estimated using an avg hourly rate for each labor grade in FY2025 with a 3.5% escalation for each year thereafter, which is a combo of cost of living and merit-based increases.\nDirect Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead $52,677.94 Total $0.00 NO $0.00 $52,677.94",
        "38": "Base Labor Cost Overhead Rate (%) Apply Overhead to Direct Travel Cost?\nOverhead Comments: Provisional Billing Rates, approved by DCAA on 8/14/24, are used for cost estimation for this proposal because SIFT has historically very stable wrap rates.\nThese are the same wrap rates that have been used for the past nine years, and approved by DCAA each year.\nOverhead Cost ($): Year2 Labor Cost Overhead Rate (%) Apply Overhead to Direct Travel Cost?\nOverhead Comments: Provisional Billing Rates, approved by DCAA on 8/14/24, are used for cost estimation for this proposal because SIFT has historically very stable wrap rates.\nThese are the same wrap rates that have been used for the past nine years, and approved by DCAA each year.\nOverhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to ODC- Travel?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nProvisional Billing Rates, approved by DCAA on 8/14/24, are used for cost estimation for this proposal because SIFT has historically very stable wrap rates.\nThese are the same wrap rates that have been used for the past nine years, and approved by DCAA each year.\n59.3 NO $31,238.02 59.3 NO $0.00 $31,238.02 49.43 YES YES NO",
        "39": "G&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to ODC- Travel?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nProvisional Billing Rates, approved by DCAA on 8/14/24, are used for cost estimation for this proposal because SIFT has historically very stable wrap rates.\nThese are the same wrap rates that have been used for the past nine years, and approved by DCAA each year.\nG&A Cost ($): Sum of all G&A Costs is ($): ODC-Travel Base Description: Project Kickoff $41,479.66 49.43 YES YES NO $0.00 $41,479.66 Location From: MInneapolis, MN Location To: Rome, NY Number of People: 2 Purpose of Trip: Project Kickoff Number of Days: 2 Total Airfare Costs ($): $892.00 Total Car Rental Costs ($): $90.00 Total Per Diem Costs ($): $424.00 Total Other Costs ($): $0.00 Total Costs ($): $1,406.00 Purpose of Trip: Project Kickoff Sources of Estimates: Air quotes from Orbitz.com reflect the lowest available nonstop fare with no change fee.\nPer Diem rates are per published rates at http://www.gsa.gov.\nFirst and last day M&IE Per Diem is at 75%.\nExplanation/Justifications: Annual travel escalation rates used in the proposal vary from 2.8% to 5.3% depending on the item (airfare, auto, etc.).\nWe consider the Consumer Price Indexes for All Urban Consumers, Transportation-Related Goods and Services when setting escalation",
        "40": "rates.\nThe increase in overall transportation from 2020 to 2021 was 14.6% and 2021 to 2022 was 32.3%, which suggest we've been conservative in our estimates.\nYear2 Description: N/A Location From: N/A Number of People: 0 Purpose of Trip: N/A Location To: N/A Number of Days: 0 Total Airfare Costs ($): $0.00 Total Car Rental Costs ($): $0.00 Total Per Diem Costs ($): $0.00 Total Other Costs ($): $0.00 Total Costs ($): $0.00 Purpose of Trip: N/A Sources of Estimates: N/A Explanation/Justifications: N/A ODC-Summary Base Do you have any additional information to provide?\nYear2 Do you have any additional information to provide?\nProfit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: As a small business, SIFT's typical 10% fee is included in this proposal.\nTotal Profit Cost ($): Year2 NO NO - 10 $12,680.16",
        "41": "Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: As a small business, SIFT's typical 10% fee is included in this proposal.\nTotal Profit Cost ($): Total Proposed Amount ($): - 10 $12,680.16 $139,481.78",
        "42": "SBIR Company Commercialization Report SMART INFORMATION FLOW TECHNOLOGIES LLC DISCLAIMER: Information provided herein is privileged and confidential, and not subject to disclosure, pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nThis information shall only be used or disclosed for evaluation purposes.\nPrivileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 09/20/2023 Page 1/10",
        "43": "SBIR Company Commercialization Report Total Investments: Total Sales: Total Patents: $18,794,917.00 Company Information Address: $0.00 16 319 1ST AVE N STE 400 MINNEAPOLIS, MN 55401-1689 United States Government Designated Phase III Funding: $1,395,331.00 SBC Control ID: SBC_000000276 Company Url: https://www.sift.net/ Company POC Title: Vice President, R&D Full Name: Harry Funk Phone: Email: 6123397438 Ext 201 hfunk@sift.net Additional Company Information % Revenue for last fiscal year from SBIR/STTR funding: 15.2% Year Founded: 1999 Commercialization POC Title: CEO Full Name: Mark Berman Phone: Email: (612) 339-7438 Ext 210 mberman@SIFT.net Total revenue for last fiscal year: $5,000,000 - $19,999,999 # Employees Currently: 42 Year first Phase I award received: # SBIR/STTR Phase I Awards: 2000 56 Year first Phase II award received: # SBIR/STTR Phase II Awards: 2002 25 # Employees at first Phase II award: Mergers and Acquisition within past 2 years: 5 No Spin-offs resulting from SBIR/STTR: IPO resulting from SBIR/STTR | Year of IPO: No No | N/A Patents resulting from SBIR/STTR | #Patents: List of Patents: Yes | 16 Woman-Owned: No HUBZone-Certified: No 11755838,11468608,11372854,11256561,10963703,10528729,10217051,10217050, 10217049,10108798,9830830,9754502,9477823,9390627,9053421,8825584 Socially and Economically Disadvantaged: No SBC majority-owned by multiple VCOC, HF, PE firms | By what percent (%): No | N/A Additional Investment From DoD contracts/DoD subcontracts $11,071,697.00 $15,742,297.00 Last Submitted Version (02-15-2021 02:31 PM) Current Version Angel Investors Venture Capital Self Funded Private Sector Other Federal Contracts/Grants Other Sources Additional Investment Total Investment $0.00 $0.00 $0.00 $984,770.00 $2,014,850.00 $53,000.00 $0.00 $14,124,317.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 09/20/2023 $0.00 $0.00 $0.00 $984,770.00 $2,014,850.00 $53,000.00 $0.00 $18,794,917.00 Page 2/10",
        "44": "SBIR Company Commercialization Report Phase III Sales To DoD or DoD prime contractors Private Sector Export Markets Other Federal Agencies Additional commercialization by 3rd Party Revenue Other Customers Additional Sales Total Sales Government Phase III Contracts Last Submitted Version (02-15-2021 02:31 PM) Current Version $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Funding Obligated $0.00 $1,395,331.00 Last Submitted Version (02-15-2021 02:31 PM) Current Version Commercialization Narrative Commercialized Awards Listed below are the sales revenue and investment details resulting from the technology developed under these SBIR/STTR awards.\nCOMPEER: Community of Measured Peers 1 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2018 Subsidiaries No | N/A N/A Topic #: AF171-049 Contract/Grant #: FA8750-18-C-0192 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: REPAIRing with an OpenMIND Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: SBIR/Phase II/2022 Topic #: SB162-005 Contract/Grant #: 140D0422C0046 Achieved a cost saving or cost No Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 2 of 15 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 09/20/2023 Page 3/10",
        "45": "SBIR Company Commercialization Report avoidance?: Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $607,300.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $607,300.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 COMPEER: Community of Measured Peers 3 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2018 Subsidiaries No | N/A N/A Topic #: AF171-049 Contract/Grant #: FA8750-18-C-0192 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $124,700.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $124,700.00 Sales Total: TYBALT: Transcending cYber Barriers with Automated Language Tracking Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Program/Phase/Year: SBIR/Phase II/2019 Topic #: SB171-009 Contract/Grant #: FA8650-19-C-6025 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $984,600.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $984,600.00 Sales Total: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 09/20/2023 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 4 of 15 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 4/10",
        "46": "SBIR Company Commercialization Report NEUTRON: Network Enforcement Using TRansctiONs 5 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: STTR/Phase II/2019 Subsidiaries No | N/A N/A Topic #: AF17B-T004 Contract/Grant #: FA8750-19-C-0082 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Who initiated the collaboration?: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $642,000.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $642,000.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Small Business Concern Number of months taken to negotiate the Allocation of Rights agreement: 1 Who initiated the technology?: Research Institution Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: 50% 50% GEMINI: Gestalt Mixed Initiative Intelligence 6 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2017 Subsidiaries No | N/A N/A Topic #: AF161-045 Contract/Grant #: FA8650-17-C-6871 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Government Designated Phase III Contracts Funding Agreement / Contract # HR00112290023 Agency DARPA Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $1,615,093.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $1,615,093.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Project Title Year Awarded Funding Obligated HUGO: Humanitarian User 2021 $1,395,331.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 09/20/2023 Page 5/10",
        "47": "SBIR Company Commercialization Report Group Oversight Formal Synthesis and Verification Techniques for Autonomous Cyber-Physical Systems 7 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2016 Subsidiaries No | N/A N/A Topic #: AF14-AT06 Contract/Grant #: FA8650-16-C-2611 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $1,250,255.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $1,250,255.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Delegation in LoA3 Space Agency/Branch: Department of Defense/Army Manufacturing related 8 of 15 Yes | Systems Level Manufacturing N/A Subsidiaries Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Program/Phase/Year: SBIR/Phase II/2008 Topic #: A06-007 Contract/Grant #: W911W6-08-C-0066 Achieved a cost saving or cost avoidance?: a.\nAgency/End user: Yes Air Force Research Laboratory for HQ Air Force b.\nSystem/Program: AFRL support contract Contract FA8650-08-D-6801, TO 39 c.\nCost Savings: $250,000.00 d.\nCost Savings Type: life-cycle e.\nExplanation: A goal of the AFRL program was to have a portable, laptop-based demonstration environment for reviewing play-based delegation control concept to AF pilots in traveling focus groups.\nApproximately 2/3 of our Ph2 SBIR for the Army was devoted to developing Additional Investment From DoD contract/subcontract: Phase III Sales To $3,922,858.00 Dod or DoD prime contractors: Other Federal contract/grants: $1,391,000.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $207,000.00 Other Customers: $0.00 $5,520,858.00 Sales Total: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 09/20/2023 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 6/10",
        "48": "SBIR Company Commercialization Report Marshal: Maintaining Evolving Models Agency/Branch: National Aeronautics and Space Administration Program/Phase/Year: SBIR/Phase II/2015 Topic #: H6.01 Contract/Grant #: NNX15CA19C Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $491,537.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $491,537.00 Sales Total: 9 of 15 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 ANSIBLE: A Network of Social Interactions for Bilateral Life Enhancement 10 of 15 Agency/Branch: National Aeronautics and Space Administration Program/Phase/Year: SBIR/Phase II/2014 Topic #: H12.03 Contract/Grant #: NNX14CJ06C Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $24,850.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $24,850.00 Sales Total: SAGA: Sequential Art via Game Assistance Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: SBIR/Phase II/2013 Topic #: SB112-003 Contract/Grant #: W31P4Q-13-C-0058 Achieved a cost saving or cost No Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\n$0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 11 of 15 Last Updated On: 09/20/2023 Page 7/10",
        "49": "SBIR Company Commercialization Report avoidance?: Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 SAT-CIRCA: Verifiable Real-Time Autonomy for Satellites 12 of 15 Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Program/Phase/Year: SBIR/Phase II/2011 Topic #: SB093-006 Contract/Grant #: D11PC20204 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $1,832,054.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $9,600.00 Other Customers: $0.00 $1,841,654.00 Sales Total: Extremely Low Attention Demand Information Systems (ELADIS) Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: SBIR/Phase II/2009 Topic #: SB062-007 Contract/Grant #: W31P4Q-09-C-0222 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Phase III Sales To $3,791,900.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $273,870.00 Other Customers: $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 09/20/2023 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 13 of 15 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 8/10",
        "50": "SBIR Company Commercialization Report Investment Total: $4,065,770.00 Sales Total: $0.00 Cultural Etiquette and its Impact on Directive Human Performance Agency/Branch: Department of Defense/Air Force Manufacturing related 14 of 15 Yes | Environmental/Societal Level Manufacturing Subsidiaries N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Program/Phase/Year: SBIR/Phase II/2006 Topic #: AF05-069 Contract/Grant #: FA8650-06-C-6635 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: Universities (GMU, West Point, CMU) using test beds b.\nSystem/Program: ARL Decision Aiding CTA c.\nCost Savings: $70,000.00 d.\nCost Savings Type: life-cycle e.\nExplanation: Testbeds developed originally for experimentation under this SBIR were given, on 4 separate occasions, to universities to enable them to perform further, related experimentation.\nA very conservative estimate of 80 hours of skilled student time (=$5K) was Additional Investment From DoD contract/subcontract: Phase III Sales To $480,000.00 Dod or DoD prime contractors: Other Federal contract/grants: $599,000.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Other Sources Description: N/A $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $494,300.00 Other Customers: $10,000.00 Investment Total: $1,583,300.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Cognitive Decision Aid Knowledge Acquisition Toolkit (CDAKAT) 15 of 15 Agency/Branch: Department of Defense/Army Manufacturing related Yes | Unit Process Level Manufacturing Program/Phase/Year: SBIR/Phase II/2002 Topic #: N/A Contract/Grant #: DAAH-10-02-C-0005 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Subsidiaries N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 09/20/2023 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 9/10",
        "51": "SBIR Company Commercialization Report Other Sources: Other Sources Description: N/A $43,000.00 Investment Total: $43,000.00 Sales Total: $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 09/20/2023 Page 10/10",
        "52": "Scott Friedman, Smart Information Flow Technologies, d/b/a SIFT Nov 04, 2024 Nov 04, 2025"
    },
    "images": [
        {
            "page": 1,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page1_img1.jpeg",
            "hash": "963c69c169799696",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img1.png",
            "hash": "0000000000000000",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img9.png",
            "hash": "85945e97781e297a",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img10.png",
            "hash": "81b75fd62a4a684b",
            "position": "Bottom Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img13.png",
            "hash": "0000000000000000",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img14.png",
            "hash": "0000000000000000",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img17.png",
            "hash": "0000000000000000",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img20.png",
            "hash": "0000000000000000",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img21.png",
            "hash": "9697615a3e6d7860",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img22.png",
            "hash": "9796784b6561c336",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img23.png",
            "hash": "9797781a65618765",
            "position": "Middle Right"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img24.png",
            "hash": "c2d62d6d70799331",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img25.png",
            "hash": "979368782565c667",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img26.png",
            "hash": "974b78b465b4864b",
            "position": "Middle Right"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img27.png",
            "hash": "97c9681e25719763",
            "position": "Middle Right"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page8_img28.png",
            "hash": "0000000000000000",
            "position": "Bottom Center"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page11_img3.png",
            "hash": "0000000000000000",
            "position": "Top Center"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page11_img4.png",
            "hash": "0000000000000000",
            "position": "Top Center"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page11_img7.png",
            "hash": "0000000000000000",
            "position": "Top Center"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page11_img10.png",
            "hash": "0000000000000000",
            "position": "Top Center"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page11_img11.png",
            "hash": "9785651a2e3f1966",
            "position": "Top Center"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page11_img28.png",
            "hash": "81955e9f785a6958",
            "position": "Top Center"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page11_img29.png",
            "hash": "85915f976a9a6954",
            "position": "Top Center"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img1.png",
            "hash": "e0a69359a8d31abd",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img19.png",
            "hash": "80007f007f008000",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img20.png",
            "hash": "80807f807f7a2a7f",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img21.png",
            "hash": "80807f807f7a2a7f",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img22.png",
            "hash": "80807f807f7a2a7f",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img23.png",
            "hash": "80007f007f008000",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img24.png",
            "hash": "80807f807f7a2a7f",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img25.png",
            "hash": "80807f807f7a2a7f",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img26.png",
            "hash": "80807f807f7a2a7f",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img27.png",
            "hash": "80807f807f7a2a7f",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img29.png",
            "hash": "80807f807f2a7a7f",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img30.png",
            "hash": "80007f007f008000",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img31.png",
            "hash": "807f7f2a7f807a80",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img32.png",
            "hash": "80807f807f2a7a7f",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img33.png",
            "hash": "80807f807f2a7a7f",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img34.png",
            "hash": "80007f007f008000",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img35.png",
            "hash": "807f7f2a7f807a80",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img36.png",
            "hash": "80807f807f2a7a7f",
            "position": "Middle Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page12_img37.png",
            "hash": "807f7f2a7f807a80",
            "position": "Middle Left"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page15_img11.png",
            "hash": "8795354b7a787870",
            "position": "Middle Center"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page15_img12.png",
            "hash": "a52616366d5d3674",
            "position": "Middle Left"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page16_img1.png",
            "hash": "a52616366d5d3674",
            "position": "Middle Center"
        },
        {
            "page": 18,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page18_img1.png",
            "hash": "82293d7a6a297976",
            "position": "Top Center"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page19_img1.png",
            "hash": "b258e63338ee0771",
            "position": "Top Center"
        },
        {
            "page": 20,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page20_img1.png",
            "hash": "ee26a49d99e433e0",
            "position": "Top Center"
        },
        {
            "page": 23,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page23_img1.jpeg",
            "hash": "fe9c9988c436a731",
            "position": "Middle Center"
        },
        {
            "page": 24,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page24_img1.png",
            "hash": "bc0e873879c2d1d3",
            "position": "Top Center"
        },
        {
            "page": 25,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page25_img2.png",
            "hash": "b2e1c91fc8589cc7",
            "position": "Top Left"
        },
        {
            "page": 25,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page25_img4.png",
            "hash": "f2e25889c833e739",
            "position": "Top Center"
        },
        {
            "page": 25,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page25_img6.png",
            "hash": "ba6262626662f2fa",
            "position": "Top Right"
        },
        {
            "page": 26,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page26_img1.jpeg",
            "hash": "ef6b929623196c64",
            "position": "Top Left"
        },
        {
            "page": 26,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page26_img2.jpeg",
            "hash": "b64cc98de6429eb1",
            "position": "Top Center"
        },
        {
            "page": 27,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page27_img1.png",
            "hash": "c9b6b64929b6b0a5",
            "position": "Top Center"
        },
        {
            "page": 27,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page27_img2.png",
            "hash": "952f6fc07a903e94",
            "position": "Middle Left"
        },
        {
            "page": 27,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page27_img3.png",
            "hash": "943b3b6e6bc03e90",
            "position": "Middle Center"
        },
        {
            "page": 27,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page27_img4.jpeg",
            "hash": "8ff1f10b960f438c",
            "position": "Middle Right"
        },
        {
            "page": 34,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page34_img1.png",
            "hash": "834987a6cf38ccb6",
            "position": "Top Left"
        },
        {
            "page": 42,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page42_img1.png",
            "hash": "d3326c8c33328cfd",
            "position": "Top Left"
        },
        {
            "page": 43,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page43_img1.png",
            "hash": "d3326c8c33328cfd",
            "position": "Top Left"
        },
        {
            "page": 44,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page44_img1.png",
            "hash": "d3326c8c33328cfd",
            "position": "Top Left"
        },
        {
            "page": 45,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page45_img1.png",
            "hash": "d3326c8c33328cfd",
            "position": "Top Left"
        },
        {
            "page": 46,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page46_img1.png",
            "hash": "d3326c8c33328cfd",
            "position": "Top Left"
        },
        {
            "page": 47,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page47_img1.png",
            "hash": "d3326c8c33328cfd",
            "position": "Top Left"
        },
        {
            "page": 48,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page48_img1.png",
            "hash": "d3326c8c33328cfd",
            "position": "Top Left"
        },
        {
            "page": 49,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page49_img1.png",
            "hash": "d3326c8c33328cfd",
            "position": "Top Left"
        },
        {
            "page": 50,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page50_img1.png",
            "hash": "d3326c8c33328cfd",
            "position": "Top Left"
        },
        {
            "page": 51,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page51_img1.png",
            "hash": "d3326c8c33328cfd",
            "position": "Top Left"
        },
        {
            "page": 52,
            "image_file": "docNAC01FB745353035dbfca3ef934aaba984481b4b1e1d5d610a390a73d88a16ecbe8558e32c013_page52_img1.jpeg",
            "hash": "c6cc2b23999bb24d",
            "position": "Middle Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "sift.net",
        "name": "N/A",
        "phone": "N/A"
    }
}