{
    "filename": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0081 Proposal Title: Impact Observatory Knowledge Graphs for Situational Awareness Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: Impact Observatory, Inc Address: Website: UEI: DUNS: CAGE: 3640 Brandywine St, NW, Washington, DC 20008-2913 www.impactobservatory.com MNHTKV6Z58P7 117601577 8QGM3 SBA SBC Identification Number: 001832943 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 16 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_001832943 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_001832943.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [ ] White [ ] Black or African American [X] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Title Business Name Date Melanie Corcoran Melanie Corcora Strategic Advisor Impact Observatory, Inc 02/03/2021 n",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?NO VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: Large Language Models (LLMs) present transformative potential for managing and interacting with knowledge graphs (KGs) driven by dynamic Intelligence, Surveillance, and Reconnaissance (ISR) datasets, enabling non-expert users to engage with specialized, structured data crucial for ISR.\nTraditional KG management tools are complex, lacking intuitive methods to curate and contextualize information across domains.\nIn contrast, LLMs offer a plain language interface that simplifies navigating ISR ontologies and integrates data from various sources to provide timely, actionable insights.\nThis project will leverage Impact Observatory’s (IO) Sidekick – an LLM-powered tool designed for ISR-focused geospatial visualization and analysis – integrating advanced, dynamic KG management functionality tailored to Air Force operational workflows.\nIO’s Sidekick provides automated, near real-time access to open and commercial geospatial data sources, significantly reducing the workload on analysts and enabling timely, accurate decision-making.\nBy embedding dynamic, context-specific KGs and management tools in Sidekick, this project will create a robust system for Air Force applications, including situational awareness, large-area monitoring, threat detection, and targeting.\nPhase 1 will focus on two types of LLM-agent powered KGs designed to meet Air Force requirements: • • Interactive Knowledge Graphs: These will encode structured geospatial data, facilitating easier access to location- based insights and sensing modalities essential for effective ISR.\nTask-Specific Knowledge Graphs: These will incorporate private, mission-relevant data, such as operational reports and asset manifests, enabling Sidekick to deliver precise, mission-critical insights tailored for specific Air Force",
        "5": "objectives.\nProof-of concept studies will emphasize the feasibility of an integrated system that ensures: • • Real-Time Updates to Knowledge Graphs: Dynamic updates will keep KGs current, providing operators with timely and accurate information for effective decision-making.\nError Management and Confidence Assessment: Sidekick’s interface will empower users to verify and validate KG- presented information, enhancing trust in the insights generated for critical ISR tasks.\nKey tasks include: • • • Interactive KG Prototype: Establish a geospatial ontology focused on situational awareness and threat detection, culminating in a working prototype.\nTask-Specific KG Planning Study: Conduct source retrieval planning to integrate private data sources, such as mission reports and intelligence briefings.\nUser-Driven Updating of KG Planning Study: Demonstrate user-driven updates to KGs utilizing IO’s Sidekick LLM interface.\nThis project represents a significant advancement in delivering real-time, actionable knowledge to operators, transforming structured data into mission-aligned insights that are readily accessible and verifiable, thereby enhancing ISR capabilities across the Air Force.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: The integration of dynamic knowledge graph (KG) capabilities into Impact Observatory’s Sidekick will significantly enhance both defense and commercial applications, providing specialized, task-driven data insights across various sectors.\nDefense Applications: The primary focus is to equip Air Force users with a tailored, dynamic KG system within Sidekick that supports critical ISR functions, including situational awareness, pattern of life analysis, threat detection, and tip-and-cue workflows.\nBy embedding specialized KGs, Sidekick enables rapid access to context-specific data that evolves with real-time inputs, empowering operators to make informed, immediate decisions.\nAdditional specialized KGs can be configured to address other defense needs, allowing non-expert users to verify insights, thereby building confidence and enabling effective, data-driven mission outcomes.\nDisaster Response: Dynamic KGs will be invaluable for emergency management agencies and first responders, providing",
        "6": "swift access to critical data on affected areas, infrastructure status, and resource allocation needs during crises.\nSidekick’s capabilities will streamline response times and enhance situational awareness in rapidly evolving disaster scenarios, improving overall effectiveness.\nAgricultural Monitoring: In agriculture, particularly in developing regions, dynamic KGs will equip farmers and agricultural officials with direct access to essential information on crop health, yield estimation, and seasonal planning.\nBy consolidating and structuring this data, Sidekick with KG functionality will enhance decision-making for crop management and resource allocation, reducing reliance on specialized knowledge.\nNatural Resource Monitoring: Integrated dynamic KGs in Sidekick will support governments, industry and NGOs monitoring high-risk areas for resource management, flood mitigation, deforestation and wild-fire risk, and habitat health.\nThese KGs will enable users to access and benefit from relevant environmental data without requiring scientific expertise, empowering organizations to independently track and respond to ecological changes.\nThe integration of specialized, dynamic knowledge graphs enhances Sidekick’s utility, making it a versatile platform that delivers actionable insights to users in diverse, high-stakes environments, ultimately advancing the capabilities of ISR and situational awareness across various applications.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: 3 4 5 6 11 12 13 14 17 List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: ISR, dynamic knowledge graphs, situational awareness, decision-making, real-time updates, data interoperability, natural language interface, mission-specific insights",
        "7": "VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\n3.\nDuring the performance of the contract, the research/research and development will be performed in the United States.\n72.71% 27.29% YES YES 4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\n8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES NO NO NO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, YES release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\n15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nYES NO",
        "8": "16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\n20% NO NO Partners: Partner Name Clair Sullivan & Associates, LLC Partner Type Small Business Point of Contact Dr.\nClair J.\nSullivan VOL I - Contact Information Principal Investigator Name: Nathan Longbotham Phone: (202) 795-7101 Email: nathan@impactobservatory.com Address: 900 19th St NW, Suite 600, Washington, DC 20006 - Corporate Official Name: Mrs.\nSamantha Hyde Phone: (540) 809-3610 Email: sam@impactobservatory.com Address: 3640 Brandywine St, NW, Washington, DC 20008 - 2913 Authorized Contract Negotiator Form Generated on 11/06/2024 10:59:58 AM",
        "9": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Principal Investigator: Nathan Longbotham PhD, Head of Product Steven P.\nBrumby, PhD, CEO/Co-Founder DAF Topic Number: AF244-0001 “Phase I Interactive Knowledge Graphs for Situational Awareness” This proposal includes data that shall not be disclosed outside the Government and shall not be duplicated, used, or disclosed-in whole or in part-for any purpose other than to evaluate this proposal.\nIf, however, a contract is awarded to this proposing small business concern as a result of-or in connection with-the submission of this data, the Government shall have the right to duplicate, use, or disclose the data to the extent provided in the resulting contract.\nThis restriction does not limit the Government's right to use information contained in this data if it is obtained from another source without restriction.\nThe data subject to this restriction are contained in pages 3,4,5,6,11,12,13,14,17.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n1",
        "10": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume LLM-powered Interactive Knowledge Graphs for Situational Awareness Product Vision Develop an interactive knowledge graph (KG) for situational awareness and ISR operations, utilizing a wide range of near-real-time geospatial datasets and contextual information.\nThis system will leverage Impact Observatory’s proprietary Sidekick “show and tell” LLM and computer vision technology to enhance the creation, curation, and analysis of KGs from dynamic ISR data, delivering robust graphs and accelerating the production of critical insights.\nDefense need: Decision-making in defense operations must be both accurate and timely, leveraging the best available ISR datasets.\nKGs are a critical technology for structuring and deriving insights from ISR datasets, but struggle to keep up with the volume, velocity, and variety of new datasets for multiple missions.\nLLM+KG agents enable revolutionary capabilities in this mission-critical field.\nPhase 1 Scope Objectives: ● Build Interactive KG Prototype: LLM powered agents specialized to create and curate robust KGs in near real time for situational awareness and threat detection from dynamic ISR datasets ● Demonstrate feasibility of Task-Specific KG creation and analysis: Enhance speed, completeness, and accuracy of mission-specific decision making.\n● Demonstrate feasibility of User-Driven Updating for Interactive KG: Enable timely and robust updates from dynamic ISR data.\nKey Innovations: Specialized insights tailored to Air Force workflows, empowering operators to make data-driven decisions.\nA natural language interface transforms analyst interaction with KGs.\nAutomated quality control processes validate and recommend updates, ensuring accuracy.\nThe system accelerates analyst productivity for curating and analyzing mission-relevant changes.\nCompany Expertise ● LLM-powered agents for ISR data, including RAG from dynamic KGs.\n● Track-record developing unique advanced analytic products for DoD/IC and commercial users.\n● Advanced AI and ML for computer vision specialized for ISR and geospatial data.\n● Remote-sensing algorithms and scalable processing for foundational applications.\n● Leading expertise in very large scale computing for ISR datasets.\n2 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "11": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Significance of Problem and Opportunity - 1/2 Problem ● Knowledge Graphs (KGs) are used by Air Force analysts to organize and analyze complex intelligence, surveillance, and reconnaissance (ISR) datasets for mission-critical tasks including situational awareness, patterns of life, threat detection, and targeting.\n● Existing tools to visualize and interact with KGs derived from ISR datasets - from overhead imagery to geolocated sensors and reporting - are manual, slow, and depend on experts to update as information changes and novel sources and categories are added.\n● This is especially important and challenging in time constrained environments where the scale of the area of responsibility (AOR) and the volume, velocity, and need for validation of sources and targets is too much for traditional manual analysis.\nOpportunity ● Large Language Model (LLM) agents specialized for ISR datasets can enable a new generation of interactive KGs powered by dynamic ISR datasets, significantly improving robustness and reducing curation and analysis time.\n● ● ● LLM+KG agents for ISR datasets can automate structured extraction of information from overhead imagery and sensors, building dynamic KGs in near-real-time.\nLLM+KG agents can provide a natural language interface with visual “show and tell” to revolutionize how analysts interact with and understand dynamic ISR data via KGs, LLM+KG agents can enable non-experts to benefit from ISR datasets, including the growing variety, volume, and velocity of commercial and open data, while increasing KG relevance and accuracy, and user trust.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n3",
        "12": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Significance of Problem and Opportunity - 2/2 Technical Concept: Geospatial LLM+KG agents ● Develop a Geospatial LLM+KG agent proof-of-concept that encodes the foundational ontology of ISR data collection and analysis for a range of open and commercial geospatial and remote sensing datasets, delivered into a dynamic KG focused on situational awareness and threat detection ● Explore LLM+KG agents for Task-Specific KGs leveraging non-public and historical information and assets such as operational reports, asset manifests, and geospatial analysis reports needed to generate and deliver trustworthy, timely, mission-critical insights for specific Air Force objectives.\n● Explore LLM+KG agents for advanced Interactive KGs showing LLM+KG agents assisting users to visualize, modify, and validate KGs, ensuring that the KG and underlying data remains current and relevant for specific tasks.\n1 2 Geospatial LLM+KG agents assist analysts (1) access and analyze geospatial and remote sensing data and other textual reporting to (2) build, validate, and curate dynamic knowledge graphs, and (3) interact with the KG to deliver trustworthy, timely task-specific reports and alerts.\n3 4 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "13": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Technical Concept - 1/3 Key Innovations LLM + KG agents for ISR … ● use AI-powered tools to access and analyze overhead imagery and geolocated sensor data and reporting from local to global scale, and structure extracted information in a dynamic, interactive KG.\nassist Air Force analysts validate and curate the KG as new observations are received, and identify data gaps and anomalies in the context of past reporting guide analysts to access or order new observations and update reporting and alerting for changes and threats.\n● ● Benefits to Air Force analysts include ● Intuitive natural language interface with visual “show and tell” revolutionizes how analysts interact with KGs.\n● Enabling analysts to access to analyze ISR datasets from open and commercial sources.\n● Accelerating productivity to detect and analyze change.\n● Robust curation of KGs from dynamic data with assisted quality control, result validation, and auditing of changes.\nCurrent Baseline Advancement through R&D Air Force analysts use KGs to access, interact with, and analyze complex ISR datasets extracted from many sources, requiring continuous human assessment and curation.\nTools to visualize and interact with KGs are manual, slow, and hard to adapt to new data/needs.\nAir Force analysts are enabled and accelerated by teams of LLM+KG agents that transform and structure near-real-time ISR datasets in a dynamic KG.\nLLM+KG agents enable robust, timely KG curation and analysis via an intuitive natural language plus visual interface.\n5 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "14": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Technical Concept - 2/3 Technical Feasibility - Background AI-powered near-real-time analysis of spatial data: Impact Observatory (IO) has developed a pioneering annual time series of local to global maps from 2017 to the present using a deep-learning U-Net computer vision model that now enables a living map of the world [1,2].\nIO’s deep-learning U-Net models are developed using a unique, very large dataset developed by the IO team [3].\nOur global maps are released via NGA Grid, Esri Living Atlas, Microsoft Azure, and Amazon AWS.\nLLM-powered agents for ISR analysis: IO has developed a geospatial AI system called Sidekick to “show and tell” how the world is changing from local to global scale.\nSidekick combines specialized LLM agents that support plain language requests in a simple chat interface with a toolkit of ISR geospatial data access and deep-learning change detection and monitoring algorithms, with dynamic Retrieval Augmented Generation (RAG) from validated structured and unstructured data sources.\nThe system augments and accelerates the human workforce, from requesting current and historical geospatial data, to automating monitoring and analysis of relevant changes in near real time, to recommending follow-up observations from commercial and open overhead imagery, and helps the assemble quantitative results, clear visuals, and plain language narrative in standard reporting formats.\nLand Cover and Change maps produced by IO for Space Force IO Sidekick combines LLMs and U-Nets to show and tell 6 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.",
        "15": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Technical Concept - 3/3 Technical Risk Assessment and Mitigation Technical Feasibility - References Capture requirements for Analyst Workflows - need to understand major pain points for users interacting and validating KGs as velocity and variety of geospatial input grow and KGs scale.\nWill initially rely on in-house expertise from ex-USG members of team and retired recent-USG consultants - Low to Medium Risk Access to Geospatial and Reporting Data - Access to many sources of open and commercial geospatial data and open news news reporting via cloud and partners - Low Risk Access to Training and Validation Data - based on situational awareness and threat detection case studies, we will construct a testing and validation dataset for training LLMs to use KGs tools - Low to Medium Risk [1] Karra, K., et al., Global land use / land cover with Sentinel 2 and deep learning, (2021) IEEE IGARSS, 2021, pp.\n4704-4707, doi: 10.1109/IGARSS47720.2021.9553499.\n[2] Venter, Z.S., et al., Global 10 m Land Use Land Cover Datasets: A Comparison of Dynamic World, World Cover and Esri Land Cover.\nRemote Sens.\n2022, 14, 4101.\ndoi: 10.3390/rs14164101 [3] Brown, C.F., et al.\nDynamic World, Near real-time global 10 m land use land cover mapping.\nSci Data 9, 251 (2022).\ndoi: 10.1038/s41597-022-01307-4 [4] Peng, C., Knowledge Graphs: Opportunities and Challenges.\nArtif Intell Rev 56, 13071–13102 (2023).\ndoi: 10.1007/s10462-023-10465-9 [5] Allemang, D., & Sequeda, J.\nIncreasing the LLM Accuracy for Question Answering: Ontologies to the Rescue!\n(No.\narXiv:2405.11706) (2024).\narXiv.\nhttp://arxiv.org/abs/2405.11706 [6] Zhao, X., et al.\nAGENTiGraph: An Interactive Knowledge Graph Platform for LLM-based Chatbots Utilizing Private Data.\n(2024) doi: 10.48550/arXiv.2410.11531 [7] Edge, D., et al.\nFrom Local to Global: A Graph RAG Approach to Query-Focused Summarization (2024).\ndoi: 10.48550/arXiv.2404.16130 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n7",
        "16": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Research and Commercialization Expertise - Key Personnel The team at Impact Observatory brings together a wealth of expertise in data science, artificial intelligence, and machine learning, crucial for advancing research and commercialization efforts.\nDr.\nNathan Longbotham, the Head of Product, and Principal Investigator on this project, leads the project team with his specialization in remote sensing and data normalization.\nHis focus on geospatial technologies has driven innovations in various industries, ensuring that the solutions developed are both technically robust and commercially viable.\nDr.\nClair J.\nSullivan, Founder and CEO of Clair Sullivan & Associates, LLC, has a background in generative AI that drives innovative solutions.\nHer experience at GitHub and her leadership in data science at Vail Resorts empower her to translate complex technical concepts into practical applications.\nWith expertise in knowledge graphs and experience with Neo4j, she develops data integration strategies that clarify intricate relationships within datasets Dr.\nSteven P.\nBrumby, CEO/CTO and Co-Founder, complements this expertise with his extensive experience in AI-powered Earth observation data analysis and environmental risk management.\nHis Ph.D.\nin Theoretical Physics, combined with his co-founding of Descartes Labs, positions him as a leader in applying deep learning to global landscape monitoring.\nCombining diverse expertise and strategic partnerships with organizations like Microsoft, OpenAI, Esri, and Planet, this team is well-equipped to enhance situational awareness tools and deliver timely insights to Partner and Allied Nations, government agencies, state and local government, and environmental organizations.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n8",
        "17": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Statement of Work - Phase 1 Project Objectives The Phase 1 project will focus on developing and testing dynamic knowledge graph capabilities to enhance situational awareness in defense environments.\nThe tasks outlined in the table below are strategically aligned to deliver success by focusing on the development of structured geospatial knowledge, the integration of mission-specific data, and the facilitation of user-driven updates.\nTask Objective Success Metrics Build Interactive KG Prototype Develop LLM+KG agents for creating, curating, and analyzing KG for situational awareness and threat detection tailored to Air Force needs.\n● Successful LLM-agent-assisted creation and curation of a KG for situational awareness from ISR datasets verified by subject matter experts.\n● Positive feedback from initial user testing regarding usability and relevance.\nDemonstrate feasibility of Task-Specific Interactive KG Study sources and develop implementation plans to integrate private, mission-relevant data sources to enhance the Sidekick's capabilities for specific operational tasks.\n● Implementation plan for most relevant task-specific KG ISR data sources.\n● Increased user satisfaction in accessing relevant data for specific missions.\nDemonstrate feasibility of User-Driven Updating for Interactive KG Study and test methods for enabling users to perform real-time updates to knowledge graphs, ensuring that the data remains current and relevant.\n● Frequency of user updates and modifications to KGs.\n● Reduction in time spent correcting or searching for data, assessed through user surveys.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n9",
        "18": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Statement of Work - Phase 1 Work Plan Outline Month 1: User-Specific Research Month 2-4: Interactive KG Prototype Development & Task-Specific KG Study Month 5-6: Performance Testing & Refinement Gather insights into end-users' operational needs by engaging with Air Force analysts and decision-makers to identify geospatial and mission-specific data needs.\nMilestones: Complete stakeholder interviews, Identify and document key user requirements and data sources.\nDeliverable: Kickoff Meeting within 30 days of contract start Design and implement a prototype of the geospatial KG, establishing a structured ontology tailored to Air Force needs.\nComplete planning study for task-specific knowledge graphs on best ways to integrate private, mission-relevant data sources.\nDemonstrate functionality within the IO Sidekick platform.\nMilestones: Finalize the ontology design, Complete data integration and prototype demonstration.\nDraft planning study.\nDeliverables: Prototype demonstration, including a summary of the integration process and initial performance metrics.\nTest knowledge graph prototype to evaluate accuracy and responsiveness, refining based on results.\nMilestones:Complete performance testing and evaluation.\nDeliverables: Final Report detailing the prototype, planning study, performance metrics, and future recommendations.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n10",
        "19": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Future Development and Transition Plan We recognize the complexities of transitioning from Phase I - Feasibility to Phase III - Procurement within the Department of the Air Force (DAF).\nOur transition strategy includes: ● Phase I Feasibility Study: The Phase I effort is critical for demonstrating feasibility and refining the direction for future development in Phase II.\nIn Phase I, we will refine requirements and establish Phase II milestones in collaboration with Air Force end-users and stakeholders.\n● Phase II SBIR: The Phase I groundwork will facilitate advanced capabilities in Phase II, ensuring robust data management and enhanced analytical tools that support Air Force operations.\nIn Phase II, we will work closely with the Air Force customer to develop a comprehensive transition strategy for Phase III, addressing funding profiles and contract types to ensure a smooth progression to procurement.\n● Funding Bridge: We will explore possible sources of transition funding if needed during Phase II.\nIntegrating with DAF Customers Our proposed solution aligns closely with the objectives of the Sixteenth Air Force's ISR operations and the Department of the Air Force's Chief Data and Artificial Intelligence Office (CDAO).\nDynamic knowledge graphs will enhance data interoperability and analytics, enabling accelerated access to information critical for ISR operational effectiveness.\nIntegration Considerations - IO will collaborate with customers and end-users to identify the necessary certifications, authorities, clearances, and standards required for a fully mission-capable solution.\nThese requirements will be integrated into our transition plan to ensure compliance and operational readiness.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n11",
        "20": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Commercialization Strategy - Defense Need In defense operations, the ability to make informed, rapid decisions is paramount.\nKnowledge graphs provide a powerful way to structure and integrate diverse data sources, enabling capabilities such as situational awareness, pattern-of-life analysis, threat detection, and targeting operations.\nHowever, for these capabilities to be effective in mission-critical environments, the quality of data in the knowledge graph must be consistently accurate and up-to-date.\n● ● ● ● Accuracy and Speed: Decision-making in defense scenarios must be both accurate and fast.\nThe knowledge graph must reflect the most current and reliable intelligence available, allowing commanders and analysts to act quickly and with confidence.\nAny inaccuracies could lead to mission failure or unintended consequences in high-stakes situations.\nReal-Time Updates: As situations on the ground change, the knowledge graph needs to be updated dynamically to ensure it reflects the most recent intel.\nThis is especially crucial in rapidly evolving operational environments where outdated information can be dangerous.\nDynamic knowledge graphs provide the flexibility needed to incorporate new data and insights in real time.\nHuman Errors and Quality Control: While human analysts are integral to understanding and interpreting data, they are also prone to mistakes or misunderstandings.\nTo mitigate this, it is essential that any changes or updates to the knowledge graph undergo a robust quality control process.\nShow and Tell Approach: This tool employs a \"show and tell\" approach, where the system visually represents data changes through intuitive visuals while providing clear explanations in natural language.\nThis enhances user understanding and allows analysts to grasp complex information quickly, enabling better decision-making.\nThis tool’s customizable nature allows for tailored applications across various defense workflows, making it adaptable for other military branches and defense agencies beyond the Air Force.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n12",
        "21": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Commercialization Strategy - Private Sector Our commercialization strategy focuses on leveraging our interactive knowledge graph technology to meet critical ISR needs within the DoD, other federal agencies, and private sector markets, addressing significant market demands for enhanced data analysis and decision-making capabilities.\nThe following table outlines our priority commercial markets and the potential we see.\nMarket Humanitarian Assistance & Disaster Relief (HADR) Agriculture Monitoring Commercialization Potential The dynamic knowledge graph offers real-time situational awareness for emergency response teams by integrating data from satellite imagery, weather, and reports.\nIdeal for emergency response, coordinating resources, and recovery efforts.\nThis new product would complement our prior market experience in emergency response, further enhancing our ability to provide solutions in this sector.\nIn agriculture, particularly in developing regions, dynamic KGs will provide farmers and agricultural officials with direct access to critical information on crop health, yield estimation, and seasonal planning.\nBy consolidating and structuring this data, Sidekick with KG functionality will improve decision-making for crop management and resource allocation, reducing dependency on specialized knowledge.\nNatural Resources Supply Chain Monitoring Interactive KGs integrated into Sidekick will also support governments, industry, and NGOs monitoring high-risk areas for resource management, flood mitigation, deforestation and wild-fire risk, and habitat health.\nThese KGs will allow users to access relevant environmental data without requiring technical expertise, empowering organizations to independently monitor and respond to ecological changes.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n13",
        "22": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Related Work (Dual-Use) The following Impact Observatory efforts are directly related to the proposed effort, including past and parallel work conducted by the Principal Investigator (PI), the proposing firm, and consultants.\nWe will coordinate with outside sources to ensure alignment with Defense customers’ needs and to establish a solid technical baseline.\nBelow is a summary of relevant activities: Activity Description Client POC Completion Date NGA SBIR Direct-to-Phase 2 and Sequential Phase 2 - Automated Global Land Cover and Change Monitoring Sandy Brusiloff / 303-330-9534 15Jul2022 - 14Jan2025 Esri - Sentinel-2 10m land use/land cover time series of the world.\n2017 - 2024 Sean Bryer / 909-369-2869 Recurring annual project to develop new global land cover for Esri Living Atlas Bill and Melinda Gates Foundation - Providing Foundational Earth Observation Insights for Agriculture in Low- and Middle-Income Countries (including LLM interface for field users) Stewart Collis / stewart.collis@gatesfoundation.org [Pending Award] These activities demonstrate our capability and preparedness to advance the proposed project while ensuring compliance with AFI 61-201 and AFRL/CA guidelines.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n14",
        "23": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Clearances/Certifications/Approvals/Registrations Registrations UEI CAGE MNHTKV6Z58P7 8QGM3 SBA SBIR/STTR ID SBC_001832943 Foreign Citizens Impact Observatory will not engage foreign nationals on this project.\nFacilities/Equipment Impact Observatory confirms that the facilities where the proposed work will be performed meet environmental laws and regulations of federal, state, and local governments.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n15",
        "24": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Technical Data Rights Assertions Data/Software Furnished with Restrictions Basis for Assertion Asserted Rights Category Name of Person or Organization Asserting Restriction SBIR Demonstration Data and Final Report None None N/A IO Ground Truth Dataset IO 3m LULC Model IO 10m LULC Model IO 30m LULC Model IO Contextual Change Detection Algorithm IO Imperviousness Algorithm IO Sidekick system - web app and web services software and all underlying AI models and data IO Sidekick Training Dataset See additional detail in Volume 5 attachment Developed exclusively at private expense Restricted Rights (Software) Steve Brumby, CEO, Impact Observatory, Inc.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n16",
        "25": "Impact Observatory Proposal Number Air Force DoD SBIR 2024.4: F244-0001-0081 LLM-powered Interactive Knowledge Graphs for Situational Awareness Volume 2 Technical Volume Budget Overview (See additional details in Volume 3) Cost Category Direct Labor Other Direct Costs Fringe EOH G&A Profit Total Amount Notes $ 48,879.80 $ 44,250.00 $ 6,354.37 $ 11,753.83 $ 20,690.27 $ 5,277.13 $ 137,205.41 See table below 13.00% 21.28% 18.60% 4.00% Other Direct Costs Amount Notes Subcontractor Costs $ 36,000.00 Knowledge Graph expert Dr.\nClair Sullivan OpenAI Tokens $ 4,750.00 Travel $ 3,500.00 One domestic trip for 2 people (airfare, lodging, meals, incidentals) to visit Air Force contract contact Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this volume.\n17",
        "26": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address F244-0001-0081 AF244-0001 Impact Observatory Knowledge Graphs for Situational Awareness 11/06/2024 10:59:55 AM Impact Observatory, Inc 3640 Brandywine St, NW, Washington, District of Columbia, 20008 Website Address www.impactobservatory.com UEI Duns Cage MNHTKV6Z58P7 117601577 8QGM3 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 18.6%) x Base (TDL+TDM+TOH+TDT+TSC1) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (4%) Total Estimated Cost TABA Year 2 Summary $137,205.40 $137,205.40 $0.00 $0.00 $0.00 $66,988.00 $4,750.00 $0.00 $0.00 $3,500.00 $0.00 $20,690.27 $95,928.27 $36,000.00 $36,000.00 -$0.00 $5,277.13 $137,205.40 $0.00",
        "27": "Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 18.6%) x Base (TDL+TDM+TOH+TDT+TSC1) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Atmospheric and Space Scientist/ Principal Investigator Computer Occupations, All Other/ Product Designer Software Developer/ Software Engineer Subtotal Direct Labor (DL) Labor Overhead (rate 21.28%) x (DL) Total Direct Labor (TDL) Subcontractor Costs Subcontractor- Knowledge Graph Subject Matter Expert Subcontractor/Consultant Budget Information Category / Individual-TR $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $135.87 190 $61.41 180 $92.39 130 13 13 13 $3355.99 $29,171.29 $1436.99 $12,490.79 $1561.39 $13,572.09 $55,234.17 $11,753.83 $66,988.00 Rate/Hour Estimated Hours Cost Computer and Information Research Scientist (Knowledge Graph Subject Matter Expert) $200.00 180 $36,000.00 Subtotal Subcontractor Labor (SL) Other Direct Cost Type | Total Subcontractor Other Direct Costs 1 Total Subcontractor Costs (TSC) 1 $36,000.00 Vendor Cost $0.00 $36,000.00",
        "28": "Total Subcontractor Costs (TSC1) Direct Material Costs Input Tokens Output Tokens Total Direct Material Costs (TDM) Direct Travel Costs AirForce POC Trip Total Direct Travel Costs (TDT) G&A (rate 18.6%) x Base (TDL+TDM+TOH+TDT+TSC1) Cost Sharing Profit Rate (4%) Total Estimated Cost TABA Year 2 Direct Labor Costs Category / Individual-TR Atmospheric and Space Scientist/ Principal Investigator Subtotal Direct Labor (DL) Labor Overhead (rate 21.28%) x (DL) Total Direct Labor (TDL) Subcontractor Costs Subcontractor- Knowledge Graph Subject Matter Expert Knowledge Graph Subject Matter Expert Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC1) Direct Material Costs Input Tokens Total Direct Material Costs (TDM) Direct Travel Costs No Trip Total Direct Travel Costs (TDT) G&A (rate 18.6%) x Base (TDL+TDM+TOH+TDT+TSC1) Cost Sharing Profit Rate (0%) $36,000.00 $3,505.00 $1,245.00 $4,750.00 $3,500.00 $3,500.00 $20,690.27 -$0.00 $5,277.13 $137,205.40 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $135.87 0 13 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00",
        "29": "Total Estimated Cost TABA Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Katherine Densmore Phone: (703) 725-7894 Phone: katy@impactobservatory.com Title: Proposal Owner $0.00 $0.00 If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: No Select the Type of Payment Desired: Partial payments",
        "30": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Atmospheric and Space Scientist Principal Investigator PhD Computer Occupations, All Other Product Designer Software Developer Software Engineer Bachelor's Degree Master's Degree 15 7 7 190 $135.87 13 $29,171.29 180 $61.41 13 $12,490.79 130 $92.39 13 $13,572.09 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nLabor charges were calculated based on current average salaries for these positions within Impact Observatory.\nSee detailed spreadsheet for breakdown by task, month, and category.\nLabor rate Documentation: • VOL3 COST VOLUME_ADoD SBIR 2024.4 F244-0001-0081_Impact Observatory 2024.xlsx Direct Labor Cost ($): Year2 $55,234.17 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Atmospheric and Space Scientist Principal Investigator PhD 15 0 $135.87 13 $0.00 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nThere is no direct labor for Year 2 as this is a 6 month period of performance.\nBreakdown of Fringe, G&A, and Overhead rates are in the attachment here.",
        "31": "Labor rate Documentation: • IO Current Rates Update Sep 2024 (FFG Accounting).xlsx Direct Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) Apply Overhead to Direct Materials Cost?\nApply Overhead to Direct Travel Cost?\nOverhead Comments: Overhead is calculated from the following cost sources: Overhead Labor, Cloud Computing Resources, Software Subscriptions, Office Equipment and Supplies, Web Hosting Fees, Conferences, R&D, Consultants and General Legal Fees.\nSee spreadsheet attachment of IO Current Rates in previous section to see breakdown and calculation of overhead costs.\nOverhead Cost ($): Year2 Labor Cost Overhead Rate (%) Apply Overhead to Direct Materials Cost?\nApply Overhead to Direct Travel Cost?\nOverhead Comments: Overhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): $0.00 $55,234.17 21.28 NO NO $11,753.83 21.28 NO NO $0.00 $11,753.83 18.6",
        "32": "Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Subcontractor Costs?\nApply G&A Rate to Direct Material Costs?\nApply G&A Rate to ODC- Travel?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nOverhead is calculated from the following cost sources: G&A Labor, Office Rent, Office Supplies & Shipping, Bank & Interest Charges, Business Insurance, General Travel/M&E, Payroll Fees, Professional Fees, Marketing, Taxes and Licenses.\nSee spreadsheet attachment of IO Current Rates in previous section to see breakdown and calculation of G&A costs.\nG&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Subcontractor Costs?\nApply G&A Rate to Direct Material Costs?\nApply G&A Rate to ODC- Travel?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Sum of all G&A Costs is ($): Subcontractor/Consultants YES YES YES YES YES $20,690.27 18.6 YES YES YES YES YES $0.00 $20,690.27",
        "33": "Base Subcontractor/Consultant: Knowledge Graph Subject Matter Expert Budget Contact Name Budget Contact Title Budget Contact Phone Budget Contact Email Dr.\nClair Sullivan Principal (571) 296-5287 clair@clairsullivan.com Do you have a letter of commitment from the subcontractor/consultant?\nDocument uploaded for the letter of commitment: • AF letter of commitment.pdf Are you able to provide detailed budget information for this subcontractor/consultant?\nYES YES Total Cost($) : $36,000.00 Detailed Budget Information Labor Category Description Hours Rate Cost Computer and Information Research Scientist Knowledge Graph Subject Matter Expert 180 $200.00 $36,000.00 Additional Costs Type Amount Explanation Overhead: G&A: Profit: Category Description Vendor Cost Other Direct Costs Year2 Subcontractor/Consultant:",
        "34": "Knowledge Graph Subject Matter Expert Budget Contact Name Budget Contact Title Budget Contact Phone Budget Contact Email Dr.\nClair Sullivan Principal (571) 296-5287 clair@clairsullivan.com Do you have a letter of commitment from the subcontractor/consultant?\nProvide an explanation of any contact you have had with the subcontractor/consultant as to their availability to perform the proposed work.\nThere is no commitment needed in Year 2 as this is a 6 month period of performance.\nAre you able to provide detailed budget information for this subcontractor/consultant?\nTotal Cost($) : Do you provide the authority to the Government to contact this Budget Contact?\nNO NO $0.00 YES Total Subcontractors/Consultants Cost ($): $36,000.00 ODC-Materials Base Description: Input Tokens Vendor: OpenAI Total Cost($): $3,505.00 Competitively Sourced?\nyes Quantity: 1402 Consumable?\nyes Exclusive for this Contract?\nno Supporting Comments: Supporting Documents: • ODC - OpenAI Token Costs.pdf Description: Output Tokens Vendor: OpenAI Quantity: 166 Consumable?\nyes Exclusive for this Contract?\nno Total Cost($): $1,245.00 Competitively Sourced?\nyes",
        "35": "Supporting Comments: Supporting Documents: • ODC - OpenAI Token Costs.pdf Year2 Description: Input Tokens Quantity: 0 Consumable?\nyes Exclusive for this Contract?\nno Supporting Comments: There is no ODC in Year 2 as this is a 6 month period of performance.\nODC-Travel Base Description: AirForce POC Trip Vendor: OpenAI Total Cost($): $0.00 Competitively Sourced?\nyes Location From: Washington DC Location To: Patterson AFB, Ohio Number of People: 2 Number of Days: 3 Purpose of Trip: The purpose of this trip is to enable two (2) Impact Observatory team members (including the Principal Investigator) to visit the Air Force contract point of contact to better understand the requirements of the customer and brief them on the outcomes of this Phase I SBIR in anticipation of a potential Phase 2.\nTotal Airfare Costs ($): $1,500.00 Total Car Rental Costs ($): $500.00 Total Per Diem Costs ($): $1,134.00 Total Other Costs ($): $366.00 Total Costs ($): $3,500.00 Purpose of Trip: The purpose of this trip is to enable two (2) Impact Observatory team members (including the Principal Investigator) to visit the Air Force contract point of contact to better understand the requirements of the customer and brief them on the outcomes of this Phase I SBIR in anticipation of a potential Phase 2.\nSources of Estimates: Airfare and Car Rental estimates were based on average prices from travel booking providers for a three (3) day trip during the week.\nPer Diem is based on the GSA rates for Dayton, Ohio where Wright-Patterson AFB is located.\nAnd Total Other costs is to account for any miscellaneous business and travel costs (e.g.\nto and from the home airport) for two (2) travelers.\nExplanation/Justifications: As required, one trip has been budgeted for 2 Impact Observatory team members to visit the Air Force contract point of contact.\nYear2",
        "36": "Description: No Trip Location From: N/A Number of People: 0 Location To: N/A Number of Days: 0 Purpose of Trip: There is no travel planned in Year 2 as this is a 6 month period of performance.\nTotal Airfare Costs ($): $0.00 Total Car Rental Costs ($): $0.00 Total Per Diem Costs ($): $0.00 Total Other Costs ($): $0.00 Total Costs ($): $0.00 Purpose of Trip: There is no travel planned in Year 2 as this is a 6 month period of performance.\nSources of Estimates: There is no travel planned in Year 2 as this is a 6 month period of performance.\nExplanation/Justifications: There is no travel planned in Year 2 as this is a 6 month period of performance.\nODC-Summary Base Do you have any additional information to provide?\nYear2 Do you have any additional information to provide?\nProfit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): NO NO -$0.00 4 Profit Explanation: We are applying a 4% profit rate to the Impact Observatory SBIR Proposal F244-0001-0081 “LLM-powered Interactive Knowledge Graphs for Situational Awareness” to align with the SBA SBIR Policy Directive, which emphasizes incorporating a reasonable fee or profit in funding agreements.\nThis profit margin reflects standard industry practices and acknowledges the investment of resources and risk involved in developing and transitioning our innovative solutions for Army needs.\nBy including this profit rate, we ensure our proposal meets the government's requirements and supports our long-term sustainability and growth.\nTotal Profit Cost ($): $5,277.13",
        "37": "Year2 Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Total Proposed Amount ($): - 0 $5,277.13 $137,205.40",
        "38": "Katherine Densmore, Impact Observatory, Inc Oct 16, 2024 Oct 16, 2025"
    },
    "images": [
        {
            "page": 9,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page9_img1.jpeg",
            "hash": "9d23e08c697be31c",
            "position": "Middle Center"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page12_img2.jpeg",
            "hash": "8277b8dde58a9d08",
            "position": "Middle Right"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page12_img3.jpeg",
            "hash": "faa69913e67802b9",
            "position": "Bottom Right"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page12_img4.jpeg",
            "hash": "8e03732ebc1973e4",
            "position": "Middle Right"
        },
        {
            "page": 13,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page13_img2.jpeg",
            "hash": "faa69913e67802b9",
            "position": "Middle Right"
        },
        {
            "page": 13,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page13_img3.jpeg",
            "hash": "e09f3104bce93e36",
            "position": "Middle Center"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page14_img1.jpeg",
            "hash": "cc1b3b35b21b2656",
            "position": "Bottom Right"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page14_img2.jpeg",
            "hash": "ae5ab565ca25c26a",
            "position": "Middle Center"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page14_img3.jpeg",
            "hash": "f0b1a4ce86cb95ca",
            "position": "Middle Right"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page16_img1.jpeg",
            "hash": "b5c20739e0db8d3c",
            "position": "Middle Left"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page16_img2.jpeg",
            "hash": "ccc6333326cbcc9c",
            "position": "Bottom Left"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page16_img3.jpeg",
            "hash": "b9ce646e919a2ea1",
            "position": "Middle Left"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB74535351fb282c1979702e23eeeb4a307f742543c27f150f3462a3dcddb31dbcd569a5_page19_img1.jpeg",
            "hash": "82c5c5f8dd80f8a7",
            "position": "Top Left"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "impactobservatory.com",
        "name": "N/A",
        "phone": "N/A"
    }
}