{
    "filename": "docNAC01FB7453531a9bae4964b0168c33503fd1163dceb9ec0ea421e6c150868b446cad47e0ccb6.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0005 Proposal nForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Title: Editor Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: Effective Automation Systems Inc (DBA nHansa) Address: Website: UEI: DUNS: CAGE: 1014 Narciso Ct -, San Jose, CA 95129-1111 http://www.nhansa.com S5YEALJFBWY7 943516443 06SL3 SBA SBC Identification Number: 000152255 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 5 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_000152255 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation:",
        "3": "• SBC_000152255.pdf 5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [X] Asian [ ] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Title Business Name Date",
        "4": "Srini Srinivasan Srini Srinivasan President Effective Automation Systems Inc 02/08/2022 (DBA nHansa) Audit Information Summary: Has your Firm ever had a DCAA review?\nWas your accounting system approved by the auditing agency?\nWas a rate agreement negotiated with the auditing agency?\nWas an overhead and/or cost audit performed?\nYES Last Audit Date: 05/01/2021 YES Last Update Date: 05/01/2021 YES Last Update Date: 05/01/2021 YES Date of Overhead Audit: 05/01/2021 Date of Cost Audit: 05/01/2021 Are the rates from the audit agreement used for this firms proposal?\nYES Firm Information: Agency Firm: Address: Point of Contact (POC) Name: POC Phone: POC Email: Upload a copy of the audit information: • nHansa_DCAA_AuditLetter2021.pdf DEFENSE CONTRACT AUDIT AGENCY 2105 S.\nBASCOM AVENUE, SUITE 310 CAMPBELL , California 95008 Acacia Rodriguez (571) 448-5643 oacacia.rodriguez@dcaa.mil VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6",
        "5": "Technical Abstract: Modern defense systems are complex with many subsystems and components, highly distributed, separately maintained and operated, yet required to collaborate together with complex dependencies.\nTraditional methods including relational databases are not equipped to capture, maintain, analyze and exploit these complex relationships.\nWe had previously demonstrated and transitioned a graph-based approach to handling such a scenario to a large U.S.\nAir Force program.\nWhile our previous approach enabled import and visualization from diverse data sources and was highly scalable, it was not interactively editable.\nThere is a need for allowing user inputs that would enhance both the current accuracy of the underlying model by capturing implicit relationships as well as allow its schema to incrementally develop in a manner beneficial to the needs of the program.\nWe propose to enhance nForge, our schema-based scalable graph framework to nForge Pro, to allow for interactive user inputs and incremental updates.\nnForge Pro shall also discover other potential changes to data or schema based on user inputs.\nThese discovered changes will be presented to the user to approve or reject, thus allowing the incremental evolution of the embedded rule-based knowledge graph.\nUser approved decisions will be further codified using the nForge rules engine, allowing for continuous learning.\nnForge Pro will be initially demonstrated in the context of system engineering challenge involving system design and maintenance, but can be used in a wide variety of applications requiring dynamic knowledge graphs.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: The potential impact of nForge Pro extends beyond systems engineering.\nMany platforms within the Department of Defense, such as ships, vehicles, drones, and aircraft maintained by the Navy, Army, and Air Force, can benefit from this technology.\nThe technology can be used to analyze the interactions and dependencies within and among of these platforms, which is critical to ensure that they operate safely and effectively.\nMoreover, the technology can also be applied to the analysis of commercial industrial applications such as nuclear, chemical, and mining that must operate with multiple environmental and safety considerations.\nSince these systems and platforms are large, installed at several sites, and maintained over several decades, even small improvements in understanding and analysis will result in significant cost savings over the lifetime of the programs.\nIn addition, the increased efficiency and accuracy of analysis can help reduce the risk of accidents, which can have significant economic and human costs.",
        "6": "Attention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: Dynamic Knowledge Graph, Interactive Digital Engineering, Adaptive Data Modeling, Data Analysis, Big Data Analytics, Graph Database, Adaptive Schema, Intelligent Recommendation Engine VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 100% 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES 3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES NO 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO",
        "7": "components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, YES release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO 16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n50% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES VOL I - Contact Information Principal Investigator Name: Srini Srinivasan Phone: (408) 480-7707 Email: srini@nhansa.com Address: 1014 Narciso Ct -, San Jose, CA 95129 - 1111 Corporate Official Name: Srini Srinivasan Phone: (408) 480-7707 Email: srini@nhansa.com Address: 1014 Narciso Ct -, San Jose, CA 95129 - 1111 Authorized Contract Negotiator Name: Srini Srinivasan",
        "8": "Phone: (408) 480-7707 Email: srini@nhansa.com Address: 1014 Narciso Ct -, San Jose, CA 95129 - 1111 Form Generated on 10/23/2024 13:51:39",
        "9": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor Volume 2: Technical Volume (Standard Topics) This proposal includes data that must not be disclosed outside the Government and must not be duplicated, used, or disclosed - in whole or in part - for any purpose other than to evaluate this proposal.\nIf, however, a contract is awarded to this proposer as a result of–or in connection with–the submission of this data, the Government has the right to duplicate, use, or disclose the data to the extent provided in the resulting contract.\nThis restriction does not limit the Government's right to use information contained in this data if it is obtained from another source without restriction.\nThe data subject to this restriction are contained in pages 1-6, & 8-10.\n1.\nIdentification and Significance of the Problem or Opportunity Graph databases have proven very useful in a wide variety of applications ranging from social networks to large scale systems engineering and operation.\nModern commercial off-the-shelf (COTS) and open-source graph databases have been shown to be highly scalable in deployment.\nFor example, Netflix's recommendation engine relies heavily on graph databases to construct a knowledge graph.\nBy utilizing a knowledge graph consisting of billions of nodes, it can analyze the relationships between users and movies, and suggest content tailored to individual preferences.\nIn our prior nForge project1, working in collaboration with the System Integrator, Lockheed Martin, we successfully demonstrated and transitioned nForge to the F-35 Air Force Program.\nnForge uses a schema layer, appropriate for systems engineering, on top of an open-source graph database (Apache Tinkerpop).\nUsing nForge, we demonstrated constructing, traversing and querying knowledge graphs with nodes representing elements of a large-scale system and edges representing their relationships.\nThe high-level goal is illustrated in Figure 1, while a more detailed summary of the goals, approach and results of the nForge project is included in Attachment A.\nFigure 1: nForge Goal 1 AF SBIR Topic AF141-056, Program Manager: Steve Drager, AFRL, Rome NY Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 1 of 25",
        "10": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor Some representative elements in our demonstrated database were: hardware components (chassis, boards, networks), software components (subsystems, modules, libraries, call graphs), interconnect data (signal databases, system level events), test results and much more.\nWe also developed a system engineering database generator that generates representative databases, models, and even C++ code representative of the program’s at-scale data for testing and demonstration.\nnForge project focused on the automated import of data from a wide variety of data sources, and the construction, querying and visualization of a knowledge graph.\nIt answered important questions during the Technical Review sessions related to systems engineering, integration testing and performance evaluation.\nTo increase its usefulness, and fully realize its potential, the following are needed: • additional interactive user-defined data overlays to make the graph more useful to a wider variety of data analysis; based on user interaction, automated changes should be suggested, such as – additional relationships, tagging of information gaps and conflicting information • as the system design and the corresponding data evolve, allow the user to make incremental changes, resulting in automated suggestions.\nnForge currently requires a re-import of data, and sometimes a redefinition of the underlying schema Specifically, nForge Pro shall allow user interaction and facilitate intelligent editing.\nThis capability is highly valuable for knowledge graphs, rendering them highly dynamic and responsive to intelligent user customization, resulting in significant time savings in the construction of complex queries.\nIn the context of systems engineering and systems analysis, nForge Pro interactive editing capability is needed to enable the following, resulting in significant cost benefits to the program: • Allow interactive definition of end-to-end system events, spanning multiple system elements; based on user interaction, identify additional events.\nOnce such events are defined, perform worst-case and average case response time analysis • Enable interactive experimentation of software to hardware binding to create multiple alternative system configurations to be considered and evaluated in parallel.\nConduct speed and spare-capacity trade-offs of such configurations • Enable the definition of multiple system tests, and managing the test configuration, execution and results collation.\nEvaluate system robustness under stress, and detection of abnormal events • Enable resource dependency analysis – e.g., identify bottlenecks at networks or memory cache (in a multi-core configuration) by allowing the user to tag explicit and implicit dependencies For system deployment and operation scenarios widely encountered in DoD applications, nForge Pro knowledge graph editing capability can: • Enable an effective situational awareness and threat detection capability, by tagging explicit and implicit sequences of system events (CONOPS 2.2 in Section 2) • Allow tagging of deviations from “normal” behavior, thus enabling a more robust automation of Pattern of Life (PoL) analysis (CONOPS 2.1 and 2.2 in Section 2) • Enable the interactive and automated definition of triggers or responses across system elements, thus improving targeting operations (CONOPS 2.1 in Section 2) Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 2 of 25",
        "11": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor 2.\nPhase I Technical Objectives Our Phase I technical objectives are to: (a) define the technical requirements (b) develop a preliminary design (c) both of the above shall be based on a rapid prototype demonstration in the context of chosen Concept of Operations (CONOPS), relevant to the Program (d) identify a suitable challenge problem for Phase 2 demonstration (e) incorporate feedback from the Project Manager into all of the above deliverables We have extensive prior experience with knowledge graphs in designing and developing nForge, and successfully applying nForge to a large-scale U.\nS.\nAir Force program.\nThis experience coupled with focused nature of the proposed nForge Pro project will significantly increase the chance of accomplishing our technical objectives.\nWe will also utilize our automated data generator to generate representative data for the challenge problem, enabling an at-scale demonstration.\nnForge Pro will enhance the capabilities of nForge.\nIn Phase I of the proposed project, we will explore, design and demonstrate technical approaches to enable editing of knowledge graphs, as well as allowing for automated suggestions and execution of those suggestions based on user changes.\nIn this section, we will identify the two Concept of Operations (CONOPS) for the proposed nForge Pro capabilities that will result in a prototype demonstration during Phase 1.\nThe two CONOPS have been chosen in order to outline our initial thoughts on the requirements and preliminary software design; this will result in high confidence that our design and technical approach is well equipped to handle the following generic scenarios of knowledge graph editing: • updating the graph’s underlying ontology/schema, • inferring additional edges between nodes, • highlighting conflicting information in the graph, • highlighting information gaps, and • • suggesting additional changes to the graph because of the user’s modifications codifying rules from above and embedding them in the graph for future use 2.1.\nConcept of Operations: Define and analyze end-to-end system response to a trigger This scenario occurs in many DoD systems, ranging from systems engineering to threat detection and targeting operations.\nIn a Systems Engineering context, the user may interactively identify a causality graph through systems elements representing system response; anomaly detection to counter-measure deployment.\nOnce such a path through system elements has been defined by the user, several performance analyses could be conducted through the query of the resulting knowledge graph: worst-case and average response times, resource utilization, redundancy and failure recovery etc.\nData needed for these analyses could also be tagged, with data sources specified and automatically imported.\nWe demonstrated this CONOPS in the nForge project (shown in Figure 2), importing all the required data from the program’s database files.\nIn System Operations context, a similar path could be identified through System of Systems representing a causality graph from threat detection to targeting operations.\nIn this CONOPS, the nodes in the graph could be very diverse system elements – ranging from SIGINT elements, human operators and Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 3 of 25",
        "12": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor autonomous systems.\nKnowledge graph queries could span different types of concerns: from response times, failure recovery to risk profiles – including collateral impacts.\nFigure 2: Example End-to-End Event in a Knowledge Graph Initial thoughts on the requirements and interface design for this CONOPS: • nForge Pro shall allow user to interact with the a populated ‘million-node’ knowledge graph, to define ‘virtual overlays’ of flows through the system elements.\no User should be able to edit underlying data model or data instance • There shall be an option to ‘start’ and ‘stop’ recording and therefore learning the changes so that similar changes can be automatically inferred.\no We shall explore latest advancements in interfaces that incorporate automated suggestions in documents (Copilot) and code (Cursor).\nAlthough these the specific tools are based on Artificial Intelligence while our approach is primarily rule-based, much inspiration can be drawn on the interfaces they employ to simplify user interactions.\n• nForge Pro shall also recommend changes to the underlying model to simplify changes and can enable faster graph traversals • Once a path has been defined, representative analysis (e.g., average response time) can be demonstrated using statistical techniques and embedded data.\nFor example, user may be interested in average response time of a sense to shoot time response that takes into account signal propagation delays, resource contention delays etc.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 4 of 25",
        "13": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor 2.2 Concept of Operations: Improve situational awareness with enumeration of modes Mode is an important abstraction in the understanding of system operation, and contributing to improved situational awareness.\nKnowledge graphs are especially well suited to describe and analyze deeper understanding of the system operating modes.\nModes play an important part on DoD systems, ranging from individual platforms such as aircraft and ships to System of Systems.\nIn the context of Systems Engineering for a sophisticated air platform, such as F-35, it is important that modes (e.g., Takeoff, Landing, Drill, Recon) and the transition between them should be handled correctly and understood well.\nThey can then be designed, developed, tested and verified.\nIn the context of System Operation, modes and sub-modes may represent a large number of required collections of internal states for the system sub- components.\nFor example, as shown in Figure 3, Dynamic Targeting consists of six distinct steps (or system modes): find, fix, track, target, engage, and assess (F2T2EA) as explained in AFTTP 3-2.3, Multi-Service TTP for Dynamic Targeting.\nThis method referred to as F2T2EA or colloquially as the “kill chain.” A deeper understanding of the modes in terms of internal system component states and the steps required to transition between them is essential for robust system operation.\nFigure 3: Dynamic Targeting (Air Force Defense Doctrine) Initial thoughts on the requirements and interface design for this CONOPS: • nForge Pro shall allow user to define a knowledge graph representing modes and associated system component states.\nThe nodes and connection types (and instances of those types) can be defined by the user, allowing for maximal flexibility in the definition of modes.\n• For any pair of modes, a transition action can be defined; this shall represent a sequence of actions; such actions can have precedence constraints, conditional branching or independent parallel paths that may join or split.\n• Additional fields for record keeping such as error counters and statuses that may represent observed anomalies can be added to the transition action and their constituent steps.\n• This demonstration shall be conducted using a well populated at-scale knowledge graph Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 5 of 25",
        "14": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor 3.\nPhase I Statement of Work (SOW) 3.1 Scope During the Phase 1 effort, we shall define the requirements and design of the workbench, nForge Pro, the scalable knowledge graph with interactive, intelligent editor.\nWe shall also implement an initial prototype and identify a challenge problem to be used during Phase 2.\nThese activities are designed to lay a strong foundation and build a roadmap for the Phase 2 effort.\n3.2 Task Outline The Phase I work will be divided into the following subtasks: Task 1.\nRequirements Specification of Major Capabilities We shall specify the requirements of the proposed workbench.\nThe result will be a Requirements Document, identifying the concepts of operation (CONOPS).\nThis document shall be submitted for review to the Program Manager.\nTask 2.\nDesign of Major Capabilities We shall design the proposed workbench.\nThe result will be a Design Document, identifying major tools and technologies used as well as the data and control flow.\nThis document shall be submitted for review to the Program Manager.\nTask 3.\nIdentification of Challenge Problem We shall study suitable avionics programs and identify the specific subsystems and data artifacts to be used in Phase 2 demonstration.\nThe result will be a Challenge Problem Specification Document.\nThis document shall be submitted for review to the Program Manager.\nTask 4.\nInitial Prototype We shall implement an initial prototype of the proposed workbench with chosen software components.\nThe prototype implementation shall be demonstrated to the Program Manager.\nTask 5.\nIncorporate Feedback We shall incorporate any revisions and Program Manager feedback into the results of tasks 1,2,3 and 4.\nTask 6.\nPreparation of Final Report We shall prepare a final report documenting the Phase 1 experiences, including final revisions of all Phase 1 documents and outlining a proposed roadmap for Phase 2.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 6 of 25",
        "15": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor 3.3 Technical Milestone Schedule The milestones and deliverables are shown in the task schedule in Figure 2 below.\nFigure 4: Proposed Task Schedule 3.4 Deliverables and Milestones The due dates for all of the Phase I deliverables and milestones are listed below: ID D1 D2 D3 D4 D5 D6 D7 D8 Description Kickoff meeting Progress Reports Technical Review Requirements Document V1 Design Document V1 Challenge Problem Specification Document V1 Initial Prototype Demonstration Phase I Final Report with SF 298 Due Date 1 MAC 3,6 MAC 4 MAC 3 MAC 4 MAC 4 MAC 4 MAC 6 MAC Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 7 of 25",
        "16": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor 4.\nRelated Work 4.1 Our prior work with knowledge graphs and U.S.\nAir Force applications nForge: A Graph-Based System Engineering Workbench This prior project was funded under a SBIR program, and successfully developed and transitioned the nForge tool to the F-35 program during Phase 1, 2 and subsequence Phase 2 Enhancements.\nnForge is a generalized data repository, with layered, scalable, customizable tool architecture.\nnForge includes a set of facilities to keep multiple data sources and models complete and consistent with each other.\nThese facilities enable: • Seamless import/export with popular, widely used tools • Proven scalability from supporting infrastructure for distributed teams with large and diverse data sets • Unifying semantics, represented by a simple yet powerful data model, onto which multiple models can be mapped These facilities have been demonstrated to implement an \"integrated multi-view\" vastly improving current ad-hoc practices.\nnForge was developed in partnership with Lockheed Martin Aeronautics, and funded by the U.S.\nAir Force.\nnForge was tested and demonstrated using a sanitized subset of the F-35 program dataset.\nThis demonstration included importing and navigating the C++ code base; importing, constructing and navigating multiple models of: messaging, call graphs, multi-threading, hardware-to- software allocation, execution time test results, schedulability analysis, end-to-end system thread analysis, interactive allocation and re-allocation of software to hardware, studying its impacts, quantitative modeling and incorporation of memory cache interference when using modern multi-core architectures and more.\nnForge features include: Enhanced Modeling nForge enhanced modeling improves the system development and sustainment operations by • • capturing and enforcing constraints and rules within models and datasets capturing and enforcing consistency of overlapping concepts across models and datasets using rules • presenting one unifying reality Programmable Adapters nForge maintains its own Graph model, onto which multiple datasets and models are mapped via adapters.\nAdapters have been deployed for C++ source code, Microsoft Excel sheets, XML format files, as well as nVision, nTrace and nLoad datasets.\nExperimental adapters for UML, SysML and AADL and corresponding tools exist, and we are seeking motivated customer funding.\nCustom adapters can be created using nForge API.\nQueries and Visualization nForge includes an Application Programming Interface (API) using which powerful custom queries and visualizations can be created.\nnForge API can be programmed in Java, Javascript, Groovy, Python, or nForge Language.\nIn addition, the nForge API makes the entire Apache Gremlin graph traversal language available, using which highly scalable graphs can be created, manipulated and visualized.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 8 of 25",
        "17": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor The screen image below is representative of an \"integrated view\" created by parsing C++ source code, importing signal databases, lab test results, and allocation strategies.\nThis data is still all maintained in separate Excel and XML files, but has been made highly navigable.\nFigure 5: nForge System Engineering Knowledge Graph 4.2 References on Graph comparison and Graph editing In this section, we will highlight a few sources of technical inspiration for our approach.\nThese references can be classified as graph comparison/navigation and graph editing/automation.\nGraph comparison/navigation: Yan Yuchen2 proposed a family of algorithms (DINGAL) for knowledge graph alignment, addressing how to efficiently update entity embeddings for an evolving graph.\nThis algorithm could be useful in both the CONOPS (end-to-end events, modes) we identified earlier.\nWe shall explore how the semantics of the user edits can be maintained even as the underlying graphs continue to evolve.\nNechasky3 proposed an approach to knowledge graph visual exploration based on the concept of shareable and reusable visual configurations.\nA visual configuration comprises domain specific views on 2 Yan, Yuchen et al.\n“Dynamic Knowledge Graph Alignment.” Proceedings of the AAAI Conference on Artificial Intelligence, vol.\n35, no.\n11, 2021, pp.\n10112–10119., 3 Nechasky, Martin, and Stepan Stenchlak.\n\"Interactive and iterative visual exploration of knowledge graphs based on shareable and reusable visual configurations.\" International Journal of Human-Computer Studies, vol.\n163, 2022, pp.\n102839., Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 9 of 25",
        "18": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor a knowledge graph which define operations such as node detail or expansion.\nOnce again, this approach may be highly applicable to both our CONOPS outlined earlier.\nWe shall explore how to automatically simplify the navigation and presentation of our large graph (consisting of millions of nodes) along events and modes, for example.\nGraph edit and automation: There aren’t many existing tools for editing very large graphs and diagramming tools.\nExisting diagramming tools (like Microsoft PowerPoint, Visio) work well with small, specialized diagrams.\nLarge graph visualization tools (including our own nForge), do not handle interactive editing well.\nyEd4 from yWorks is a graph editing product.\nSome of the features it supports include: automatic graph layout (already supported by our nForge), large graph visualization, custom visualization and graph analysis (already supported by nForge).\nWe will investigate the unsupported features and adopt them into nForge Pro as appropriate.\nCursor5 is a code automation editor built on VS Code with advanced AI capabilities.\nIt uses GPT- 4 and other AI models to understand and generate code, offering code completion, error correction, and natural language commands.\nIt works with multiple languages, e.g.: JavaScript, Python, and TypeScript.\nCursor analyzes the codebase for context and can use natural language processing for plain English commands to provide smart code completion and generation.\nWe will draw inspiration from Cursor interface to implement knowledge graph edit automation based on user edits and guidance.\n4 https://www.yworks.com/editors 5 https://www.cursor.com/ Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 10 of 25",
        "19": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor 5.\nRelationship with Future Research and Development 5.1.\nAnticipated Results The anticipated results of our proposed research and development are summarized in Table 1.\nTable 1 – Anticipated Results of Proposed Research and Development Phase I Phase II • Phase I Final Report, documenting: • • requirements technical approach • high-level design • lessons learned • Initial proof-of-concept prototype with: • Demo software/CD • Major software components prototyped • Production-ready software • Ongoing demonstrations • Final release within Phase II period • User documentation including • tutorials and sample problems • Demonstration • Scalability, openness and automation • Development of DoD relevant challenge problem and data artifacts • Demonstration in the context of the challenge problem • Phase II Final Report 5.2.\nPhase I as a Foundation for Phase II Research and Development During Phase I, we propose to firmly establish the proof-of-concept of the editable knowledge graph (nForge Pro) that can be used to construct, edit and maintain knowledge graphs representing systems and modeling and analysis.\nThe Phase 1 project is designed to identify and mitigate the risks in the overall project and to provide evidence to the sponsors that the overall project is extremely likely to meet its requirements outlined above.\nIn Phase 1, we will develop the requirement specifications and technical design of the framework, develop and demonstrate a rapid prototype and, specify a DoD-scale challenge problem and data artifacts to be used in Phase 2 demonstration and validation.\nThis effort will greatly reduce the risk during development and commercialization performed in Phase II.\nAdditionally, during Phase I, we will put necessary business agreements in place and obtain the necessary organizational clearances to enable Phase II demonstrations with a DoD-relevant challenge problem with associated data artifacts.\nWe already have business relationships with Lockheed Martin Aeronautics established during the collaborative development and transition of the nForge project.\nSuccessful completion of milestones during Phase 1 will therefore enable us to put the necessary agreements in place for further collaboration, and explore further opportunities within the relevant organizations during Phase 2 and Phase 3 industrial application.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 11 of 25",
        "20": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor 6.\nCommercialization Strategy 6.1.\nCommercialization Roadmap nHansa has a long, reputable history of serving our clients under the name of Effective Automation Systems Inc.\nWe have recently re-focused as nHansa Inc., a solutions provider for all systems design analysis needs.\nBeing a small, and a newly refocused company, we maintain our technological leadership through rapid response to emerging market opportunities and customer requirements in design analysis, by continuing to conduct research and development that will enhance the commercial viability of our technologies.\nWe have considerable expertise in the design, development, commercialization, sales, and marketing of products for the high-performance systems analysis marketplace.\nWe plan to build on this with an aggressive commercialization roadmap leveraging the results of the proposed research on this program.\nFunction Phase I Phase II Months after Contract Phase III Months after Contract 6 12 18 24 30 36 42 48 Engineering Proof-of- concept prototype Proto -type v1.0 Prototype v3.0, Beta Product Release, V 1.0 Proto type v2.0, Alpha Draft product manuals Technical support staffing Product Support Business Develop -ment Marketing Sales Phase II proposal BD plan Govt.\nproject #1 Commerc ial project #1 Phase II Press release Market -ing plan Partners/ alliances Sales plan Beta test users Product maint -enance Updated product manuals On-going product develop -ment On-going technical support On-going BD Product Release 2.0 Updated product manuals and Training On-going BD On-going product develop -ment On-going technical support On-going BD On-going marketing On-going marketing On-going marketing On-going sales On-going sales On-going sales Final product manuals; Product training Govt.\nproject #2 Collateral; Tradeshow demos Product sales campaign Commer cial project #2 Press releases Refine Sales plan 6.2.\nTarget Markets and Expected Results nHansa’s strategy is to provide comprehensive solutions for the design analysis of high-performance systems with the most user-friendly features and thereby become the de facto tool.\nIn the U.S.\ndefense segment, we have long-standing relationships and reputation for our unique expertise in real-time systems analysis.\nThrough our PI’s entrepreneurial activities over the years as well as continuing advisory and investor activities in the San Francisco Bay Area, we also have a number of relationships in the automotive, industrial controls, consumer products, and medical devices markets.\nOur strategy is to establish a clear beachhead in one application domain (defense/aerospace) during Phase 2 and early Phase 3.\nIt is important that we demonstrate the viability of our approach with profitable, commercial results in one high-probability, low-risk domain before engaging in other application domains.\nUpon successful demonstration for our beachhead domain of defense/aerospace we will be well positioned to expand our results to the other application areas mentioned above.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 12 of 25",
        "21": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor 7.\nKey Personnel Srini Srinivasan will serve as the Principal Investigator for this project.\nHe will be supported by an advisory team consisting of senior nHansa researchers, as well as a senior software engineer.\nKEY PERSONNEL SUMMARY Name, Title Org Qualifications Recent Publication Foreign National (Y/N) Srini Srinivasan, Principal Investigator nHansa PI for prior nHansa SBIRs in advanced technologies; entrepreneurial experience Technical Advisory Board Mark Gerhardt, Technical Advisor nHansa Russell Kegley, Technical Advisor nHansa Extensive DoD domain experience; expert in systems architecture Prior Lockheed Martin Fellow; experience transitioning and R&D into DoD applications Rich Hilliard, Technical Advisor nHansa MBSE expert; actively participates in standards Software Engineer nHansa Rapid prototyping Technical Support Team N N N N N S.\nSrinivasan et al., \"Empirical Bounds for Multicore Cache Interference\" 2019 IEEE/AIAA 38th Digital Avionics Systems Conference (DASC), San Diego, CA, USA, 2019, pp.\n1-10, doi: 10.1109/DASC43569.20 19.9081787 Srini Srinivasan – Principal Investigator and CTO of nHansa, Inc.\n(U.\nS.\nCitizen) Srini has over thirty-five years of experience with advanced technology development and commercialization.\nSrini led the development and transition of nForge (SBIR Phase 1 and SBIR Phase 2 and beyond) to the Air Force’s F-35 program, in partnership with Lockheed Martin Aeronautics Company located in Fort Worth, TX; he is actively involved in its Phase 3.\nHe is a contributing member of the AUTOSAR Safety and System Test Working Groups which are responsible for the safety standard for automotive platforms.\nPreviously, he was the Principal Investigator in our nVision toolset project (SBIR Phase 1 and SBIR Phase 2), which analyzed and optimized the performance of the C2I subsystem of the NAVY DDG 1000 platform, collaborating with Raytheon and Lockheed Martin; and, the Control Oriented Adaptive Transport (COAT) project, which focused on wireless network optimization strategies.\nPreviously, he led the technical proposal efforts for Lockheed Martin Advanced Technology Labs’ (Cherry Hill, NJ) DARPA SAPIENT program, and participated in the DARPA BICA program.\nSrini was a co-founder and CEO of TimeSys Corporation, http://www.timesys.com, and developed TimeSys to be the worldwide leader in real-time system software, a technology with extensive application in Defense systems.\nHe secured nearly $25 M in funding for TimeSys, including $5 M in sponsored research projects (from DARPA, BMDO, Air Force, and Navy) and $20 M in venture capital funding.\nUnder his leadership, TimeSys became a 70-person company with 8 locations worldwide.\nSrini was a regular presenter and speaker at the Embedded System Conferences and the Software Technology Conferences in Salt Lake City, Utah.\nBefore TimeSys, Srini led the online Automatic Testing Software (ATS) for the world’s first fully automated safety system for a nuclear power plant, in Sizewell B power station in the UK.\nLater he led the safety certification team for Westinghouse Electric, addressing and resolving findings from a formal for the nuclear safety system.\nSrini holds Masters and Bachelor's in Engineering from the University of Houston, and the Indian Institute of Technology (IIT) Madras; and an MBA from the Wharton School at the University of Pennsylvania.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 13 of 25",
        "22": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor A detailed resume is included in the Attachments to this proposal.\nMark Gerhardt – Chief Scientist of nHansa, Inc.\n(U.\nS.\nCitizen) Mark Gerhardt will be an advisor for the nForge Pro tool architecture design.\nHe is currently a Chief Architect at nHansa, Inc., and led the architecture activities for the nForge tool.\nHe has been involved for over 35 years in the conception, construction, and deployment of large and complex mission-critical and high-performance software-based systems.\nPrevious positions include software engineering laboratory deputy director at Loral Mission systems, chief software scientist at ESL, Inc., and involvement in many radar, sonar, and EW products at Raytheon, Lockheed, Boeing, and TRW.\nHe was previously also a Chief Scientist at TPSI Inc.\nand a Chief Architect at TimeSys Inc., both vendors of schedulability and performance analysis tools.\nDuring his career, Mark has designed and built numerous real-time systems for signal and radar processing, computer architectures, and fault-tolerant systems.\nHe also designed and implemented major embedded software applications including C3I and early-warning receivers.\nMark's interests include software and system engineering methods, system and software architecture, object-based languages, and Ada.\nMark is the Past Chair of ACM SIGAda and was a Distinguished Reviewer for Ada95.\nHe is also involved in the IEEE 1471/ISO 42010 work for the recommended practice on how to capture architecture.\nMark received his Bachelor of Electrical Engineering degree Magna Cum Laude from the City College of New York and his Master of Science in Engineering (Computer Science) from Princeton University.\nRussell B Kegley – Application Engineering, nHansa Inc.\n(U.\nS.\nCitizen) Russell will be the Application Engineering Advisor for the proposed project.\nRussell has worked in operating systems development in the distributed systems area since 1978, beginning with kernel development for the Unisys 1100 series of mainframe computers, the first generally available symmetric multiprocessor family.\nBefore nHansa, Russell was a Fellow at Lockheed Martin Aeronautics in Fort Worth TX.\nAt Lockheed, he has worked on a long series of avionics architecture thrusts, including leading the first application development on the Carnegie-Mellon real-time distributed Alpha operating system.\nHis other experiences at Lockheed Martin include the development of schedulability analysis frameworks for the F- 22 and F-35 fighter programs, internal consulting in advanced design techniques, and leading multiple IRAD efforts investigating schedulability tools, middleware architecture, multiprocessor use in avionic systems, and cache contention modeling and remediation.\nHe provided leadership and technical support in multiple university research efforts, including complexity reduction with the University of Illinois Urbana- Champaign, with a particular focus on the transition of university-developed technologies into program use.\nRussell received a Bachelor of Science degree with Honors from Mississippi State University in 1977, with a double major in Mathematics and Computer Science, and a Master of Science in Computer Science in 1985 from the same university.\nRich Hilliard – Model-Based Systems Engineering (MBSE), nHansa Inc.\n(U.\nS.\nCitizen) Rich Hilliard will contribute his expertise in MBSE standards and practices and his knowledge of constraint-based and rule-based systems to the nForge Pro design and implementation.\nRich Hilliard advised the nForge team on MBSE best practices for the nForge product.\nConcurrently, Rich is project editor of ISO/IEC/IEEE 42010, Systems and software engineering — Architecture description, the internationalization of IEEE Standard 1471:2000.\nHe is vice-chair of IFIP Working Group 2.10 on Software Architecture; invited expert for The Open Group Architecture Framework next version; member of the IEEE Computer Society and the Free Software Foundation and visiting research scientist at MIT's Experimental Study Group.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 14 of 25",
        "23": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor 8.\nForeign Citizens nHansa Inc.\ndoes not plan to use any foreign citizens in this effort.\n9.\nFacilities/Equipment nHansa has a well-equipped office and extensive networked computing facilities consisting of several high-performance computers and workstations to carry out this project.\nWe have access to the conference, data center, and lab facilities as needed at key locations within the Silicon Valley area.\nWe make use of collaborative software, enabling the use of home offices and flexible working conditions.\nnHansa is a Small Business and is organized as a Pennsylvania sub-chapter S Corporation.\n10.\nSubcontractors/Consultants nHansa Inc.\ndoes not plan to use any subcontractors or consultants in this effort.\n11.\nPrior, Current, or Pending Support of Similar Proposals or Awards nHansa did not/does not have any prior, current or pending support for the proposed work.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 15 of 25",
        "24": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor Attachment 1.\nnForge (a prior related project) High-Level Summary Under a prior nForge project, we developed a suite of products for system engineering and performance analysis.\nThese products have been demonstrated on a scaled-up and sanitized avionics dataset, representative of a large avionics program (F-35).\nSeveral use-cases were transitioned to the program.\nSeveral other use-cases are ready to be transitioned, with a potential to automate and support engineering activities.\nThe use-cases represent high-value checkpoints in certification, upgrades and sustainment activities.\nThe following products were developed: • nForge: a rule-based model-integration framework (UI) • nLoad: stress test generation and interference estimation • nTrace: real-time, low-overhead, portable profiling library • nVision: Rate-Monotonic Analysis • nIO: PCIe/Net stress generation and interference estimation • nAppGenerator: scaled-up avionics problem generator • nGeneratedApp: instances of scaled-up avionics challenge problem nForge is a Model Integration Framework that seamlessly integrated the above tools, and many other project specific tools and databases.\nnForge is a Systems Engineering Platform with a rule-based database, and a set of tools to keep multiple models complete and consistent with each other, allowing navigation using browser-like rendering and plugins.\nThe goal is to improve the system development and sustainment operations by • • capturing and enforcing constraints and rules within models and datasets capturing and enforcing consistency of overlapping concepts across models and datasets using rules • presenting one unifying reality The nForge platform includes mechanisms to define and enforce enhanced model semantics – either incrementally, or on-demand in a batch-mode.\nThese facilities enable: • Seamless import/export with popular, widely used tools • Scalability for distributed teams with large and diverse data sets • Unifying semantics onto which multiple models can be mapped nForge was demonstrated initially for Performance Analysis, but applicable to other Domains as well.\nnForge Catalogs (of predefined Types and Actions) can be added to the nForge platform and provide a reusable and extensible basis for domain semantics.\nThe following screen images with overlaid annotations attempt to provide a summary of nForge capabilities.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 16 of 25",
        "25": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor Define hardware elements and their relationships Here is an instance of a system (that defines its hardware, software elements in one or more configurations); the instances follow rules defined in types that capture organizational engineering practices and help automate their enforcement Hardware elements can be part of one or more configurations 12/11/20 nHansa Proprietary and Confidential 18 Figure A-6: Hardware Architecture Definition with nForge Software elements such as ClassesAndMethods, Messages and RunTimeEntities can be defined independently and then later assigned to a configuration via a binding to hardware elements Containment structure and calls within software elements can be rendered as a graph 12/11/20 nHansa Proprietary and Confidential 19 Figure A-7: Software Architecture Definition with nForge Navigational aids such as neighborhood view (left), graph thumbnail and tooltips help navigate large graphs Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 17 of 25",
        "26": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor Configuration brings hardware and software elements together, defines their allocation, and also manages configuration’s ProfilingTests and RMA results Configuration structure, semantics and syntax – e.g., in terms of Nodes, Time Partitions, Address Spaces and System Objects is dictated by rules, defined in types and enforced in instances Properties and relationships of the selected object is shown in the property inspector 12/11/20 nHansa Proprietary and Confidential 20 Figure A-8: Configuration Hierarchy in nForge To help explore a configuration, warning lights can be used to diagnose and isolate problem areas incrementally by double clicking (“drilling down”) – e.g., From node3 to time- partition 30200 to address-space 30201_0.938 in this example.\nAlso, metrics can be displayed as bar charts or pie charts at every hierarchical level.\nMultiple graph windows can be shown at the same time in different tabs to manage large, deep and complex graphs 12/11/20 nHansa Proprietary and Confidential 21 Figure A-9: Dashboard navigation with nForge Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 18 of 25",
        "27": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor • Green: un-interrupted run of a thread • Red: thread has been pre-empted for this duration Blue: thread incurred a partial execution due to pre-emption • • • The whole test-run’s trace is shown below with the viewport window highlighted in red.\nIndividual events can be examined by mouse-click or mouse-hover Many processor register counters can be read and reported as part of nTrace profiling.\nThese can be used to monitor energy usage or cache misses during a test-run nHansa Proprietary and Confidential 26 Figure A-10: Profiling Data integrated with nForge • • • nForge works with nTrace, nHansa’s low-overhead, portable real-time profiler so that detailed execution traces can be obtained and analyzed.\nMore on this in Session 3.\nAdditionally, nForge works with LTTng, a popular open source tracing tool for Linux that generates display like shown here.\nnTrace format is very similar to the RTPS format used in the F35 program, so we can integrate nForge visualization and analysis shown here 12/11/20 nForge Architecture nForge is designed with a layered, scalable, customizable tool architecture, shown in the figure below.\nLayered Architecture user nForge project-specific instances nForge Project-specific Profile (types and rules) nForge data model (inheritance, hierarchy, rules, queries) java, js, python, nfgl api tinkerpop graph data model (nodes, edges, properties) groovy, gremlin api neo4j titan orientDB tkgrph hadoop nForge leverages existing, deployed technologies that are proven scalable and robust Figure A-11: nForge Layered Architecture Data transform rules Project data Modeling tool drivers Project tools Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 19 of 25",
        "28": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor nForge uses graph databases, with a standard Apache Gremlin/Tinkerpop query interface, offering Groovy, Java and Python programming interfaces.\nThese “standard” elements are shown in the bottom two green layers of the above Figure.\nnForge’s own data-model and API, shown in the third layer from below in the Figure, supports the type definitions contained in catalogs; catalogs can be developed per project.\nThis catalog (or type) layer also defines rules and queries that can be used in the data layer.\nProject-specific data instances are then supported by the type definitions.\nDrivers can also be developed and integrated as plugins to nForge to support data import/export to widely used data formats (e.g., Excel) and widely used modeling tools (e.g., Rhapsody with MARTE annotation, AADL/OSATE).\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 20 of 25",
        "29": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor Attachment 2.\nSrini Srinivasan Resume Summary Srini Srinivasan has over 35 years of experience in developing and managing early-stage technologies, start-ups, and advanced engineering projects in a wide variety of roles: customer development and support, product management, marketing, sales, engineering, finance and general management.\nHis experience spans diverse domains of advanced electronics, software, data analytics, advanced materials, Internet, networks, control systems, consumer and financial markets.\nWhile leading nHansa on safety and performance in autonomous transportation systems, he is also serving as an adviser for various bay area start-ups.\nPreviously, he was the founder of EASI, which provided analytics products for wireless networks and embedded real-time systems.\nHe was the founding CEO of TimeSys, a leader in the embedded Linux market with applications in industrial automation, telecommunications, networking, consumer devices, aerospace and defense.\nEarlier in his engineering career, for Westinghouse Electric, he co-led an engineering team that delivered an automated online tester for the world’s first digital safety system for a nuclear power plant.\nSrini holds an MBA in Entrepreneurial Management and Finance from the Wharton School at the University of Pennsylvania, and Masters and Bachelors of Engineering respectively from the University of Houston and the IIT Madras in India.\nExperience nHansa CEO and CTO September 2015 - Present San Jose, CA Currently in product development and initial customer application - an integrated systems engineering solution for software intensive, performance- Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 21 of 25",
        "30": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor and safety-critical avionics applications.\nProduct is being demonstrated with performance and safety analysis in support of air-worthiness certification for a large avionics system, but generalizes to many other types of analysis and also to other verticals, e.g., safety analysis and certification of computing infrastructure used in autonomous automotive and drone systems.\nWe have also developed a unique approach to the design and certification of predictable systems that need to use modern multi-core processors.\nPreviously, participated in a computational materials R&D program.\nIdea was to significantly reduce the time-to-market for advanced materials made from carbon fiber reinforced plastics, via integrated operation of various design and simulation software from Autodesk, Convergent and other Abaqus tools.\nSand Hill Angels Member and Investor August 2013 - Present Palo Alto, CA Sand Hill Angels is a group of successful Silicon Valley executives and accredited investors that are passionate about entrepreneurialism and the commercialization of disruptive new technologies.\nDabKick Inc Advisor April 2014 - Present Cupertino, CA DabKick focuses on the social aspect of media consumption - in home and on the move.\nAdviser on technology and corporate strategy.\nEffective Automation Systems Inc President August 2002 - August 2015 San Jose, CA Won and executed 3 advanced R&D projects from the US Navy and US Air Force in the area of performance analysis of real-time systems and wide-area wireless networks.\nAlso, as a consultant for Lockheed Martin Advanced Technology Labs in Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 22 of 25",
        "31": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor Cherry Hill, NJ: - in a product management role, led the the core execution team for the SPRUCE project, which is both a social network and a virtual laboratory for the Computer Science research community.\n- in a business and technology development role, led and secured the pursuit for a DARPA funded early stage technology development program in advanced mobile networking and machine learning - in a technology development role, contributed to the development of various applied software engineering technologies - in the areas of model integration and service-oriented architectures In parallel, - Took entrepreneurial pursuits to various stages of prototype development, business plan generation, initial team formation and venture capital exploration for a variety of concepts: (i) a mobile local search service using automated voice servers, (ii) a voice and web portal for organizing and disseminating customer feedback on local businesses, (iii) data analysis and classification for commodity and financial futures via machine learning, and (iv) a micro-fluidic platform for rapid drug discovery Golden Mile Solutions Co-founder and Advisor August 2013 - July 2015 San Jose, CA Our management consulting offering focuses on business problems and results; we leverage organization's data, experience and our own access to various technologies and experience to deliver what matters most - business results and actionable insights.\nThinkOptics Advisor May 2005 - May 2012 San Jose, CA Direct pointing and navigation for digital media TimeSys Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 23 of 25",
        "32": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor Co-Founder, CEO July 1996 - July 2002 Greater Pittsburgh Area Co-founded, developed and positioned the company as the leading global provider of embedded, real-time Linux and Java -- Led overall corporate strategy, formulated and executed the overall business and marketing plan -- Developed flagship software product, actively sold it initially; participated in industry conferences, standards -- Built an initial customer base with major telecom, mobile, consumer device, industrial control and defense vendors -- Formulated world-wide product distribution strategy and oversaw its execution -- Recruited and managed an executive team assembled one of the strongest real-time technology teams world-wide -- Instrumental in completing three rounds of venture funding -- Initiated and managed contacts with venture capital organizations and corporate investors across the country -- Negotiated and completed key distribution agreements, strategic investments -- Responsible for investor/board relations, finance/budgeting and other day-to- day operational issues EASI President and Consulting Engineer August 1992 - July 1997 (5 years) Built and led a team providing engineering consulting solutions to Westinghouse Electric Corp (in Industrial Control Software), the US Department of Energy (in Image Processing) and Carnegie Mellon University (in Operations Management).\nDeveloped friendly software to accompany an MBA text in operations management for CMU - Heuristic Scheduling Systems: With Applications to Production Systems and Project Management (Wiley Series in Engineering and Technology Management) - Thomas Morton and David Pentico - http:// www.amazon.com/Heuristic-Scheduling-Systems-Applications-Engineering/ Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 24 of 25",
        "33": "Proposal Number F244-0001-0005 Topic Number AF244-0001 nHansa Inc.\nnForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor dp/0471578193 SAIC Systems Engineer February 1991 - July 1992 (1 year 6 months) Engineering development for a real time image acquisition and image processing system for medical and industrial applications Responsible for software development and customer satisfaction, completed projects on time for the Department of Energy WTI Advanced Technology LTD Senior Engineer April 1988 - February 1991 (2 years 11 months) Developed a microprocessor based real time nuclear plant control software for Westinghouse Electric Corporation Co-Led a technical team of seven engineers with hands-on work and project management and schedule responsibility Shaw Wallace & Co Ltd Engineer June 1986 - April 1988 (1 year 11 months) Copenhagen Area, Denmark and Chennai, India Software development for a distributed industrial control system Education University of Pennsylvania - The Wharton School MBA, Entrepreneurial Management and Finance · (2002 - 2004) University of Houston MS, Chemical Engineering · (1985 - 1986) Indian Institute of Technology, Madras B.Tech, Chemical Engineering · (1980 - 1985) Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 25 of 25",
        "34": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Duns Cage F244-0001-0005 AF244-0001 nForge ProTM: A Scalable Knowledge Graph with an Intelligent Interactive Editor 10/23/2024 01:51:36 PM Effective Automation Systems Inc (DBA nHansa) 1014 Narciso Ct -, San Jose, California, 95129 http://www.nhansa.com S5YEALJFBWY7 943516443 06SL3 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 5.8%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (5%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) $139,966.73 $139,966.73 $0.00 $0.00 $0.00 $125,994.00 $0.00 $0.00 $0.00 $0.00 $0.00 $7,307.65 $133,301.65 $0.00 -$0.00 $6,665.08 $139,966.73 $0.00 $0.00 $0.00",
        "35": "Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 5.8%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (5%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Computer Systems Analyst/ Principal Investigator (Srini Srinivasan) Computer Systems Analyst/ Advisor Software Developer/ Software Engineer Subtotal Direct Labor (DL) Labor Overhead (rate 38%) x (DL) Total Direct Labor (TDL) G&A (rate 5.8%) x Base (TDL+TOH) Cost Sharing Profit Rate (5%) Total Estimated Cost TABA Year 2 Direct Labor Costs $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $85.00 750 $80.00 60 $65.00 350 $63,750.00 $4,800.00 $22,750.00 $91,300.00 $34,694.00 $125,994.00 $7,307.65 -$0.00 $6,665.08 $139,966.73 $0.00 Category / Individual-TR Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost Computer and Information Research Scientist/ Principal Investigator (Srini Srinivasan) $85.00 0 Subtotal Direct Labor (DL) $0.00 $0.00",
        "36": "Labor Overhead (rate 38%) x (DL) Total Direct Labor (TDL) G&A (rate 5.8%) x Base (TDL+TOH) Cost Sharing Profit Rate (5%) Total Estimated Cost TABA Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Srini Srinivasan Phone: (408) 480-7707 Phone: srini@nhansa.com Title: Proposal Owner $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: Yes Audit Agency Name: DEFENSE CONTRACT AUDIT AGENCY Audit Agency POC: Acacia Rodriguez Address: 2105 S.\nBASCOM AVENUE, SUITE 310 , CAMPBELL, California,95008 Phone: (571) 448-5643 Email: oacacia.rodriguez@dcaa.mil Select the Type of Payment Desired: Partial payments",
        "37": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Computer Systems Analyst Principal Investigator Computer Systems Analyst Advisor Software Developer Software Engineer Master's Degree Master's Degree Master's Degree 35 40 10 750 $85.00 $63,750.00 60 $80.00 $4,800.00 350 $65.00 $22,750.00 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nPreviously justified and negotiated labor rate for the geographical location, adjust for modest total 5% inflation over the last 3 years.\nFringe benefits are included in the overhead rate Direct Labor Cost ($): Year2 $91,300.00 Category Description Education Yrs Experience Hours Rate Fringe Rate Computer and Information Research Scientist Principal Investigator Master's Degree 40 0 $85.00 Are the labor rates detailed below fully loaded?\nProvide any additional information and cost support data related to the nature of the direct labor detailed above.\nFringe rate is include in overhead rate Total $0.00 NO Direct Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base $0.00 $91,300.00",
        "38": "Labor Cost Overhead Rate (%) 38 Overhead Comments: Fringe rate is include in overhead rate Overhead Cost ($): Year2 Labor Cost Overhead Rate (%) Overhead Comments: Fringe rate is include in overhead rate Overhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\n$34,694.00 38 $0.00 $34,694.00 5.8 YES YES $7,307.65 5.8 YES YES",
        "39": "G&A Cost ($): Sum of all G&A Costs is ($): Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: None Profit Rate (%): Profit Explanation: Total Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: None Profit Rate (%): Profit Explanation: Total Profit Cost ($): Total Proposed Amount ($): $0.00 $7,307.65 -$0.00 5 $6,665.08 -$0.00 5 $6,665.08 $139,966.73",
        "40": "SBIR Company Commercialization Report EFFECTIVE AUTOMATION SYSTEMS, INC Total Investments: $0.00 *This CAI is calculated at the time of submission.\nCAI is calculated 1st of every month for all the organizations.\nThis might change your firms CAI.\nPlease visit our company dashboard on SBIR.Gov to view the most recent CAI for your organization.\nTotal Patents: 0 Total Sales: $200,000.00 * CAI: 0 Company Information Address: 1014 Narciso Ct, San Jose, CA, 95129-3027 SBC Control ID: SBC_000152255 Company Url: http://www.nhansa.com Company POC Title: Full Name: Srini Srinivasan Phone: Email: 4084807707 srini@nhansa.com Commercialization POC Title: President and CEO Full Name: Srini Srinivasan Phone: Email: (408) 480-7707 srini@nhansa.com Additional Company Information % Revenue for last fiscal year from SBIR/STTR funding: 99.0% Year Founded: 1992 Total revenue for last fiscal year: $500 - $999,999 # Employees Currently: 5 Year first Phase I award received: # SBIR/STTR Phase I Awards: 2003 4 Year first Phase II award received: # SBIR/STTR Phase II Awards: 2005 2 # Employees at first Phase II award: Mergers and Acquisition within past 2 years: 3 No Spin-offs resulting from SBIR/STTR: IPO resulting from SBIR/STTR | Year of IPO: No No | N/A Patents resulting from SBIR/STTR | #Patents: List of Patents: No | N/A Woman-Owned: N HUBZone-Certified: N Socially and Economically Disadvantaged: N SBC majority-owned by multiple VCOC, HF, PE firms | By what percent (%): No | 0.00% Additional Investment From (Year over Year) DoD contracts/DoD subcontracts Angel Investors Venture Capital Self Funded Private Sector Other Federal Contracts/Grants Other Sources Additional Investment Total Investment Last Updated On: 01/18/2021 Last Updated By: rsrinivasan1 2019 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 2020 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 2021 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 1/3",
        "41": "SBIR Company Commercialization Report Phase III Sales To (Year over Year) DoD or DoD prime contractors Private Sector Export Markets Other Federal Agencies Additional commercialization by 3rd Party Revenue Other Customers Additional Sales Total Sales Commercialization Narrative Commercialized Awards 2019 $200,000.00 2020 $200,000.00 2021 $200,000.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $200,000.00 $200,000.00 $200,000.00 nForge: A Multi-Model Framework for System Designers 1 of 2 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2015 Subsidiaries No | N/A N/A Topic #: AF141-056 Contract/Grant #: FA8750-15-C-0275 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: Lockheed Martin Aeronautics b.\nSystem/Program: F-35 c.\nCost Savings: $5,100,000.00 d.\nCost Savings Type: life-cycle e.\nExplanation: o Cost benefit ROM’s (Estimates based on SME inputs), total over 10 years Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nYes a.\nPrimary Agency: Air Force b.\nSystem/Program: F-35 Joint Program Office c.\nPhase III Contract #: Imminent  $1.6M in direct analysis costs (interference effects)  $150K per year in touch labor avoidance, each of the 10 years  $200K point savings, certification evidence architecture, each of the 10 years  TBD anomaly avoidance, scrap and rework, implicit, not included  TBD Airworthiness test automation, implicit, not included Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Last Updated On: 01/18/2021 Last Updated By: rsrinivasan1 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 2/3",
        "42": "SBIR Company Commercialization Report nVision-TM: An Toolset for the Modeling, Analysis and Simulation of Complex Architectures 2 of 2 Agency/Branch: Department of Defense/Navy Manufacturing related Program/Phase/Year: SBIR/Phase II/2005 Subsidiaries No | N/A N/A Topic #: N04-069 Contract/Grant #: N00024-05-C-4168 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $200,000.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $200,000.00 Last Updated On: 01/18/2021 Last Updated By: rsrinivasan1 Page 3/3",
        "43": "Srini Srinivasan, Effective Automation Systems Inc (DBA nHansa) Oct 02, 2024 Oct 02, 2025"
    },
    "images": [
        {
            "page": 9,
            "image_file": "docNAC01FB7453531a9bae4964b0168c33503fd1163dceb9ec0ea421e6c150868b446cad47e0ccb6_page9_img1.png",
            "hash": "aa66c315bd689c9c",
            "position": "Middle Center"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB7453531a9bae4964b0168c33503fd1163dceb9ec0ea421e6c150868b446cad47e0ccb6_page12_img1.png",
            "hash": "edcc1236615b25ec",
            "position": "Top Center"
        },
        {
            "page": 13,
            "image_file": "docNAC01FB7453531a9bae4964b0168c33503fd1163dceb9ec0ea421e6c150868b446cad47e0ccb6_page13_img1.png",
            "hash": "e963a667d8241979",
            "position": "Middle Center"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB7453531a9bae4964b0168c33503fd1163dceb9ec0ea421e6c150868b446cad47e0ccb6_page15_img1.png",
            "hash": "bf2de125e2c1c6d0",
            "position": "Top Center"
        },
        {
            "page": 17,
            "image_file": "docNAC01FB7453531a9bae4964b0168c33503fd1163dceb9ec0ea421e6c150868b446cad47e0ccb6_page17_img1.png",
            "hash": "fa0256582b5d7873",
            "position": "Middle Center"
        },
        {
            "page": 25,
            "image_file": "docNAC01FB7453531a9bae4964b0168c33503fd1163dceb9ec0ea421e6c150868b446cad47e0ccb6_page25_img1.png",
            "hash": "cb6b14346b4b3734",
            "position": "Top Center"
        },
        {
            "page": 25,
            "image_file": "docNAC01FB7453531a9bae4964b0168c33503fd1163dceb9ec0ea421e6c150868b446cad47e0ccb6_page25_img2.png",
            "hash": "8f70522b6c6d1877",
            "position": "Middle Center"
        },
        {
            "page": 26,
            "image_file": "docNAC01FB7453531a9bae4964b0168c33503fd1163dceb9ec0ea421e6c150868b446cad47e0ccb6_page26_img1.png",
            "hash": "9e3b4320437d2e73",
            "position": "Top Center"
        },
        {
            "page": 26,
            "image_file": "docNAC01FB7453531a9bae4964b0168c33503fd1163dceb9ec0ea421e6c150868b446cad47e0ccb6_page26_img2.png",
            "hash": "a667588898dd8cdd",
            "position": "Middle Center"
        },
        {
            "page": 27,
            "image_file": "docNAC01FB7453531a9bae4964b0168c33503fd1163dceb9ec0ea421e6c150868b446cad47e0ccb6_page27_img1.png",
            "hash": "fa036868761f4774",
            "position": "Top Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "nhansa.com",
        "name": "N/A",
        "phone": "N/A"
    }
}