{
    "filename": "docNAC01FB74535350c8f622374c8eb3bb9b562f002f8bb94aa28452943298b38eb8c57f1310c918.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0004-0308 Proposal Title: Equitus KGNN Knowledge System Architecture Agency Information Agency Name: Command: USAF AFDW Topic Number: AF244-0004 Firm Information Firm Name: Equitus Corporation Address: Website: UEI: DUNS: CAGE: 2170 Rainbow Dr., Clearwater, FL 33765-3935 www.equitus.us RV37VJ99WRM5 825352490 52F69 SBA SBC Identification Number: 001662721 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 35 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_001662721 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_001662721.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [X] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [ ] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [X] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Joseph Daum Signature Title Business Name Date Joseph R Daum Director/Government Equitus Corporation 08/17/2020 Acquisitio",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?NO VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: The proliferation of diverse data sources across disparate systems hinders real-time information access, impeding critical decision-making capabilities within the U.S.\nAir Force.\nAchieving real-time data integration and analysis across all platforms offers a decisive information advantage in the modern operational environment.\nTo address this challenge, Equitus proposes the augmentation and implementation of KGNN, a Knowledge Graph Neural Network, which fuses the power of knowledge graphs with machine learning.\nThis AI-driven data fabric intelligently interconnects and contextualizes data from all sources, both structured and unstructured, into a centralized knowledge graph, enabling real-time insights and achieving data dominance.\nKGNN automates Extract, Transform, Load (ETL) processes, ensuring efficient knowledge extraction and significantly improving data management workflows.\nBy preserving data ownership and ensuring compatibility with legacy systems, KGNN facilitates seamless integration within existing Air Force infrastructure.\nFurthermore, KGNN enhances cross- domain coordination by interlinking relevant information across various operational domains, including combat and support spheres.\nThe platform prioritizes data security and integrity, guaranteeing the proper handling of sensitive data through robust access controls and enabling both integration and segregation as required.\nDesigned for users ranging from entry-level analysts to experienced data scientists, KGNN provides an accessible and powerful solution for achieving real-time situational awareness and informed decision-making within the U.S.\nAir Force.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: This Phase I SBIR effort will demonstrate the feasibility of KGNN, a Knowledge Graph Neural Network technology, to address the U.S.\nAir Force's need for real-time data integration and analysis.\nThe research will culminate in a comprehensive feasibility study showcasing KGNN's ability to ingest, correlate, and unify disparate datasets in real time, providing high-performance data movement and transformation across enterprise platforms.\nSuccessful completion of this Phase I project will deliver: (1) a validated quantitative model demonstrating KGNN's capability to generate real-time insights from large datasets while preserving data ownership and security, and (2) a clear transition path towards a Phase II prototype development effort.\nThe",
        "5": "anticipated benefits for the Air Force include enhanced situational awareness, improved decision-making through real-time insights, and streamlined data management processes.\nBeyond military applications, KGNN offers significant commercial potential for various sectors facing data integration challenges, including financial services, healthcare, supply chain management, and cybersecurity.\nThis dual-use potential ensures a broader impact and return on investment for this research.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: 1 2 3 4 5 List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: Artificial Intelligence, Machine Learning, Data Fusion, Big Data Analysis, Data Visualization, Data Graph Fabric, Real-Time Data Aggregation, Data Unification VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 100% 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES 3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES",
        "6": "offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES NO 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, YES release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO 16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n29% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES VOL I - Contact Information Principal Investigator Name: DANIEL HILDRETH Phone: (941) 302-4726 Email: hildrethd@equitus.us Address: 2170 Rainbow Dr., Clearwater, FL 33765 - 3935 Corporate Official Name: Chasiti Avina",
        "7": "Phone: (949) 326-4778 Email: avinac@equitus.us Address: 2170 Rainbow Dr., Clearwater, FL 33765 - 3935 Authorized Contract Negotiator Name: Chasiti Avina Phone: (949) 326-4778 Email: avinac@equitus.us Address: 2170 Rainbow Dr., Clearwater, FL 33765 - 3935 Form Generated on 11/05/2024 04:56:04 PM",
        "8": "Proposal Number [F244-0001-0090] Topic Number [AF244-0001] Real-Time Insights Through Equitus.ai Volume 2: Technical Volume 1.\nIdentiﬁcation and Signiﬁcance of the Problem or Opportunity The modern operational environment presents a signiﬁcant challenge: the ever-increasing volume, velocity, and variety of data generated across disparate systems, applications, and repositories.\nThis data deluge hinders real-time information accessibility, impeding timely and informed decision-making.\nCurrent approaches often involve complex, time-consuming data integration processes, resulting in information silos and a fragmented understanding of the operational landscape.\nWithout a uniﬁed, real-time view of this data, critical insights remain hidden, and the potential for data-driven advantages is unrealized.\nEquitus addresses this challenge with KGNN, our Knowledge Graph Neural Network, a single, AI-driven platform designed to achieve data dominance.\nKGNN interconnects data with next-generation AI, transforming disparate datasets into a centralized knowledge graph.\nThis approach increases information versatility while maintaining compatibility with legacy systems and preserving data ownership.\nBy eliminating data silos and fusing structured and unstructured data, KGNN provides a comprehensive operational outlook, enabling the U.S.\nAir Force to continuously build its intelligence knowledge base and gain real-time insights.\nOperational Impact and Potential Scale of Impact: KGNN empowers the U.S.\nAir Force to transform and normalize disparate data into a single, highly efficient, and easily scalable knowledge graph.\nUpon ingestion, Machine Learning models and Natural Language Processing seamlessly interconnect data points, providing users with real-time insights across all datasets.\nThis ready-to-run analytics and data abstraction layer enables rapid deployment of even the most complex intelligence systems, accelerating ﬁelding timelines from years to weeks or even days.",
        "9": "Proposal Number [F244-0001-0090] Topic Number [AF244-0001] KGNN's open standards and architecture facilitate leveraging legacy applications and connecting them to the Equitus ecosystem.\nThis creates a real-time common intelligence picture, enhancing situational awareness and enabling faster responses to emerging threats.\nThe open architecture also ensures scalability, allowing the Air Force to rapidly integrate new technologies as they become available.\nData privacy and security are paramount.\nKGNN operates on Public Key Infrastructure and employs internal encryption of all user traffic, utilizing cell-level security measures to ensure strict access control and data privacy upon ingestion and extraction.\nScientiﬁc Feasibility: KGNN leverages an Open Data Fabric (ODF) to enhance information versatility by automatically generating correlations between datasets and presenting explicit relationships upon data ingestion.\nThis contrasts sharply with traditional methods, where mapping intelligence data between systems often leads to reduced accuracy due to inﬂexible schema mapping and format constraints.\nDesigned to improve the discovery and utilization of intelligence information, KGNN fosters interoperability between intelligence systems.\nIts intuitive, modern user interface minimizes training time, maximizing productivity gains.\nThe ﬂexible data model and visualization environment, coupled with a comprehensive suite of visual analysis tools, accelerates the discovery of critical individuals, connections, relationships, events, patterns, and trends that might otherwise be overlooked.\nEnabling Technologies: Built on open-standard graph database technology, KGNN seamlessly integrates with legacy systems and readily adapts to future tools.\nThe platform processes vast amounts of raw text, transforming it into actionable knowledge within a centralized knowledge graph.\nReal-time insights, delivered through connections and entity correlations, provide operators with relevant knowledge, interlinking data from various operational spheres and fostering enhanced coordination.\nMultiple data processing pipelines within KGNN enable seamless data",
        "10": "Proposal Number [F244-0001-0090] Topic Number [AF244-0001] ingestion, transformation, querying, storing, and analysis, regardless of source or format.\nAlternative Technical Approaches: Traditional relational databases rely on indexes for data storage and retrieval.\nThese legacy systems often perform slow, linear searches, which become increasingly inefficient as databases scale.\nKGNN utilizes Triple Store technology, offering superior scalability, query performance, and ﬂexibility.\nBy grouping related data, Triple Stores enable near real-time responses to complex queries, dramatically outperforming traditional methods.\nTechnical Risk Mitigation: Potential delays arising from migrating legacy data are mitigated by KGNN's open architecture.\nInoperability risks associated with legacy system integration are minimized, except in rare cases involving proprietary closed architecture systems.\nAir Force Transition Pathway: The Phase I SBIR will demonstrate KGNN's feasibility for enhancing real-time situational awareness through information operations and a common intelligence picture.\nUpon Phase I completion, a conﬁgured open-standard, open-architecture analytical environment incorporating Equitus COTS software will be deployed for initial evaluation and user training.\nFeedback collected will inform enhancements for Phase II, where a modiﬁed, scalable version of KGNN will be developed to meet Air Force enterprise requirements.\n2.\nPhase I Technical Objectives.",
        "11": "Proposal Number [F244-0001-0090] Topic Number [AF244-0001] The primary objective of this Phase 1 Small Business Innovation Research program is to conduct applied research using Equitus' Commercial Off-the-Shelf (COTS) software, speciﬁcally leveraging the KGNN platform.\nThis research will focus on demonstrating KGNN's ability to ingest, correlate, and unify disparate datasets, enabling high- performance data movement and transformation across enterprise platforms in real time.\nA key component of this Phase 1 effort is a feasibility study, utilizing data processed by the KGNN COTS solution, to construct a quantitative model for generating real-time insights.\nThis model will demonstrate the platform's capacity to ingest large volumes of data, transform that information into actionable insights, and maintain data ownership and security throughout the process.\nThe feasibility study will provide quantiﬁable metrics to validate KGNN's performance and potential for real-world deployment.\n3.\nPhase I Statement of Work (include Subcontractors and/or Research Institutions).\n3.1 SCOPE This Phase I SBIR effort will demonstrate the feasibility of Equitus' KGNN (Knowledge Graph Neural Network) platform to enhance real-time situational awareness and create a common intelligence picture for the U.S.\nAir Force, speciﬁcally addressing the needs outlined in DoD SBIR 2024.4, topic AF244-0001.\nEquitus will conduct a comprehensive assessment of the current Air Force analytical environment, identifying key integration points and potential areas for improvement.\nLeveraging the KGNN platform's capabilities, Equitus will develop and demonstrate use cases relevant to Air Force information operations, showcasing the platform's ability to ingest, correlate, and analyze disparate datasets in real-time.\nThis feasibility study will culminate in a ﬁnal report detailing the technical viability, potential commercial applications, and recommendations for a Phase II prototype development effort.\n3.2 Speciﬁc Tasks – The contractor shall perform the following tasks to achieve the statement of work objectives.\n3.2.1 Kickoff Meeting – Equitus will conduct a kickoff meeting with the Government technical point of contact (TPOC) to review the project scope, deliverables, and timelines.",
        "12": "Proposal Number [F244-0001-0090] Topic Number [AF244-0001] 3.2.2 Analytical Environment Assessment – The Contractor shall conduct an assessment of the analytic environment to determine the software integration requirements and identify alternative use cases and sample data sources.\n• Analyze the current Air Force analytical environment and identify speciﬁc requirements for real-time situational awareness and common intelligence picture development.\n• Collaborate with the Government TPOC to deﬁne and prioritize two (2) relevant use cases that demonstrate KGNN's capabilities in information operations.\n• Document the selected use cases, including data requirements, expected outcomes, and success metrics.\n3.2.3 Use Case Selection & Demonstration Data Identiﬁcation - The Contractor will present alternative use cases and acquire representative datasets for the selected use cases that will demonstrate the feasibility of the Equitus Graph Data Fabric to increase real-time situational awareness through information operations and create a common intelligence picture to the Government.\nThe Contractor shall coordinate with the Government to select one or more use cases for demonstration.\nThe Contractor and Government shall collaborate to identify internal, external, and open data sources available for use case development and demonstration.\n3.2.4 Use Case Demonstration Development • Conﬁgure the KGNN COTS system to address the speciﬁc requirements of the selected use cases.\n• Develop any necessary data connectors or adapters to ensure seamless integration with existing Army systems (if applicable and with government-furnished speciﬁcations).\n• Conduct rigorous testing to validate data ingestion, processing, and analysis capabilities.",
        "13": "Proposal Number [F244-0001-0090] Topic Number [AF244-0001] 3.2.5 Data Set Integration – The Contractor shall conﬁrm interoperability testing with customer identiﬁed data sources and ingest sample data sources as proof of technical feasibility.\n3.2.6 Use Case Demonstration -The Contractor shall conduct a live demo of the capabilities using the selected use case(s) and data set(s).\nThe Demo will be conducted at a CONUS location designated by the Government or virtually.\n3.2.7 Government Feedback – The Contractor shall document feedback received from the Government evaluators attending the demonstration.\nThe feedback should focus on potential dashboard improvement, suggested conﬁguration modiﬁcations, and recommendations on software modiﬁcations to be proposed in Phase II.\n3.2.8 Final Report Proposal - The Contractor shall provide a ﬁnal report documenting the feasibility.\nThe report shall provide documentation to substantiate that the scientiﬁc and technical merit and feasibility described in the Phase I section of the topic component-speciﬁc instructions has been met and describes the potential commercial applications.\nThe ﬁnal report will also document government feedback and Phase II proposal recommendations obtained under Task 3.2.6.\nThe Final Report will also contain details of planned enhancements based on feedback received from commercial customers.\n3.2.9 Period of Performance/SBIR Milestone Schedule Equitus proposes a 6-month effort to accomplish the effort detailed in the preceding Statement of Work.\nThe schedule below depicts the proposed schedule based on the anticipated award date.\n4.\nRelated Work.\nComprehensive Analytics for Operators with Limited or No Coding Experience a.\nShort description: Direct to Phase II Small Business Innovation Research program is to modify the Equitus Commercial Off the Shelf (COTS) software to enable end users with limited or no coding experience with the ability to take one or more datasets, transform, combine, plot, and generally manipulate them to answer a question or achieve inference of said data.\nThe Phase II effort will demonstrate the ability of Equitus software to be easily deployable against multiple disparate data sets.\nThe contractor shall provide current “do it yourself” training materials and develop additional training material that",
        "14": "Proposal Number [F244-0001-0090] Topic Number [AF244-0001] mirror YouTube like instructional videos as necessary.\nThe training shall not limit utilization of the system in its entirety.\nb.\nClient for which work was performed: U.S.\nSpecial Operations Command- Chad Raaymakers – (813)826-6095.\nc.\nDate of completion: October 31st, 2023 Marine Corps Forces Cyber Command: a.\nShort description: Equitus was deployed at Marine Corps Forces Cyber Command to provide a real time, open-source-derived data analytic capability with integrated artiﬁcial intelligence (AI), machine learning (M/L), and auto-scraping functionalities.\nEquitus provides access to diverse, expansive, and data-rich repositories (structured/unstructured) within a single intelligent, cost-effective architecture.\nThe tools are being used to implement an Informational Environment (IE) Common Operating Picture (COP) with a social listening tool for in-depth social media analysis.\nThis includes global data fetching capabilities from across the social media spectrum, multilanguage support, sentiment analysis in native language, geospatial data rendering, and more through easy- to-use, intuitive, and customizable user interfaces.\nb.\nClient for which work was performed: U.S.\nMarine Corps Forces Cyberspace Command Jaeron Jenkins MARCYBER – (667)812-6364.\nc.\nDate of completion: September 28th, 2022 Veterans Administration: a.\nShort description: Equitus Commercial Off-the-Shelf (COTS) tools are currently in use providing Measures of Effectiveness (MOE) and Measures of Performance (MOP) for the Veterans Administration (VA).\nAnalysis is focused on marketing campaigns designed by the Veterans Administration to increase awareness of VA programs.\nThe custom-conﬁgured solution collects data from public sources to meet VA MOE/MOP assessment needs.\nThe VA solution includes Equitus Visual Ops (EVO), a suite of advanced visualization tools, conﬁgured to enhance identiﬁcation of regional sentiment toward VA outreach programs.\nb.\nClient for which work was performed: Veterans Administration Lyndon Johnson VA - (202) 461-6448 c.\nDate of completion: June 18th, 2024 5.\nRelationship with Future Research or Research and Development.",
        "15": "Proposal Number [F244-0001-0090] Topic Number [AF244-0001] (a) Anticipated Results- Equitus Independent Research and Development (IR&D) efforts have resulted in a thoroughly calculated feasibility study to deliver a product with the capability to ingest vast amounts of data, deliver real time insights, and demonstrate the interconnected components of relevant data.\n(b) The feasibility study documents Equitus’ effort to demonstrate the scientiﬁc and technical merit of the technology.\nThe foundation created by the study would enable the development, installation, and demonstration of a prototype system that would deliver real time insights upon ingestion, giving the operator an absolute advantage when handling immense amounts of data sets.\n(c) Applicable clearances, certiﬁcations, and approvals – Equitus holds a Top-Secret Facility Clearence.\nAdditionally, Equitus is in the process of obtaining certiﬁcations required to operate on multiple Defense (SIE) Networks.\n6.\nKey Personnel Principal Investigator: Daniel Hildreth – Lead Data Scientist Mr.\nHildreth is an experienced engineer with speciﬁc physics, mathematics, programming, manufacturing, and fabrication expertise.\nHildreth is a skilled data analyst, excels in process design, and a specialist in semiconductor physics.\nHe is the Lead Data Scientist and Head of Research & Development at Equitus and will serve as the project’s algorithm development lead and systems integrator.\nEDUCATION • Bachelor of Science, Physics Mathematics Minor (Aug 2014 - May 2019) Burnett Honors College, University of Central Florida EMPLOYMENT Equitus Corporation – Lead Data Scientist / Head of Research and Development (Dec 2021 – Present) • Architected a scalable analytics platform for operation on arbitrary data.\n• Designed and implemented speciﬁc analytics for deployment within aforementioned platform.\n• Supported a team of developers in implementing R&D projects.\nEquitus Corporation – Senior Software Engineer (Aug 2021 – Dec 2021) • Designed, implemented, and supported web applications, with focus on front-end development.",
        "16": "Proposal Number [F244-0001-0090] Topic Number [AF244-0001] • Worked with CTO, other developers, and members of other teams to determine customer needs.\n• Attended external meetings as a technical advisor.\n• Taught junior developers about company systems and helped them get up to speed.\nEquitus Corporation – Software Engineer (Aug 2020 – Aug 2021) • Served as the principal front-end developer on an enterprise intelligence web application.\n• Carefully implemented software to management speciﬁcations.\n• Collaborated with developers to divide labor efficiently and deliver results ahead of schedule.\nDeep Space Industries – Simulants Technician (Aug 2016 – Jul 2018) n/k/a Bradford Industries; acquired January 2019 • Devised the principal technique by which powdered asteroid simulant mixes were • \"cured\" into their ﬁnal regolith state, including design, development, and implementation of manufacturing.processes.\nProduced some ~5 metric tons of asteroid simulant that is now in NASA's possession.\n• Operated high-pressure, high temperature, and heavy industrial equipment.\nWorked with hazardous materials, metal inert gas welders, and fabrication equipment.\n7.\nForeign Citizens.\nEquitus National Security Group does not have any foreign citizens working on this SBIR effort.\n8.\nFacilities/Equipment.\nEquitus does not require instrumentation or additional physical facilities for this project.\nWork for the contract will be performed at Equitus Headquarters in Clearwater, Florida, and government-approved facilities.\nAll contractor facilities operate and meet Federal, State, and local environmental laws and regulations.",
        "17": "Proposal Number [F244-0001-0090] Topic Number [AF244-0001] 9.\nSubcontractors/Consultants.\nEquitus is not proposing any Subcontractors or Consultants.\n10.\nPrior, Current or Pending Support of Similar Proposals or Awards.\nNo prior, current, or pending support for proposed work 11.\nIdentiﬁcation and Assertion of Restrictions on the Government's Use, Release, or Disclosure of Technical Data or Computer Software The Offeror asserts for itself, or the persons identiﬁed below, that the Government's rights to use, release, or disclose the following technical data or computer software should be restricted:",
        "18": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Duns Cage F244-0004-0308 AF244-0004 Equitus KGNN Knowledge System Architecture 11/05/2024 04:56:00 PM Equitus Corporation 2170 Rainbow Dr., Clearwater, Florida, 33765 www.equitus.us RV37VJ99WRM5 825352490 52F69 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) $140,000.00 $81,600.00 $58,400.00 $0.00 $0.00 $64,200.00 $17,400.00 $0.00 $0.00 $0.00 $0.00 $0.00 $81,600.00 $0.00 -$0.00 $0.00 $81,600.00 $0.00 $41,000.00 $17,400.00",
        "19": "Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Base Year Direct Labor Costs $0.00 $0.00 $0.00 $0.00 $0.00 $58,400.00 $0.00 -$0.00 $0.00 $58,400.00 $0.00 Category / Individual-TR Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost Software Developer/ Principal Investigator (DANIEL HILDRETH) $120.00 300 Software Developer/ Intermediate Level Developer (Michael Davidson) $120.00 235 Subtotal Direct Labor (DL) Labor Overhead (rate 0%) x (DL) Total Direct Labor (TDL) Direct Material Costs Equitus 6.0 KGNN (2 users for 6 months) Total Direct Material Costs (TDM) G&A (rate 0%) x Base () Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Year 2 Direct Labor Costs $36,000.00 $28,200.00 $64,200.00 $0.00 $64,200.00 $17,400.00 $17,400.00 $0.00 -$0.00 $0.00 $81,600.00 $0.00 Category / Individual-TR Software Developer/ Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $120.00 300 $36,000.00",
        "20": "Principal Investigator (DANIEL HILDRETH) Software Developer/ Software Developer (Ross Guju) $100.00 50 Subtotal Direct Labor (DL) Labor Overhead (rate 0%) x (DL) Total Direct Labor (TDL) Direct Material Costs Equitus 6.0 KGNN (2 users for 6 months) Total Direct Material Costs (TDM) G&A (rate 0%) x Base () Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Katie Ressa Phone: (727) 644-6839 Phone: ressak@equitus.us Title: Proposal Owner $5,000.00 $41,000.00 $0.00 $41,000.00 $17,400.00 $17,400.00 $0.00 -$0.00 $0.00 $58,400.00 $0.00 If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: No Select the Type of Payment Desired: Partial payments",
        "21": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Software Developer Software Developer Principal Investigator Intermediate Level Developer Bachelor's Degree Bachelor's Degree 5 5 300 $120.00 $36,000.00 235 $120.00 $28,200.00 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nThe proposed rates are based on Equitus commercial list prices for labor.\nEquitus has discounted our standard commercial labor rates by 20%.(See Supplemental Cost Information for more Info).\nLabor rate Documentation: • Daniel-Hildreth.pdf Direct Labor Cost ($): Year2 $64,200.00 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Software Developer Software Developer Principal Investigator Software Developer Bachelor's Degree Bachelor's Degree 5 5 300 $120.00 $36,000.00 50 $100.00 $5,000.00 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nThe proposed rates are based on Equitus commercial list prices for labor.\nEquitus has discounted our standard commercial labor rates by 20%.(See Supplemental Cost Information for more Info).",
        "22": "Direct Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) Apply Overhead to Direct Materials Cost?\nOverhead Comments: Overhead Cost ($): Year2 Labor Cost Overhead Rate (%) Apply Overhead to Direct Materials Cost?\nOverhead Comments: Overhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Direct Material Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): $41,000.00 $105,200.00 0 NO $0.00 0 NO $0.00 $0.00 0 NO NO NO $0.00",
        "23": "0 NO NO NO $0.00 $0.00 Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Direct Material Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Sum of all G&A Costs is ($): ODC-Materials Base Description: Equitus 6.0 KGNN (2 users for 6 months) Vendor: Equitus Total Cost($): $17,400.00 Competitively Sourced?\nno Quantity: 3 Consumable?\nyes Exclusive for this Contract?\nno Supporting Comments: Supporting Documents: • Commercial Pricing Schedule (2024).pdf Year2 Description: Equitus 6.0 KGNN (2 users for 6 months) Vendor: Equitus Quantity: 3 Consumable?\nyes Exclusive for this Contract?\nno Supporting Comments: Supporting Documents: Total Cost($): $17,400.00 Competitively Sourced?\nno",
        "24": "• Commercial Pricing Schedule (2024).pdf ODC-Summary Base Do you have any additional information to provide?\nYear2 Do you have any additional information to provide?\nProfit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): NO NO -$0.00 0 $0.00 -$0.00 0 $0.00 Total Proposed Amount ($): $140,000.00",
        "25": "SBIR Company Commercialization Report EQUITUS CORPORATION DISCLAIMER: Information provided herein is privileged and confidential, and not subject to disclosure, pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nThis information shall only be used or disclosed for evaluation purposes.\nPrivileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 03/21/2023 Page 1/3",
        "26": "SBIR Company Commercialization Report Total Investments: Total Sales: Total Patents: $0.00 Company Information Address: $0.00 0 2170 RAINBOW DR CLEARWATER, FL 33765-3935 United States Government Designated Phase III Funding: $0.00 SBC Control ID: SBC_001662721 Company Url: https://equitus.us/ Company POC Title: COO Full Name: Chasiti L Avina Phone: Email: 9493264778 admin@equitus.us Commercialization POC Title: COO Full Name: Chasiti L Avina Phone: Email: (888) 722-8755 admin@equitus.us Additional Company Information % Revenue for last fiscal year from SBIR/STTR funding: 6.9% Year Founded: 2008 Total revenue for last fiscal year: $1,000,000 - $4,999,999 # Employees Currently: 48 Year first Phase I award received: # SBIR/STTR Phase I Awards: 2020 1 Year first Phase II award received: # SBIR/STTR Phase II Awards: 2022 1 # Employees at first Phase II award: Mergers and Acquisition within past 2 years: 70 No Spin-offs resulting from SBIR/STTR: IPO resulting from SBIR/STTR | Year of IPO: No No | N/A Patents resulting from SBIR/STTR | #Patents: List of Patents: No | N/A Woman-Owned: No HUBZone-Certified: No Additional Investment From DoD contracts/DoD subcontracts Angel Investors Venture Capital Self Funded Private Sector Other Federal Contracts/Grants Other Sources Additional Investment Total Investment Socially and Economically Disadvantaged: No SBC majority-owned by multiple VCOC, HF, PE firms | By what percent (%): No | N/A Last Submitted Version (-) Current Version - - - - - - - - - $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 2/3 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 03/21/2023",
        "27": "SBIR Company Commercialization Report Phase III Sales To DoD or DoD prime contractors Private Sector Export Markets Other Federal Agencies Additional commercialization by 3rd Party Revenue Other Customers Additional Sales Total Sales Government Phase III Contracts Funding Obligated Commercialization Narrative Commercialized Awards Last Submitted Version (-) Current Version - - - - - - - - $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Last Submitted Version (-) $0.00 Current Version $0.00 Listed below are the sales revenue and investment details resulting from the technology developed under these SBIR/STTR awards.\nYou have not entered any Commercialized Award Data.\nPrivileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 03/21/2023 Page 3/3",
        "28": "Katie Ressa, Equitus Corporation Nov 05, 2024 Nov 05, 2025"
    },
    "images": [
        {
            "page": 17,
            "image_file": "docNAC01FB74535350c8f622374c8eb3bb9b562f002f8bb94aa28452943298b38eb8c57f1310c918_page17_img1.png",
            "hash": "a64ff5b1d4881b70",
            "position": "Middle Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "equitus.us",
        "name": "N/A",
        "phone": "N/A"
    }
}