{
    "filename": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256.pdf",
    "text_by_page": {
        "1": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Department of Defense (DoD) Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) Program VOLUME 2: TECHNICAL VOLUME Interactive Knowledge Graph Development for Enhanced Digital Transformation in U.S.\nAir Force Applications Volume 2: Technical Volume 1.\nIdentification and Significance of the Problem or Opportunity.\nThe opportunity to investigate the construction of knowledge graphs (KG) will demonstrate understanding of the objectives and the potential to support United States Air Force (USAF) objectives regarding digital transformation of data.\nThe USAF is seeking user input to modifications and additions of techniques currently used to interact with dynamic KGs.\nReal- world KGs (i.e., dynamic KGs) are constantly evolving temporally with modifications of relationships and data (Yan, et al., 2021).\nThis includes, but is not limited to, aspects such as: updating the KG ontology/schema, inferences of additional edges between nodes, reasoning conflicting information, identifying information gaps, and general human-machine interface (HMI) updates.\nKGs are a type of semantic network constructed with cross-domain datasets (Fensel, et al., 2020).\nThey represent some form of knowledge in which entities are related to their attributes and to other entities (Issa, et al., 2021).\nKGs include the capability to represent interrelationships by extracting knowledge from multiple sources with a schema that supports various graph, search, and query interfaces (Baclawski, et al., 2021).\nFigure 001: Example of graph notes and edges.\nPage 1 of 24",
        "2": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC The Web Ontology Language (OWL), based on the Resource Description Framework (RDF), has the capability to model graph-like structures based on this knowledge using common semantics such as nodes and edges (Angels & Guiterrez, 2008).\nIn accordance with graph theory, subjects and objects are represented as nodes (i.e., vertices) while predicates are shown as edges between the nodes (Issa, et al., 2021).\nRDF defines all data as triples composed of a subject, predicate, and object (SPO) [Ernadote, 2015].\nEach triple represents a statement of a relationship between the subject and the object (Angels & Guiterrez, 2008).\nTherefore, the SPO approach aligns with a graph-based data model profile that uses nodes and edges to convey domain structure.\nThese triples are acknowledged as the fundamental element of KG structure (Peng, et al., 2023).\nFigure 002: Rendering of SPO triples.\nThe underlying schema of a KG is an ontology structure, which shows the properties of a specific domain and how they are connected (Peng, et al., 2023).\nAn ontology is an explicit specification of a common language described by a set of representational terms (Gruber, 1993).\nOntologies are viewed as the interface between the knowledge base and reality that guides information shareability, acquisition, and organization (Kang, et al., 2010).\nOntological models define natural language in a machine-readable format (Mejhed Mkhinini, et al., 2020).\nTo accurately exchange information, each relevant entity and relationship must be identified and explicitly defined (van Ruijven, 2015).\nThis constraint results in pitfalls with current KG methodologies including data incompleteness and the inflexibility of querying the database (Arnaout & Elbassuoni, 2018).\nFigure 003: Example of ontology structure.\nPage 2 of 24",
        "3": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Additionally, challenges that have hindered KGs include knowledge acquisition, completion, fusion, and reasoning (Peng, et al., 2020).\nKnowledge acquisition is the general process of collecting elements from multi-structured data to build a KG.\nInformation extraction toolkits use rules, patterns, and statistical features to solicit triples to build the knowledge base.\nMore recently natural language processing (NLP) and deep learning-based toolkits have been used for this process, providing higher performance (Zhong, et al., 2023).\nAfter NLP of the original data source, data features are extracted to define certain attributes or characteristics of triple candidates (Hao, et al., 2021).\nEven though the nature of KGs does not allow for completeness, new triples can be added as part of the refinement stage where typical subtasks include entity and and relationship prediction (Ji, et al., 2022).\nCurrent KGs need an inference engine to predict relations and complete the missing facts (i.e., triples) among available entities.\nLink prediction refers to the relation classification or inference from information captured in the KG.\nKnowledge graph completion (KGC) comprises the process of completing incomplete triples within the KG (Zamini, et al., 2022).\nWell-constructed and large-scale knowledge graphs are useful for many downstream applications and empower knowledge-aware (KA) models with commonsense reasoning.\n(Ji, et al., 2022).\nFigure 004 The quality and amount of data required for interpretation of KGs complicates the user interfaces (UI) [Fuenmayor, et al., 2017].\nThe UI is meant for improved visualization, allowing users to discover relationships between knowledge more easily (Hao, et al., 2021).\nHowever, there is a growing need to holistically assess these capabilities beyond technical optimization (Wang, et al., 2024) to include user experience (UX) during collaboration.\nBased on related work by Wang, et al., 2024, evaluating UX with interactive and dynamic KGs will have a variety of dimensions and use cases depending on the subjects surveyed.\nPage 3 of 24",
        "4": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC This project will contribute to the USAF’s initiatives for an integrated digital ecosystem.\nLeveraging a KG to standardize and manage data fosters interoperability and cohesiveness across the entire enterprise.\nGathering user feedback regarding critical aspects of the dynamic KG enables continuous improvement to maintain relevancy and practicality for USAF personnel.\nBeyond Phase I, this research will provide the foundation for a full KG prototype.\nFigure 005: Tools to assist an integrated digital ecosystem.\n2.\nPhase I Technical Objectives.\nThe goal of this topic is to research techniques that allow a user to interact with a dynamic knowledge graph by making changes and additions to the knowledge graph, and then utilize that user input to suggest additional updates to surrounding nodes/edges in the graph.\nApproach Initial assessment of knowledge graphs (KG) with representative dataset • • Gather user feedback from KG interaction • Feasibility study for dynamic KGs • Develop prototype KG • Assess quality of KG prototype and provide recommendations for Phase II Phase I work will include a feasibility study and analysis based on answers to the following research questions (RQ): RQ1: What techniques are most amenable to constructing interactive KGs?\nRQ2: How should the KG prototype be evaluated for quality?\nRQ3: What best practices should be implemented to gather user feedback?\nRQ4: Which aspects of the KG should be modified to improve KG UX?\nPage 4 of 24",
        "5": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Figure 006: Stages of constructing KGs.\nAnswering these RQs will enable a feasibility study in support of Phase II work.\nThe benefits of an interactive and dynamic KG are anticipated to be: • Enhanced decision-making in real-time • Increased efficiency with automation implementation • User-driven modifications to the KG interface • • Improved scalability for larger datasets Integration of cross-domain knowledge This research and development effort has a broad variety of commercial applications including, but not limited to: • Business intelligence and analytics – Visualizing relationships between data points enhances ability to make quick, well-informed business decisions.\n• Healthcare and medical research – Linking information from disparate sources improves diagnostics and treatment plans by providing a cohesive representation of a patient.\n• Cybersecurity – The ability to quickly recognize patterns and disruptions may suggest a cyberattack or security breach for monitoring when anomalies are discovered.\n• Education – Educational tools can be enhanced by providing students with tailored experiences and adaptive learning plans.\nPage 5 of 24",
        "6": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Figure 007: Commercial applications of KGs.\nRQ1 Technical Approach Figure 008: Capabilities of data visualization KGs represent a linked network of entities and the relationships between them that are leveraged to provide timely information to users.\nKG interactivity enables user capabilities to query, navigate, update, and visualize the information, providing insight into the database.\nThis section describes the technical approach employed by Enola Technologies to answer RQ1 repeated here: What techniques are most amenable to constructing interactive KGs?\nThe team will investigate valuable approaches, select the best-fit based on user needs, and provide a formal report that details results.\nEnola Technologies will conduct a scholarly literature review.\nPrior to the research effort, a questionnaire to members of the Enterprise Data Management (EDM) council on preferred KG construction methods.\nBy narrowing the focus to suggested approaches, the risk of investing effort on suboptimal solutions is reduced.\nEnola Technologies team members have experience performing scholarly literary reviews on topics Page 6 of 24",
        "7": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC such as ontologies, graphical modeling languages, and knowledge graphs which include published works.\nA representative dataset will then be used to classify interactive KG elements based on context, speed, and infrastructure requirements.\nSee the NASA Advanced Air Mobility project within the Related Work section for an example of relative past performance.\nEnola Technologies will research KG user interaction models to identify the design patterns and frameworks that are commonly implemented for data visualization.\nThis systematic literature review will result in a list of interaction metrics.\nThese characteristics will be given a quantifiable score for comparative analyses.\nSee the Telesure Investment Holdings project within the Related Work section for an example of relative past performance.\nThe ability of each technique to support interactive capabilities such as real-time updates, dynamic data inputs, scalability during user interaction, live querying, and node manipulation will be scored.\nThis reliably eliminates KG methods that score poorly from the remainder of the research project which further reduces the scope.\nSee the work performed by various Enola cofounders while working at Dassault Systemes for an example of relative past performance.\nThe team will then assess the success of the implementation by analyzing industry case studies with regard to identified performance and usage metrics.\nEnola Technologies has completed case study analyses to assist clients in determining the optimal model-based systems engineering (MBSE) methodology to implement based on the customer needs.\nTo provide a complete and comprehensive answer to RQ1, all information from previous tasks will be reviewed to select the desired approach for creating KGs.\nThe deliverable will be a comprehensive report detailing the performance metrics, associated scoring, and final results of the trade study.\nThis report will serve as a baseline to aid future KG creation.\nFigure 009 shows an overview of RQ1 tasks along with the inputs and outputs of each.\nRQ2 Technical Approach Figure 009: RQ1 tasks, inputs, and outputs.\nPage 7 of 24",
        "8": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Figure 010: Aspects of quality assurance.\nThis section describes the technical approach employed by Enola Technologies to answer RQ2 repeated here: How should the KG prototype be evaluated for quality?\nA Business Analysis (BA) method with formal principles to elicit quality from both customers and partners will be implemented to account for future improvements of design requirements which reduces the amount of rework.\nSee the Telesure Investment Holdings project within the related work section for an example of relative past performance.\nThe first step towards answering RQ2 is to identify and define the key performance metrics used to evaluate the KG.\nThese indicators will be used during KG database development and user application selection to produces design requirements that must be satisfied.\nBy developing requirements in the initial product development phases, rework is reduced later in the lifecycle.\nAs a tool-agnostic organization, Enola Technologies is able to objectively perform trade study analyses to verify requirements are achieved with adequate software.\nSee the description of the NASA Advanced Air Mobility (AAM) project within the related work section for an example of relative past performance.\nThe team will create a list of prominent existing quality frameworks that are commonly used to evaluate KGs and assess the applicability to this project.\nEvaluation of several options enables a customized set of metrics to create a tailored and valuable end-product while still following best practices.\nEnola Technologies has a strong background integrating various frameworks and data models.\nSee the Army Long Range Hypersonic Weapon (LRHW) and Navy Conventional Prompt Strike (CPS) projects within the Related Work section for relative past performance.\nIntegrating many quality characteristics based on the project-specific needs will produce a new methodology document for program use.\nSee the description of the Insulet project within the Related Works section for relative past performance.\nDefining acceptance criteria for each performance and quality metric formalizes requirements and ensures they will be verified in KG design.\nSpecific, measurable, and testable statements that define success for each parameter will guide KG development.\nThe value of establishing requirements and architecture to guide design decisions is the ability to ensure the KG prototype will adequately meet end-user needs.\nEnola Technologies has completed many projects developing software requirements to guide development.\nSee the Rolls Royce software architecture project within the Related Work section for relative past performance.\nPage 8 of 24",
        "9": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Figure 011: Rules for Valuable Acceptance Criteria Using performance and quality metrics, requirement acceptance criteria, and expected results of KG assessment tools, a trade study will be performed to select the best fit.\nThe output of this analysis will be a full report describing the scoring method and source, rationale for assigned scores, and the final rankings.\nSimilar analyses between alternatives have been performed by Enola team members.\nSee the NASA Advanced Air Mobility project work within the Related Work section for relative past performance.\nFigure 012 shows an overview of RQ2 tasks along with inputs and outputs of each.\nFigure 012: RQ2 tasks, inputs, and outputs.\nPage 9 of 24",
        "10": "Proposal Number [F244-0001-0025] Topic Number [244-0001] RQ3 Technical Approach Enola Technologies, LLC Figure 013: Rating the User Experience This section describes the technical approach employed by Enola Technologies to answer RQ3 repeated here: What best practices should be implemented to gather user feedback?\nEnola Technologies will tackle this RQ with standard business analysis techniques to bridge the knowledge gap between the technical staff and other stakeholders.\nInvestigating how UX metrics integrate into the overall KG quality framework will lead to the definition of additional UX and KG requirements with appropriate acceptance criteria for each.\nAn evolved requirement set will improve the software architecture and guide the development efforts for the interaction layer of the KG.\nSee the Open Model Based Engineering Environment work for NASA JPL within the Related Work section for relative past performance.\nThe team will identify effective ways to track performance and quality metrics for KG UX and complete subsequent trade study analysis to decide among the alternatives.\nThe report trade will consider available tools while describing the approach used with the metrics, scoring criteria, and rationale for each.\nSee the Naval Integrated Modeling Environment development work within the Related Work section for relative past performance.\nFigure 014.\nTracking User Satisfaction Page 10 of 24",
        "11": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC KG UX satisfaction questionnaires will be created to elicit further feedback by tailoring the standardized system usability scale (SUS).\nBased on results, the initial plan may require modifications to address gaps.\nInterviews will be conducted with users regarding KG UX after a random sample of candidates is selected.\nBased on verbal feedback, an iterative approach for software architecture documents additional requirements for implementation.\nThis enables a quick impact assessment of UX KG.\nSee the description of the Insulet project within the Related Work section for relative past performance.\nThese activities will culminate in a development plan with a re-distributed timeline based on the necessary updates to the project plan.\nThis ensures the end-product and its development cycle is aligns with customer success criteria.\nSee the description of the BAE Systems Integrated Digital Engineering Environment (IDEE) project, for relative past performance.\nFigure 015 shows an overview of RQ3 tasks along with the inputs and outputs of each.\nFigure 015: RQ3 tasks, inputs, and outputs.\nRQ4 Technical Approach Figure 016: Tools and techniques for comparative analysis.\nPage 11 of 24",
        "12": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC This section describes the technical approach employed by Enola Technologies to answer RQ4 repeated here: Which aspects of the KG should be modified to improve KG UX?\nThe Enola Technologies team will evaluate capabilities described in RQ3 for KG UX and the feasibility of each.\nSystematically gathering feedback and continuously developing a requirements model and software architecture enables automated impact assessments.\nExecuting tests against the system requirements to validate stakeholder needs have been met in design will comprise a portion of the feasibility study.\nSee the Insulet project for relative past performance.\nFigure 017: KG Spiral Product Lifecycle The team will generate a report of all Phase I results to answer RQ4.\nThis report will provide a summary of work completed and desk instructions to provide users with KG prototype training.\nThis deliverable will provide a foundation for Phase II prototype research and development efforts to further improve the KG UX.\nCapabilities that are anticipated to alleviate the USAF concerns with KG UX and AI/ML are planned to encompass the majority of Phase II work.\nThe final technical report will outline how these techniques can be implemented to poise Enola Technologies in a position for success.\nThe Enola Technologies team has many published journal articles which emphasizes the ability to write reports that facilitate communication among stakeholders.\nFigure 018 shows an overview of RQ4 tasks along with the inputs and outputs of each.\nPage 12 of 24",
        "13": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Figure 018: RQ4 tasks, inputs and outputs.\n3.\nPhase I Statement of Work.\nThe following sections discuss the proposed statement of work (SOW).\nScope Table 1 captures statements from the Request for Proposal (RFP) that encompass the SOW scope for Phase I.\nTable 1:RFP Statements Applicable to Phase I SOW ID SOW.1 SOW.2 SOW.3 RFP Statement This may include, but is not limited to, aspects such as: updating the graph’s underlying ontology/schema, inferring additional edges between nodes, highlighting conflicting information in the graph, highlighting information gaps, and suggesting additional changes to the graph because of the user’s modifications.\nAI/ML approaches for identifying, structuring, and storing data are not 100% trusted by analysts, so there is a requirement to enable the analyst to make corrections to the data as needed and manually add additional data.\nPHASE I: Phase I awardee(s) will experiment with and assess feasibility of different approaches to allow for user modifications to a dynamic knowledge graph and predict additional necessary changes to the graph based on the user’s input.\nSOW.4 Based on these results, develop an initial prototype design and document all work completed in this feasibility study.\nTable 2 shows Phase I requirements derived from the information in Table 1.\nEach requirement has the verification method and the associated deliverable.\nTable 2: Phase I Requirements Derived From ID Requirement SOW.1 REQ.1 SOW.2 REQ.2 SOW.3 REQ.3 REQ.4 SOW.4 REQ.5 Development of the dynamic knowledge graph shall consider the following aspects: the underlying ontology/schema, inference of edges between nodes, visualization of conflicting information, and identification of information gaps.\nData analysts shall be able to make corrections to the data as needed and manually add additional data.\nPhase I shall assess the feasibility of various approaches that allow for user modifications to dynamic knowledge graphs.\nPhase I shall assess the feasibility of various approaches that predict changes to the knowledge graph based on user input.\nThe contractor shall develop a KG prototype design based on the feasibility study results.\nVerif.\nMethod Deliverable Analysis KG Prototype Demonstration Test Reports Analysis Analysis Feasibility Study and Results Feasibility Study and Results Inspection KG Prototype Page 13 of 24",
        "14": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Derived From ID Requirement Verif.\nMethod Deliverable REQ.6 The contractor shall document all work completed in this feasibility study.\nInspection Progress Reports Milestone Schedule Table 3 represents the notional timeline for completing Phase I milestones based on the proposed technical approach and tasks.\nTable 3:Notional Timeline for Phase I Milestones Milestone Identify Initial Techniques Collect User Feedback Analyze User Feedback Complete Feasibility Study Update KG Prototype 1 x 2 x x Deliverables The final deliverables for Phase I work will be: Month 3 4 5 6 x x x x • Feasibility study of various approaches that enhance KG UX aspects • Dynamic and interactive KG prototype Progress Reports Six (6) monthly progress reports will be provided by the Offeror with Phase I project updates based on the SOW.\nEach report will include the following: • Work progress and significant events by task • Identification of any technical and/or programmatic issues • Plans for next reporting period • Transition progress or updates to plan • Labor hours and cost expenditures relative to plans Final Report with Standard Form (SF) 298 A complete and final Standard Form (SF) 298 – Report Documentation Page will be submitted by the Offeror within six (6) months of the contract award date.\n4.\nRelated Work.\nThis section will describe the Offeror’s experience completing related work.\nPage 14 of 24",
        "15": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Aleczander Jackson, CEO of Enola Technologies, was the lead Enterprise Architect for the NASA Advanced Air Mobility program (2020 – 2021).\nThis program began with a trade study of alternative Model Based Systems Engineering (MBSE) and Enterprise Architeture tools, selecting criteria such cost, performance, and configuration management to evaluate each.\nThis program, joint with the FAA, was a pathfinder for the adoption of modeling techniques for an advanced enterprise for NASA Aeronautics Research Mission Directorate (ARMD).\nThe work performed applicable to this proposal include utilizing a publicly sourced dataset (e.g., flight logs from the FAA Database).\nIntegrating data formats in real systems ensures aircraft capacity to communicate with the GFE.\nThe Lead System Architect for this effort is Jim Murphy, james.r.murphy@nasa.gov.\nIn an Enola team member’s collaboration with Telesure Investment Holdings (June 2020 – December 2020), specific aspects were determined to measure the success of the micro app and guide development efforts.\nWe identified key performance indicators such as user engagement rates, the conversion rate of policy purchases, average onboarding time, and the number of customer support inquiries.\nBy setting these metrics early on, the team quantitatively assessed the system performance, made informed decisions, and ensured alignment between user expectations and business objectives.\nintegrated analytics tools to track user interactions, observing navigation patterns, feature usage, and points where users might encounter difficulties.\nThis real-time data allowed prompt identification of improvement areas.\nBy analyzing these insights, targeted adjustments were made (e.g., refining user interfaces and processes) that resulted in a more intuitive experience.\nGathering feedback from users was a critical aspect of this approach.\nDuring the design and prototyping phases, user testing sessions allowed participants to share impressions and suggestions.\nAfter the product launch, we continued to collect feedback through in-app surveys, user reviews, and monitoring customer support channels.\nThis ongoing dialogue with users enabled us to understand their needs and preferences, allowing us to make iterative improvements that kept the application aligned with customer expectations and overall satisfaction.\nThe primary point of contact from the project was Nicholas Cole, nicholas@td.dev, +27 82 322 8184 Several of Enola’s employees have worked with tool vendors, gaining experience gathering and prioritizing UX feedback from clients to improve Dassault Systeme’s products.\nThis work was completed at No Magic Incorporated (2012 – 2019), prior to Dassault Acquisition.\nIn this capacity, these staff members were required to attend the Customer Appreciation Board (CAB) and record suggested changes.\nFrom these meeting minutes, detailed requirements were derived for allocation to the appropriate components.\nThe lead point of contact for this endeavor was Enrique Krajmalnik, now CEO of Zuken/Vitech, Enrique.krajmalnik@vitechcorp.com, (469) 744-4277 Enola Technologies has completed case study analyses to assist clients in determining the optimal MBSE methodology to implement based on the customer needs.\nThe Model of Models approach by Jackson, et al., 2021, has become a prominent standard used on many government programs such as the Army’s XM30.\nAs another example specific to the U.S.\nNavy, this methodology was used on Navy Conventional Prompts Strike and Army Long Range Hypersonic Weapon (2019 – 2021) to increase reuse between services of the common missile glidebody while differentiating the missiles at the booster level.\nThe point of contact from the Navy side for this effort is John Clarke, who is currently an Engineering Program Manager at Innovative Defense Technologies (IDT), (732) 720-9772.\nPage 15 of 24",
        "16": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Enola Technologies currently supports Insulet, an insulin pump provider, with a range of services including Digital Transformation, Model Based Systems Engineering, Enterprise Architecture, and Software Architecture.\nThe team first tailored an enterprise architecture framework by integrating core concepts among multiple options into the software architecture.\nThis is an ongoing project, as Enola Technologies is responsible for managing a continuously updating software architecture model.\nThis required integration of a system architecture to multiple variants with different features an exemplifies the team’s ability.\nOur lead point of contact for this contract is Brittany Alphonse, balphonse@insulet.com, (774) 275-0410 Enola Technologies has completed many projects developing software requirements to guide product development and inherent software architecture.\nA specific example is the work completed for a Rolls Royce program (2020).\nThe classification level of the required data was an unforeseen obstacle overcome by a current member of the Enola Technologies team.\nBy recreating the software functionality within certain parameters, the expected behavior was demonstrated to meet acceptance criteria.\nThe work by Enola Technologies for this project complemented an MBSE product with an AI application to estimate attack scenarios for engine processors.\nThe contract owner for this endeavor was Steve “Ox” Sunderlin who is a Senior Systems Engineer and Program Manager at Modern Technologies Solutions Inc, Steve.sunderlin@mtsi-va.com.\nRelated work performed by Enola Technologies team members includes a requirements elicitation method for NASA Jet Propulsion Lab’s (JPL) Open Model Based Engineering Environment (MBEE), funded by Europa Clipper (2013).\nThe team performed customer interviews and requirements gathering methods to build a robust systems architecture for the next cadence of development work each scheduled increment.\nOpen MBEE is a well-respected, open-source digital middleware product that has advanced since Enola Technologies’ involvement.\nThe lead point of contact for the effort is Christopher Delp, who is current Group Supervisor at the NASA JPL, chris.delp@jpl.nasa.gov, (818) 319-3251.\nEnola has a co-founder that conducted a trade study of commercially available MBSE tools for the U.S.\nNavy, initially filtering them based on a small set of critical stakeholder-defined requirements known as the Naval Integrated Modeling Environment (IME) (2017 – 2020).\nThe tools that satisfied initial stakeholder needs were then evaluated on factors like interoperability, industry adoption, and SyML compliance, leading to the selection of the top three tools for Navy-wide deployment.\nThe current point of contact for this effort is Kristi Yurko who is the Lead Engineer for the Systems Engineering Transformation (SET) Program, Kristi.M.Yurko.civ@us.navy.mil, (240) 725-0475.\nAt BAE Systems, Enola Technologies was hired to develop the Integrated Digital Engineering Environment (IDEE) while training and coaching staff on their MBSE approach (2021 – 2024).\nThe team successfully built a data warehouse architecture, while training and coaching the following positions: • Business analysts – for requirements elicitation and feedback gathering • Enterprise architects – for business process optimization • Data architects – to ensure business processes drive data production • Ontologists – to develop the data warehouse schema Page 16 of 24",
        "17": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Enola Technologies accomplished the aforementioned through an integrated set of architectures.\nBy leveraging the digital thread, the team was able to model, perform time-based simulations, verify data parity, and perform full traceability for automated impact assessments.\nThe technical lead on this endeavor was David Cooper, who was the Digital Engineering Lead for BAE Systems Combat Mission Systems, david.a.cooper@baesystems.com, (612) 708-9659.\n5.\nRelationship with Future Research or Research and Development.\n(a) The anticipated results of this Phase I approach include: • KG quality metrics to be assessed • KG quality assessment results • KG UX survey results • KG feasibility study and recommendations • Interactive and dynamic KG prototype (b) By demonstrating the feasibility of this approach to constructing a dynamic KG, confidence is built for the project to develop a full-scale prototype with in-depth capability analysis.\n(c) Phase II testing and subsequent evaluations of the KG prototype is not dependent on any specific clearance or certifications.\nFigure 019: Aspects of KGs Page 17 of 24",
        "18": "Proposal Number [F244-0001-0025] Topic Number [244-0001] 6.\nCommercialization Strategy.\nEnola Technologies, LLC The commercialization strategy for an interactive KG within the USAF focuses on the key areas described in the following sections: • Product definition and value proposition Real-time capabilities reduce decision latency while increasing overall data accuracy.\nKG user-validated data reduces rework and boosts confidence when making decisions in time-sensitive scenarios.\nThe integration of knowledge from multiple disparate sources expands situational awareness based on the continuous learning and updates of the KG data repository.\nA cohesive representation of information increases interoperability for utilization between sectors and scalability of the dataset.\nActing as a persistent knowledge repository is ideal for long-term military efforts with inevitable personnel turnover as there is a major issue with knowledge loss as subject matter experts retire.\n• Market needs analysis Figure 020: Visualization of Data Lakes Target markets include defense and military sectors where rapid, adaptive intelligence is critical.\nHigh-growth sectors of these industries should be evaluated based on desire for AI-driven data management.\nKey industries such as business intelligence and analytics, cybersecurity, healthcare and medical research, and education have been identified as commercial users from initial assessment.\nFigure 021: Market Analysis Page 18 of 24",
        "19": "Proposal Number [F244-0001-0025] Topic Number [244-0001] • Go-to-market strategy Enola Technologies, LLC Prior to collaboration with defense contractors, pilot product demonstrations should showcase real-world applications and prototype effectiveness.\nPartnering with artificial intelligence (AI) and machine learning (ML) companies to expand functionality and integrate related solutions will prove invaluable when launching this product.\nWe’d then develop industry-specific datasets and use cases with the system which we’d demo to the various industries (for a non-military-specific example, medical data integrating real-time medical systems within a hospital environment) • Anticipated commercialization results Figure 022: Go-to-market strategy We anticipate that the system that we provide will be scalable, adaptable, and able to be queried in a significant number of ways.\nThis will enable it to prove effective in various domains, both government-specific and within the commercial industry.\nAs each are facing similar challenges pertaining to the linkage of knowledge, trust of the data, and ability to navigate complex graphs, we believe the same solution can easily be retrofitted, if built correction, and tailored to many different industries/scenarios within various industries.\nFigure 023: Step to execute go-to-market strategy Page 19 of 24",
        "20": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC 7.\nKey Personnel.\nKey personnel identified for Phase I work and concise resumes for each individual are detailed in this section.\nSarah Rudder Sarah Rudder is an accomplished systems engineer (SE) with particular expertise in model-based systems engineering (MBSE), ontologies, and enterprise architecture frameworks.\nShe is currently a principal SE with Enola Technologies, LLC.\nSarah earned her B.S.\nin Biosystems Engineering from Auburn University and her M.S.\nin Industrial and Systems Engineering from the University of Tennessee – Knoxville.\nShe is a current doctoral student at Colorado State University with a research focus on systems engineering ontologies and applications.\nShe is a registered Professional Engineer (PE) [#35148], Certified Systems Engineering Professional (CSEP), and has obtained the Object Management Group (OMG) SysML Model Builder certification.\nRelevant Publications Rudder, S., & Herber, D.\n(2024).\nImportance of Ontologies for Systems Engineering (SE) and Human Factors Engineering (HFE) Integration.\nHuman Systems Engineering and Design (IHSED2024): Future Trends and Applications, 2(2).\nhttps://doi.org/10.54941/ahfe1005544 Tim Anderson Tim Anderson is a founder and current Chief Operations Officer (COO) of Enola Technologies.\nTim has led the company since its inception, driving innovation in digital engineering solutions.\nPrior to this position, he held key roles at CACI International and No Magic, Inc., where he specialized in systems and software engineering, defense contracts, and developing enterprise solutions.\nTim has a B.S.\nin Computer Engineering from The University of Texas at Dallas where he further developed his skillset with private tutoring in the fields of mathematics and physics.\nPage 20 of 24",
        "21": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Aleczander Jackson Aleczander Jackson is the CEO of Enola and runs the digital transformation/engineering division.\nDuring Aleczander’s career, he was trained in ontologies and the use of populated knowledge graphs based on said ontologies.\nIn addition, he also had the pleasure of training and coaching the Office of the Under Secretary of Defense’s (Research and Engineering) OUSD (R&E) Digital Engineering Cohort which were the group who wrote and published the government’s overarching Digital Engineering Strategy.\nBased on that, and his extensive background with enterprise architecture, ontologies, software architecture, data models, MBSE, and electrical design; Alec wrote and rolled-out for three commercial and six government contractor clients a proprietary method on digital transformation centered around the digital thread being manifested as an ontology-defined data warehouse that integrates the data as a series of knowledge graphs from multiple tools in a tool-agnostic, yet process- dependent approach.\nRelevant Publications Jackson, A., Palmer, B., Cobb, D., & McCreless, J.\n(2021).\nModel of Models Methodology: Reuse Your Architectural Data.\nINCOSE International Symposium, 31(1), 1303–1318.\nhttps://doi.org/10.1002/j.2334- 5837.2021.00902.x 8.\nForeign Citizens.\nNone.\n9.\nFacilities/Equipment.\nPhase I work does not require additional equipment purchases.\nAll Offeror facilities meet environmental laws and federal/state regulations.\n10.\nSubcontractors/Consultants.\nAuros Knowledge Systems (KS) is a software developer and leader in providing next-generation knowledge management (KM) solutions across industries such as transportation and mobility, marine and offshore operations, and aerospace and defense.\nThe organization’s primary software, AurosIQ, is based on the KA approach.\nThis methodology promotes temporal knowledge capture, provisioning, evaluation, and management of a disparate dataset.\nThe KA method is a comprehensive approach to continuously collect, deliver, and apply trusted knowledge within a workflow.\nData is temporally gathered from best practices, lessons learned, methods, requirements, standards, and techniques to deliver information to employees and departments when it’s needed.\nProviding accurate information in real-time accelerates technical analysis and decision-making while improving organizational reliability and product quality.\nAdditional benefits of the KA approach combined with AurosIQ include: Page 21 of 24",
        "22": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC • Increased productivity of knowledge workers • Consistent multi-location processes and techniques • Information retention • Reduced human error • Unified data repository 11.\nPrior, Current or Pending Support of Similar Proposals or Awards.\nNo prior, current, or pending support has been provided for proposed work.\n12.\nTechnical Data Rights.\nSee technical data rights in Volume V – Supporting Documents for DFARS 252.227-7017 - Identification and Assertion of Restrictions on the Government's Use, Release, or Disclosure of Technical Data or Computer Software.\n13.\nIdentification and Assertion of Restrictions on the Government's Use, Release, or Disclosure of Technical Data or Computer Software.\nThe Offeror asserts for itself, or the persons identified below, that the Government's rights to use, release, or disclose the following technical data or computer software should be restricted: Technical Data or Computer Software to be Furnished with Restrictions Auros IQ Software Basis for Assertion Asserted Rights Category Name of Person or Organization Asserting Restrictions Pre-Existing Commercial Software Restricted Rights Auros LLC References: Angels, R.\n& Gutierrez, C.\n(2008).\nSurvey of graph database models.\nACM Computing Surveys, 40(1), 1–39.\nhttps://doi.org/10.1145/1322432.1322433 Arnaout, H.\n& Elbassuoni, S.\n(2018).\nEffective searching of RDF knowledge graphs.\nJournal of Web Semantics, (48), 66-84.\nhttps://doi.org/10.1016/j.websem.2017.12.001.\nBaclawski, K., Bennett, M., Berg-Cross, G., Schneider, T., Sharma, R., Singer, J., & Sriram, R.\nD.\n(2021).\nOntology summit 2020 communiqué: Knowledge graphs.\nApplied Ontology, 16(2), 229–247.\nhttps://doi.org/10.3233/AO-210249 Budlong, E., Pine, C., Zappavigna, M., Homer, J., Proefrock, C., Gucwa, J., Crystal, M., & Weischedel, R.\n(2013).\nInteractive Information Extraction and Navigation to Enable Effective Link Analysis and Visualization of Unstructured Text.\nProceedings of the AAAI Conference on Artificial Intelligence, 27(2), 1493–1500.\nhttps://doi.org/10.1609/aaai.v27i2.18988 Page 22 of 24",
        "23": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Ernadote, D.\n(2015).\nAn ontology mindset for system engineering.\nhttps://doi.org/10.1109/SysEng.2015.7302797 Fensel, D., Şimşek, U., Angele, K., Huaman, E., Kärle, E., Panasiuk, O., Toma, I., Umbrich, J., & Wahler, A.\n(2020).\nIntroduction: What Is a Knowledge Graph?\nIn D.\nFensel, U.\nŞimşek, K.\nAngele, E.\nHuaman, E.\nKärle, O.\nPanasiuk, I.\nToma, J.\nUmbrich, & A.\nWahler (Eds.), Knowledge Graphs: Methodology, Tools and Selected Use Cases (pp.\n1– 10).\nSpringer International Publishing.\nhttps://doi.org/10.1007/978-3-030-37439-6_1 Fuenmayor, L., Collarana, D., Lohmman, S., & Auer, S.\n(2017).\nFaRBIE: A Faceted Reactive Browsing Interface for Multi RDF Knowledge Graph Exploration.\nGruber, T.\nR.\n(1993).\nA translation approach to portable ontology specifications.\nKnowledge Acquisition, 5(2), 199–220.\nhttps://doi.org/10.1006/knac.1993.1008 Hao, X., Ji, Z., Li, X., Yin, L., Liu, L., Sun, M., Liu, Q., & Yang, R.\n(2021).\nConstruction and Application of a Knowledge Graph.\nRemote Sensing, 13(13), 2511.\nhttps://doi.org/10.3390/rs13132511 Issa, S., Adekunle, O., Hamdi, F., Cherfi, S.\nS.-S., Dumontier, M., & Zaveri, A.\n(2021).\nKnowledge Graph Completeness: A Systematic Literature Review.\nIEEE Access, 9, 31322–31339.\nIEEE Access.\nhttps://doi.org/10.1109/ACCESS.2021.3056622 Jackson, A., Palmer, B., Cobb, D., & McCreless, J.\n(2021).\nModel of Models Methodology: Reuse Your Architectural Data.\nINCOSE International Symposium, 31(1), 1303–1318.\nhttps://doi.org/10.1002/j.2334-5837.2021.00902.x Ji, S., Pan, S., Cambria, E., Marttinen, P., & Yu, P.\nS.\n(2022).\nA Survey on Knowledge Graphs: Representation, Acquisition, and Applications.\nIEEE Transactions on Neural Networks and Learning Systems, 33(2), 494–514.\nIEEE Transactions on Neural Networks and Learning Systems.\nhttps://doi.org/10.1109/TNNLS.2021.3070843 Kang, D., Lee, J., Choi, S., & Kim, K.\n(2010).\nAn ontology-based Enterprise Architecture.\nExpert Systems with Applications, 37(2), 1456–1464.\nhttps://doi.org/10.1016/j.eswa.2009.06.073 Mejhed Mkhinini, M., Labbani-Narsis, O., & Nicolle, C.\n(2020).\nCombining UML and ontology: An exploratory survey.\nComputer Science Review, 35, 100223.\nhttps://doi.org/10.1016/j.cosrev.2019.100223 Peng, C., Xia, F., Naseriparsa, M., & Osborne, F.\n(2023).\nKnowledge Graphs: Opportunities and Challenges.\nArtificial Intelligence Review, 56(11), 13071–13102.\nhttps://doi.org/10.1007/s10462-023-10465-9 Rudder, S.\n& Herber, D.\n(2024).\nImportance of Ontologies for Systems Engineering (SE) and Human Factors Engineering (HFE) Integration.\nHuman Systems Engineering and Design (IHSED2024): Future Trends and Applications, 2(2).\nhttps://doi.org/10.54941/ahfe1005544 van Ruijven, L.\n(2015).\nOntology for Systems Engineering as a base for MBSE.\nINCOSE International Symposium, 25, 250–265.\nhttps://doi.org/10.1002/j.2334- 5837.2015.00061.x Yan, Y., Liu, L., Ban, Y., Jing, B., & Tong, H.\n(2021).\nDynamic Knowledge Graph Alignment.\nPage 23 of 24",
        "24": "Proposal Number [F244-0001-0025] Topic Number [244-0001] Enola Technologies, LLC Zamini, M., Reza, H., & Rabiei, M.\n(2022).\nA Review of Knowledge Graph Completion.\nInformation, 13(8), 396.\nhttps://doi.org/10.3390/info13080396 Page 24 of 24"
    },
    "images": [
        {
            "page": 1,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page1_img1.png",
            "hash": "96386b274d9678b4",
            "position": "Bottom Center"
        },
        {
            "page": 2,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page2_img2.png",
            "hash": "e08b1ff41d0b0ef4",
            "position": "Middle Center"
        },
        {
            "page": 2,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page2_img3.png",
            "hash": "95937ead6bc021cc",
            "position": "Bottom Center"
        },
        {
            "page": 3,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page3_img2.png",
            "hash": "d49c0f69690fb4f0",
            "position": "Middle Center"
        },
        {
            "page": 4,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page4_img2.png",
            "hash": "926d696c6c396d38",
            "position": "Middle Center"
        },
        {
            "page": 5,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page5_img2.png",
            "hash": "c3c868cd37633c3a",
            "position": "Top Center"
        },
        {
            "page": 6,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page6_img1.png",
            "hash": "91b5184a9e5e2f95",
            "position": "Top Center"
        },
        {
            "page": 6,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page6_img2.png",
            "hash": "d46666f44d5c22cb",
            "position": "Middle Center"
        },
        {
            "page": 7,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page7_img2.png",
            "hash": "c0bf4fc1b430361f",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page8_img2.png",
            "hash": "f20d0df20df2f20d",
            "position": "Top Center"
        },
        {
            "page": 9,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page9_img2.png",
            "hash": "c33c3d383cc33cc3",
            "position": "Top Center"
        },
        {
            "page": 9,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page9_img4.png",
            "hash": "976a41953e6968a7",
            "position": "Middle Center"
        },
        {
            "page": 10,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page10_img2.png",
            "hash": "963c69ce9ab13686",
            "position": "Top Center"
        },
        {
            "page": 10,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page10_img4.png",
            "hash": "cc333333319e33cc",
            "position": "Bottom Center"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page11_img2.png",
            "hash": "c6f151cc2a367ae1",
            "position": "Middle Center"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page11_img4.png",
            "hash": "8769a63879687897",
            "position": "Bottom Center"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page12_img1.png",
            "hash": "cfcc3838e7c63226",
            "position": "Middle Center"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page12_img3.png",
            "hash": "f05626a949e0f1de",
            "position": "Bottom Center"
        },
        {
            "page": 17,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page17_img2.png",
            "hash": "c4d10e1e5be3e29c",
            "position": "Middle Center"
        },
        {
            "page": 18,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page18_img1.png",
            "hash": "c06b94627b957bc4",
            "position": "Bottom Center"
        },
        {
            "page": 18,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page18_img3.png",
            "hash": "d91b66f318c43c9c",
            "position": "Middle Center"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page19_img2.png",
            "hash": "a15c4e3b5be1611e",
            "position": "Middle Center"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page19_img4.png",
            "hash": "8c949c7e736954f0",
            "position": "Bottom Center"
        },
        {
            "page": 20,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page20_img2.png",
            "hash": "c4c311ce4e3b07f6",
            "position": "Top Right"
        },
        {
            "page": 20,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page20_img4.png",
            "hash": "93c964264da64ede",
            "position": "Middle Right"
        },
        {
            "page": 21,
            "image_file": "docNAC01FB7453534d9c2f5ec3e0da6652d7c567143c3ab444f3e3acf4010c12a768b687274ba256_page21_img2.png",
            "hash": "993b66e44766446e",
            "position": "Middle Right"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "N/A",
        "name": "N/A",
        "phone": "N/A"
    }
}