{
    "filename": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0064 Proposal Operationalizing Dynamic Knowledge Graphs to Enhance AI/ML-Driven Decision- Title: Making and Situational Awareness Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: AKTIVER LLC Address: Website: UEI: CAGE: 2438 N SURREY CT, CHICAGO, IL 60614-2115 https://www.aktiver.io/ LLZYM735J8U6 92TL7 SBA SBC Identification Number: 002661258 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 5 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_002661258 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_002661258.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [ ] White [ ] Black or African American [X] Do not wish to Provide 14.\nEthnicity of the offeror: DO NOT WISH TO PROVIDE 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud- NO related crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Title Business Name Date Malachi Keddington Malachi Keddin Chief Business Officer AKTIVER LLC 10/14/2024 gton",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?NO VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: Aktiver’s proposed solution for this Small Business Innovation Research (SBIR) initiative is a transformative, adaptive knowledge graph platform designed to enable real-time, data-driven decision support, streamline usability, and build user confidence.\nRecognizing a critical gap between data, AI, and effective decision-making, we observed that many organizations struggle to fully realize the potential of their AI/ML investments.\nAktiver is pioneering a new approach that reimagines AI architecture from the ground up, leveraging Resource Description Framework-Star (RDF)* as its foundation.\nBuilt on a rigorous framework of lambda calculus, graph theory, and geometric spatial logical reasoning, Aktiver’s system is deterministic and interpretable, creating a transparent bridge between human insight and machine learning outputs that is traceable back to Subject Matter Experts (SMEs) for validation.\nCentral to Aktiver’s approach is advancing human-machine teaming through explainable AI and intuitive user interaction.\nThe solution includes an easy-to-use graphical user interface (GUI) that enables users to interact seamlessly with the knowledge graph, access insights, and make real-time modifications without requiring extensive technical expertise.\nThis user-centered design fosters rapid feedback cycles, ensuring that each stage of development is aligned with operational goals and end-user needs.\nThe Phase I effort will focus on extending Aktiver’s baseline product to research and prototype a dynamic, adaptive knowledge graph system capable of supporting critical decision-making in complex, data-intensive environments.\nThis phase aims to build an initial prototype that validates the system’s adaptability, real-time capabilities, and alignment with the DoD and other mission-critical applications.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development:",
        "5": "The development of Aktiver’s dynamic, adaptive knowledge graph platform is expected to deliver substantial benefits across a variety of sectors, providing an advanced solution for real-time, data-driven decision-making in complex environments.\nThis technology’s design focuses on usability, adaptability, and integration, enabling organizations to unlock the full potential of their AI/ML investments.\nKey anticipated benefits and applications include: 1.\nEnhanced Decision-Making: The platform enables real-time insights, allowing users to make data-driven decisions with greater accuracy and speed.\nIts predictive updating and explainable AI enhance confidence in AI outputs, particularly in mission-critical contexts where timely and reliable insights are essential.\n2.\nImproved Human-Machine Teaming: With a focus on intuitive user interaction, the system facilitates collaboration between human operators and AI systems, creating a transparent decision-making process.\nThis approach allows Subject Matter Experts (SMEs) to validate and adjust AI-driven recommendations, making the system highly adaptable to specific operational needs.\n3.\nIncreased Data Interoperability and Integration: The use of RDF* and semantic data modeling allows the knowledge graph to seamlessly integrate data from multiple sources and domains, breaking down silos and creating a unified, accessible data environment.\nThis interoperability is especially beneficial in defense, intelligence, and large- scale commercial applications.\n4.\nScalability Across Complex Data Environments: The platform’s architecture is designed for scalability, allowing it to handle expanding data volumes and adapt to new data inputs and requirements over time.\n5.\nReduced Cognitive Load on Users: By automating the inferencing and adaptation of the knowledge graph in response to new data and user inputs, the system significantly reduces the cognitive load on analysts and decision- makers, leading to faster, more efficient workflows.\nCommercial Applications 1.\nDefense and Intelligence: DoD and IC can leverage this technology for situational awareness, threat detection, pattern of life analysis, and mission planning.\nThe adaptive knowledge graph enables real-time updates and predictions, improving decision-making.\n2.\nHealthcare: Healthcare providers and pharmaceutical companies can use the platform to analyze complex patient data, integrate diverse medical records, and support clinical decision-making.\n3.\nSupply Chain and Logistics: For industries with complex supply chains, such as manufacturing and retail, the platform offers insights into logistics, inventory management, and risk mitigation.\nAktiver’s adaptive knowledge graph platform holds significant potential to become a transformative tool for sectors that require agile, data-driven decision support.\nIts unique approach will enable organizations to maximize the value of their data and AI investments.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is",
        "6": "obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: adaptive knowledge graph, real-time decision support, explainable AI, RDF*, human-machine teaming, data interoperability, semantic data and knowledge modeling, dynamic data integration, ontology management VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 100% 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES 3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES NO 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO",
        "7": "3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO 16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n70% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES VOL I - Contact Information Principal Investigator Name: Joe Hoeller Phone: (512) 348-5756 Email: joe.hoeller@aktiver.io Address: 2438 N SURREY CT, CHICAGO, IL 60614 - 2115 Corporate Official Name: Malachi Keddington Phone: (813) 285-6652 Email: mk@aktiver.io Address: 850 Golf and Sea Blvd, Apollo Beach, FL 33572 - 2740 Authorized Contract Negotiator Name: Malachi Keddington Phone: (813) 285-6652 Email: mk@aktiver.io Address: 850 Golf and Sea Blvd, Apollo Beach, FL 33572 - 2740 Form Generated on 11/06/2024 11:35:27 AM",
        "8": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] Operationalizing Dynamic Knowledge Graphs Volume 2: Technical Volume 1.0 Introduction to Aktiver At Aktiver, we’re not just changing how data is used; we’re pioneering a new era of data-driven decision- making.\nBy shifting the focus away from traditional data lake architectures and AI workflows to advanced decision support systems driven by geometric graph structures that represent human-level reasoning.\nRecognizing a fundamental gap between data, AI, and decision-making, we have observed that many organizations struggle to fully realize the potential of their AI/ML investments.\nDespite significant advancements, these systems often fall short in delivering the depth, such as nested contexts, and accuracy needed for critical decision-making.\nThe challenge lies not in the technology itself, but with its application’s foundation.\nMost solutions focus on processing data rather than transforming it into a logical geometric structure that represents the real-world.\nAt Aktiver, we are addressing this gap by developing advanced AI systems that seamlessly integrate human-level reasoning, ensuring organizations can harness their data to its fullest potential, leading to smarter, more informed decisions.\nStarting with the fundamental thesis of “What does it mean for AI to truly understand?”, Aktiver constructs a logical data model and transforms it into an open ontology built on (open) W3C standards.\nThis solution rapidly and automatically transforms any data (SQL, noSQL, JSON, PDF, CSV, imagery, Excel, etc) into an RDF based Semantic Knowledge Graph.\nThe foundation is built on top of Mathematical Symbolism, FOLs (First Order Logic), Lambda Calculus, Graph Theory, and various geometries that represent spatial logical reasoning, (not to be confused with predictive reasoning).\nThis enables Aktiver to have a decision-making system that is interpretable, explainable, knowledge traceable, back to the SME.\nWhich can even hesitate, if there is not enough data (information gain/information entropy) to make a decision.\nInherently, due to the hesitation, the SME also knows up front which data is missing in order to perform a certain task or analysis towards an actionable outcome.\nThis agent-based system is designed to iterate quickly, dynamically updating ontologies and triple store connections in response to new data or expert SME input.\nThe result is an AI system capable of human- like reasoning and thought processes, pushing the boundaries of what AI can achieve by bridging the gap between data processing and intelligent decision-making.\nAktiver is an early-stage startup, bootstrapped by our founders who come from diverse big tech backgrounds and share a fundamental belief in a new approach to data and decision-making.\nWith experience at the forefront of the industry, our founders recognized the limitations of traditional methods and set out to create a more intelligent, adaptable solution.\nOur deep understanding of technology, combined with a passion for innovation, drives Aktiver’s mission to redefine how organizations across industries, including healthcare, the Department of Defense (DoD), finance, and manufacturing make better, more accurate decisions with their data.\nBy unlocking the full potential of AI, not yet realized in other technologies, we empower these sectors to solve complex challenges and make smarter, more strategic decisions in an increasingly data-driven and competitive world.\n2.0 Executive Summary: One of the biggest challenges with knowledge graphs is knowing where to start.\nToo often, organizations invest months or even years in building, refining, and updating their ontology before they begin analyzing their data.\nThe outcome is frequently disappointing, by the time they engage with the data, they realize that the ontology and system they meticulously developed do not meet the practical needs of their users or analysts.\nThis disconnect between the ontology and real-world operational requirements is a common issue across many sectors, from defense to finance, healthcare, and research.\n1",
        "9": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] We are now witnessing a shift as organizations attempt to leverage AI/ML techniques to accelerate the ingestion of data into knowledge graphs.\nWhile this approach holds the potential to dramatically improve processing speed and efficiency, it has also introduced a new set of challenges.\nMany existing workflows are not designed to construct a logical data model or ontology directly from raw data inputs, limiting their effectiveness in real-world applications.\nThe rigidity of most knowledge graph architectures compounds this issue, as they often lack the flexibility to dynamically iterate, update connections, or adapt to evolving datasets.\nAdditionally, these systems struggle to integrate or reconcile diverse canonical controlled vocabularies (CCVs), which are critical for maintaining semantic consistency across various domains.\nFurthermore, analysts and users often struggle to fully trust AI/ML automation to consistently make accurate and timely data connections.\nThere is a critical need for systems that can dynamically iterate ontologies, connections, and data models based on the inherent knowledge of subject matter experts (SMEs).\nWe see a fundamental and significant gap in current technologies: The capability to easily edit, update, and modify these systems, while allowing them to learn from SME inputs and continuously refine their models.\nAt Aktiver, we are attempting to solve this problem by developing a system capable of managing large volumes of data while maintaining human-level reasoning at its core.\nInstead of focusing solely on the data or the AI, our approach begins by constructing a logical data model fully aligned with mission requirements and use cases.\nThis ensures that every aspect of data collection, curation, and analysis is directly tied to operational goals.\nOnce the data model is established, Aktiver’s tooling seamlessly integrates the data into an RDF knowledge graph.\nThis knowledge graph can be a third-party system or through the RDF Graph Store inherent in the Aktiver platform.\nBy mapping relationships within the RDF knowledge graph, we are able to unlock the full potential of AI, creating a flexible, evolving representation of the data environment.\nThis approach, combined with Aktiver’s system design, delivers a decision support system with human-level reasoning that far exceeds traditional AI capabilities.\nAktiver provides an enhanced return on AI investments while ensuring the outputs are trusted, relevant, and actionable.\nThe Aktiver platform is designed to scale and adapt as new data is ingested and user modifications are made, enabling the system to handle complex, multi-source data without sacrificing accuracy or efficiency.\nAktiver’s system allows users to interact with the knowledge graph in real time, making corrections and additions, while AI/ML models analyze these inputs and provide suggestions for further updates.\nThese suggestions include inferring new relationships, highlighting conflicting information and identifying data gaps, reducing the manual and cognitive workload for analysts and users.\nIn addition to real-time interactivity, Aktiver integrates human-level reasoning into the AI/ML processes, enabling the system to uncover complex patterns and insights that traditional AI models often miss.\nThis ensures that the knowledge graph remains relevant and trusted by users, leading to faster and more accurate decision-making in strategic, tactical, and direct operations.\nBy combining the strengths of AI/ML, Resource Description Framework-Star (RDF*) flexibility, and human reasoning, Aktiver aims to deliver a system that adapts to evolving operational needs, enhances the speed and quality of analysis, and ensures that analysts and users have the tools to out pace our adversaries in the AI/ML Arms race.\n2.1 Identification and Significance of the Opportunity 2.1.1 Problem Many communities and organizations contain valuable insights and knowledge that remain confined within them, limiting their broader impact.\nThis isolated knowledge could drive innovation, improve problem-solving, and enhance operations across wider networks if made shareable and accessible.\nHowever, existing knowledge-sharing methods often rely heavily on domain experts and narrowly focus on specific data formats, making them costly and complex to maintain.\nFor complex, data-intensive 2",
        "10": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] environments such as intelligence, defense, healthcare, and finance, the demand for real-time, flexible knowledge graphs that adapt to evolving data inputs and user needs remains unmet.\n2.1.2 Technical Challenge Current knowledge graph systems often lack the flexibility, scalability, and user interactivity needed to handle constantly evolving data inputs and operational demands.\nThis rigidity limits their utility in environments where data insights must be accessible, actionable, and adaptive to deliver meaningful, timely results.\nMany traditional systems struggle to incorporate real-time data updates or respond to user- driven modifications in a way that guarantees accuracy, traceability, and ease of use.\nExisting systems also heavily depend on AI models that, while precise, don’t adapt well to dynamic or uncertain environments, placing a heavy cognitive load on analysts who are forced to work around system limitations rather than using it as a proactive, decision-making tool.\n2.1.3 Solution Aktiver’s approach introduces a data-driven, dynamic ontology model - a structured, adaptable knowledge system that can evolve in real time as new data emerges.\nBy creating a shareable “knowledge map” that adapts over time, the model supports critical decision-making in fast-paced, data-rich environments without relying solely on domain experts.\nThis model is designed to handle data complexity and adapt to operational shifts, providing a more interactive and user-friendly experience.\n2.1.4 How It Works The model operates through two main components: 1.\nBase Ontology Creation - In this phase, the system builds an initial structured knowledge model from community or organizational data, grouping key concepts (like “Threat” or “Resource”) into classes.\nIt then identifies relationships and attributes between these concepts, along with any rules or constraints.\nThis foundational ontology ensures data is well-organized and ready to support real-time decision-making.\n2.\nDynamic Ontology Propagation - As the community or organization updates its data, the ontology automatically adjusts.\nThis is achieved through delta scripting, which captures and propagates only the necessary changes rather than transmitting the entire data file, conserving resources.\nFor example, if attributes or relationships within a “Product” class change, only these updates are transmitted, not the entire ontology.\n2.1.5 Key Business Benefits 1.\nEnhanced Knowledge Sharing and Access - By unlocking valuable knowledge from within complex data, the model makes it accessible to broader teams or external partners, promoting standardized practices and improved decision-making, especially in intelligence, defense, healthcare, and finance.\n2.\nReduced Dependency on Experts - Using a data-driven approach instead of relying on domain experts to curate knowledge manually, the model saves time and reduces costs, enabling organizations to scale knowledge-sharing efforts across various fields.\n3.\nOperational Efficiency - The delta script method propagates only updates, saving both time and bandwidth—a critical feature in distributed and high-stakes environments where rapid access to current data is essential for timely decisions.\n4.\nAdaptability and Real-Time Knowledge Updates - The model’s propagation method ensures that the knowledge remains current and responsive, which is vital in sectors with rapidly evolving information, such as healthcare and defense, where outdated knowledge can have significant implications.\n3",
        "11": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] 2.1.6 Performance and Evaluation The system’s efficiency was validated by measuring how well it preserved knowledge completeness and accuracy.\nTesting demonstrated that this method maintained semantic accuracy and required fewer resources than traditional methods of rebuilding the ontology.\nThis efficiency positions the model as a cost-effective solution for complex organizations where speed and accuracy are paramount.\n2.2 Importance of the Solution Aktiver’s proposed solution will directly address these problems through our research and prototype development of a knowledge graph platform that is: • Dynamic and Adaptive - The platform will automatically evolve as new data emerges, allowing it to stay current with real-time information without the need for constant manual updates.\nThis dynamic adaptability supports high-stakes environments by ensuring that decision-makers always have access to the latest insights.\n• Scalable and Resource-Efficient - By utilizing a delta script approach to propagate only necessary changes, Aktiver’s platform minimizes bandwidth and processing requirements.\nThis scalability allows it to manage vast, complex data structures efficiently, making it cost-effective for large organizations.\n• User-Interactive and Intuitive - Unlike traditional systems, which can be rigid and non- interactive, our platform is designed with user-driven flexibility in mind.\nThis means analysts and decision-makers can make modifications in real time, receiving accurate, actionable feedback that enhances their workflows rather than hindering them.\n• Traceable and Transparent - The platform will ensure that all data modifications are logged and traceable, preserving the accuracy and integrity of knowledge over time.\nThis transparency is essential for sectors such as finance and defense, where accountability and auditability are critical.\n• Focused on Real-Time Decision Support - With a data-driven ontology at its core, the platform emphasizes delivering actionable, timely insights.\nIt’s built to be a proactive tool, empowering users to leverage it for rapid, informed decisions rather than merely as a data repository.\nThe importance of this approach lies in its ability to transform the way organizations utilize data.\nAktiver’s dynamic, adaptive knowledge graph enables faster, more informed decision-making in environments where timely, accurate insights can mean the difference between success and failure.\nBy addressing these technical problems, Aktiver’s solution stands to revolutionize data-driven operations across multiple sectors, fostering decision superiority and strategic advantage.\n3.0 Objective: The objective of this Small Business Innovation Research (SBIR) initiative is to present an operational research plan grounded in Aktiver’s robust technology framework and our team’s extensive expertise in knowledge graphs.\nThis Phase I effort focuses on exploring and developing advanced techniques that empower users to interact dynamically with knowledge graphs, allowing for real-time updates, seamless data integration, and iterative refinement of ontologies and connections.\nThis research will address critical challenges in the field, including building user trust in AI/ML-driven systems, enhancing knowledge graph adaptability, and ensuring a dynamic platform that can learn and update with SME Analysts input.\nAktiver’s approach is built upon our core product framework, which leverages lambda calculus, graph theory, and geometric spatial logical reasoners to create a system that is deterministic, explainable, interpretable, and traceable back to SMEs for validation.\nThis structure enables the system to “hesitate” and alert SMEs when there is insufficient information, leveraging principles of information gain and information entropy to ensure decisions are well-informed and reliable.\nBy prioritizing this robust, front- loaded decision-making process, Aktiver’s system applies non-deterministic AI models (stochastic processes) only when there is a high degree of certainty, with all decisions thoroughly validated and 4",
        "12": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] approved by SMEs.\nThis balanced approach to human-machine teaming automates tasks around validated decisions, optimizing both automation and human oversight.\n3.1 Specific Objectives of the Phase I Work 1.\nDevelop and Test User-Interactive Knowledge Models o Objective: Research and Build an initial knowledge models that support dynamic user interactions, allowing real-time modifications and updates to graph structure, nodes, and relationships.\nThis feature will enable users to intuitively adjust data and improve data accuracy, aligning the graph with changing operational contexts.\no Research Questions:  How effectively can users interact with and modify the knowledge model to improve data completeness and trust?\n What types of user modifications drive the most significant improvements in usability 2.\nEvaluate Predictive Updates Based on User Input and insight?\no Objective: Design algorithms that predict and suggest graph updates based on user actions, including inferred relationships, ontology alignment, and identifying data gaps, while ensuring that suggestions are accurate and valuable.\no Research Questions:  How accurately can the system predict necessary updates based on user input to support dynamic knowledge graph evolution?\n What mechanisms can enhance user confidence in these automated suggestions, reinforcing trust in the system’s adaptability?\n3.\nEstablish Baseline Performance Metrics o Objective: Define baseline performance metrics for knowledge graph effectiveness, including accuracy, completeness, and responsiveness to modifications, setting benchmarks for assessing Phase II improvements.\no Research Questions:  How does the knowledge graph’s accuracy and completeness improve following real- time user interactions and predictive updates?\n What metrics reveal areas needing enhancement to meet high-demand, time- 4.\nPrototype an Intuitive GUI for Enhanced User Interaction sensitive operational requirements?\no Objective: Develop a prototype graphical user interface (GUI) that enables users to interact with the knowledge graph without technical expertise.\nThis interface will support complex queries, real-time modifications, and data visualization to enhance user engagement and operational effectiveness.\no Research Questions:  How intuitive is the GUI for users, and what specific features improve user interaction, trust, and efficiency?\n To what extent does the GUI support effective human-machine teaming by facilitating 5.\nAssess Integration of Explainable AI for Decision Support decision-making in real time?\no Objective: Integrate explainable AI models within the knowledge graph framework, allowing the system to provide transparent, actionable insights.\nThis integration will support SME validation and enhance the graph’s decision-making capabilities.\no Research Questions:  How effectively do explainable AI models contribute to interpretability and user trust within the knowledge graph?\n5",
        "13": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001]  How does integrating explainable AI enhance decision-making outcomes and insight generation?\n6.\nDevelop Initial Prototype Design and Document Feasibility Study Results o Objective: Based on the results from testing and evaluations, develop an initial prototype design features and configurations.\nCompile comprehensive documentation of all work completed, including performance metrics, experimental results, and insights from the feasibility study.\nthe most promising incorporates that o Research Questions:  What are the key strengths and limitations identified in the Phase I prototype?\n What specific enhancements are required to ensure successful scaling and deployment in Phase II?\nBy addressing these objectives, the Phase I effort will establish a technical foundation to advance Aktiver’s knowledge graph solution, supporting a dynamic data model, knowledge model and graph environment, enhancing human-machine teaming in evolving operational situations.\nThe feasibility study, complete with documentation and an initial prototype design, will provide a clear pathway for Phase II, setting the stage for a robust, scalable solution that meets the mission-critical needs of end users.\n4.0 Technical Approach: This proposal outlines a technical approach for developing advanced techniques that enable users to interact dynamically with knowledge graphs built on open W3C standards, reducing cognitive load, reducing need for SMEs, while building user trust, and creating an adaptive system that evolves with SME input.\nOur approach leverages Aktiver’s technology framework and our team’s extensive experience in building large-scale, knowledge graph-based decision support systems for both the private sector and the Department of Defense (DoD).\nBased on our experience, there are three (3) primary reasons why knowledge graph-based systems often struggle to gain traction with end users or fail to deliver the promised insights and analytical advantages: 1.\nSystem Scalability a.\nRDF vs.\nLPG: Many knowledge graph systems grapple with scalability challenges, particularly when managing large and complex datasets across diverse domains.\nThe choice between Resource Description Framework (RDF) and Labelled Property Graph (LPG) models plays a crucial role in scalability.\nRDF’s triple-based structure is well-suited for semantic richness and interoperability across varied datasets, while LPG is often favored for direct property annotations and performance in transactional settings.\nHowever, as data volumes grow, it becomes clear that RDF, especially with RDF* (RDF Star), offers the flexibility needed to maintain scalability while retaining semantic depth.\n2.\nOntology OODA Loop: Complexity and Rigidity a.\nChallenges with Complexity and Rigidity: Ontology creation and management can be time- intensive and complex, requiring extensive resources to maintain alignment with real-world operational changes.\nWithout a system that can iterate and adapt through an Observe-Orient- Decide-Act (OODA) loop, knowledge graphs risk becoming static and rigid, limiting their applicability.\nb.\nFlexibility in Ontology Design: A dynamic knowledge graph requires ontologies that can evolve alongside the data and user input, calling for tools that allow automated ontology updates while still incorporating user-driven adjustments.\nWhen an ontology is too rigid or too complex, it can significantly delay the analysis process, leaving end users with outdated or incomplete insights.\n3.\nSystem Complexity a.\nQuery Complexity: Many graph-based systems require users to have expertise in complex query languages, such as SPARQL, GraphQL, AQL, or Cypher, to extract meaningful insights.\nThis complexity often discourages end users who lack specialized technical skills, reducing the system’s usability and adoption rates.\n6",
        "14": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] b.\nInability to Edit or Adapt the System: Another key challenge is the lack of user-editable functionality.\nIn many systems, users cannot modify the graph structure to reflect new insights or operational changes, which restricts the system’s relevance and adaptability over time.\nc.\nLimited System Learning and Adaptation: Effective knowledge graphs must be able to learn and adapt based on user interactions.\nWhen users make edits, whether to nodes, edges, or ontology mappings, the system should adjust to these inputs to improve its accuracy and relevance.\ni.\nOntology Mapping: The ability to update ontology mappings in response to new data or user feedback is essential for keeping the system current and reflective of operational realities.\nii.\nChanges to Edges or Nodes: User-driven changes to edges or nodes should feed into a continuous learning loop that refines the knowledge graph over time, improving data consistency and analytical output.\niii.\nFeedback Integration: Allowing user-driven feedback to dynamically influence the graph’s structure ensures that it remains responsive and adaptable to new information and operational shifts.\nTo create a dynamic knowledge graph-based system that end users can readily adapt and that delivers genuine analytical advantages, it is essential to address these three areas; 1) scalability, 2) flexible and simple ontology creation and management, and 3) system adaptability through an intuitive Graphic User Interface (GUI).\nBy focusing on these aspects, we can ensure that the knowledge graph is a powerful tool to achieve information dominance, decision advantage, and outpace our adversaries.\n1.\nSystem Scalability: Both RDF and LPG offer unique strengths.\nWhile Aktiver’s engineering team has extensive experience building Graph Digital Twins that combine RDF and LPG - an approach we may explore further in a follow-on white paper - this technical approach focuses on developing an adaptive, dynamic, and interactive knowledge graph system.\nTo achieve this, we have chosen to center our solution on Resource Description Framework-Star (RDF*) as the foundational technology.\nAktiver’s engineering team is well-versed in implementing RDF*-based systems, as RDF* is the core knowledge graph technology within our commercial product.\nRDF* not only provides a scalable graph model well-suited for managing large and diverse datasets but also supports dynamic updates as new data and user interactions evolve the graph.\nThis adaptability makes RDF* ideally suited to the Air Force's requirements for a dynamic, interactive knowledge graph system, ensuring the platform remains relevant and responsive in time-sensitive, data-intensive operational environments.\n2.\nFlexible and Streamlined Ontology Creation and Dynamic updates: Ontology development is essential for building an effective knowledge graph-based system.\nHowever, the process can quickly become unwieldy and time-intensive, often resulting in complex, rigid ontologies that struggle to adapt to new data, accommodate user-driven changes, or dynamically learn as problem sets evolve.\nConversely, loosely defined ontologies may streamline data ingestion but can lead to mismatched data types, like trying to fit a \"round peg\" into a \"square hole\", ultimately leaving users with more questions than answers.\nInstead of beginning with data, a common mistake in knowledge graph ontology development, Aktiver first focuses on specific requirements and desired outcomes to construct a logical data model.\nOur AI algorithms automate the curation and organization of incoming data, seamlessly classifying and tagging it to fit within this logical framework.\nThis approach not only enhances the relevance and precision of the data but also significantly improves process efficiency, enabling a dynamic system that learns and adapts as new data is introduced or as user inputs refine the model.\nThis creates a responsive human-machine team capable of dynamically updating to evolving inputs from users or new data.\nThis novel approach allows Aktiver to more effectively organize and interpret vast and varied datasets or rapidly adjust to user inputs at speed and scale.\nA knowledge model provides a structured framework to represent the complexities of physical reality, enabling both analysis and computation of the \"world out there.\" This model serves as a foundational system that organizes and processes intelligence information in a way that aligns with analysts’ 7",
        "15": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] cognitive processes while optimizing it for machine computation.\nBy structuring data through a knowledge model, we enhance interoperability across diverse systems and domains, effectively bridging disparate intelligence sources into a coherent, accessible format that supports decision- making.\nFigure 1 illustrates Aktiver’s unique approach in detail.\nThe decision-making system is grounded in lambda calculus, graph theory, and geometric spatial logical reasoners, providing a robust framework that is deterministic, explainable, interpretable, and traceable back to subject matter experts (SMEs) for validation.\nThis structure enables a system that can “hesitate” and alert the SME when there is insufficient information (leveraging principles of information gain and information entropy) to make a definitive decision.\nBy prioritizing decision-making processes up front, we ensure that non- deterministic AI models (stochastic processes) are only applied once there is a high degree of certainty, with decisions thoroughly validated and approved by the SME.\nThis structured approach to human-machine teaming automates tasks around approved decisions, optimizing the balance between automation and human oversight.\nFigure 1: Aktiver’s Knowledge Model Framework: Grounded in a deterministic decision-making framework, this structured, adaptive system combines lambda calculus, graph theory, and spatial logic to enhance human-machine teaming.\nEnabling explainable, SME-validated decision-making and balances automation with human oversight.\nThe knowledge model framework enables seamless linkage between detailed, domain-specific models, providing precise and contextually rich insights across intelligence applications.\nIt offers a scalable structure where both knowledge models and data models operate in tandem.\nThe knowledge model supports the system in the background, organizing and contextualizing data, while analysts and data collectors interact with an intuitive, user-friendly interface powered by explainable AI.\nThis symbiotic relationship ensures that users can engage meaningfully with the system, gaining valuable insights without needing to navigate its technical underpinnings directly.\nThrough this fusion of knowledge and data models, Aktiver’s approach enhances the user experience by offering a structured yet adaptable environment that aligns data with real-world logic.\nAnalysts and data collectors can make complex queries and uncover insights in a way that mirrors human 8",
        "16": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] reasoning, bridging cognitive processes with machine analysis.\nThis approach fundamentally transforms decision-making across a range of intelligence applications, enabling users to engage deeply with structured information while supporting effective, data-driven insights.\n3.\nSystem adaptability through an intuitive graphical user interface (GUI): Traditionally, Knowledge Graph GUIs have posed significant challenges for end users and analysts, often making it difficult to extract meaningful insights.\nThese interfaces typically lack user-friendly interaction capabilities, offering limited or no ability for users to modify, update, or interact with the underlying graph structure.\nAs a result, analysts are often constrained to passive data exploration, unable to adapt the knowledge graph to reflect new insights, evolving data, or changing operational needs.\nThis lack of interactivity restricts the potential of knowledge graphs, preventing them from becoming dynamic, evolving tools that can keep pace with complex analytical tasks and rapidly changing data environments.\nAlso, graph query languages, while powerful in delivering analytical insights, can be challenging for many users and analysts to learn and adopt.\nLanguages like SPARQL or Cypher require specialized training and familiarity with complex syntax, making it difficult for those without advanced technical expertise to effectively query the knowledge graph.\nThis reliance on specialized query skills limits accessibility and prevents knowledge graphs from becoming widely used and intuitive tools across various user groups.\nAn effective solution, therefore, must not only offer dynamic interaction and editable structures but also simplify querying and data retrieval to enhance usability and encourage widespread adoption among non-technical users.\nAktiver’s approach to creating a dynamic knowledge graph-based system centers on a highly adaptable GUI that fosters seamless interaction between end users and the underlying knowledge graph.\nThis user-centric design offers a video game-like experience built to support analysts and users with the ability to interact with complex, evolving datasets in a straightforward, efficient manner, without needing in-depth knowledge of the technical underpinnings of knowledge graphs or query languages.\nThrough this approach, Aktiver bridges the gap between human cognitive processes and machine-driven analysis, transforming data into actionable insights and reducing the cognitive load on users.\nAktiver’s approach is as follows: 1.\nDynamic Interaction with the Knowledge Graph via GUI: The GUI is designed to act as an intuitive gateway for accessing and interacting with the knowledge graph, allowing users to dynamically modify and interact with data nodes, relationships, and structures in real time.\nThis flexibility is crucial for: • Adapting to Real-Time Changes: As operational needs evolve, users can add, remove, or edit nodes and edges within the knowledge graph through the GUI.\nThis dynamic adaptability supports time-sensitive updates, such as emerging situational intelligence or real-time threat identification, without requiring backend reconfiguration.\n• Enhanced Data Visualization: The GUI will enable users to visualize data in a way that aligns with real-world scenarios, aiding in pattern recognition, relationship mapping, and anomaly detection.\nCustomizable views allow users to explore the data at different levels of granularity, from high-level summaries to detailed, node-specific information.\n2.\nGUI-Driven Query Simplification: Traditionally, knowledge graphs rely on complex query languages, which can create a barrier for users unfamiliar with technical languages.\nAktiver’s approach mitigates this issue by offering generative AI (GenAI) natural language query support and guided search options within the GUI, allowing users to perform complex searches and retrieve complex data connections without needing advanced technical skills.\nKey features include: 9",
        "17": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] • Natural Language Queries: Through GenAI integration, the GUI allows users to make queries through in plain conversational, intuitive queries that match operational workflows.\nlanguage.\nThis capability empowers analysts to obtain insights • Explainable AI: The GUI leverages explainable AI models to provide context behind query results and suggest additional insights.\nAs a result, users understand not only what the data represents but also the rationale behind the AI’s interpretations, boosting confidence in the system’s outputs.\n3.\nAdaptability through Feedback-Driven Learning and User Modifications: Aktiver’s GUI supports feedback-driven learning by capturing and integrating user interactions, such as edits and annotations, directly into the knowledge graph or knowledge model.\nThis capability allows the system to evolve based on real-world feedback, ensuring continuous relevance and accuracy.\nSpecific features supporting this adaptability include: • Ontology and Schema Updates: When users modify or annotate data, the system adapts by updating its ontology and schema to reflect these changes, maintaining logical coherence within the knowledge graph.\nThis ensures that new insights are immediately integrated, creating a responsive knowledge graph that evolves alongside operational requirements.\n• Automated Suggestions for Graph Enhancement: The GUI provides AI-driven suggestions for graph improvements, such as inferred relationships or data gap identification.\nUsers can accept or reject these suggestions, refining the graph’s accuracy over time and enhancing the system’s analytical value.\n4.\nScalable, Interoperable Design for Multi-Source Data Integration: The GUI is designed to support seamless integration of structured, semi-structured, and unstructured data sources within the knowledge graph, ensuring that users can access a unified view of diverse data without compromising on clarity or performance.\nThis scalability is crucial for high-demand environments such as military intelligence, where data sources are varied and rapidly evolving.\nCore design features include: • Data Source Agnosticism: The GUI can integrate data from multiple sources, enabling users to ingest and organize information from different platforms or repositories.\nThis design ensures interoperability across systems, allowing for a coherent, centralized knowledge graph.\n• Customizable Data Views: Users can configure how data is displayed within the GUI to highlight specific entities, relationships, or patterns relevant to their mission objectives.\nThis adaptability reduces cognitive load and helps users focus on actionable insights tailored to their needs.\n5.\nCollaborative Environment with Role-Based Access: To foster collaborative analysis and ensure data security, Aktiver’s GUI includes role-based access controls that manage user permissions based on their operational needs and security clearances.\nThis role-based environment enhances the adaptability and usability of the knowledge graph by: • Supporting Concurrent User Access: Multiple users can interact with the knowledge graph simultaneously, with real-time updates visible across sessions, facilitating collaborative analysis.\n• Controlled Data Access: Users with different roles can view, edit, or annotate data at varying levels of granularity, ensuring that sensitive data is protected while enabling effective teamwork.\n6.\nEnhanced Analytical Advantage through Responsive, Human-Centric Design: Aktiver’s adaptable GUI design allows the knowledge graph to meet end users’ analytical needs by minimizing technical barriers and creating a human-centric interaction model.\nThis model amplifies the analytical advantage through: • Immediate Insight Generation: Users can perform complex analyses and gain insights without technical delays, enhancing their ability to respond to evolving situations.\n10",
        "18": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] • Tailored Alerts and Notifications: The GUI can be configured to alert users of critical changes or patterns, such as the emergence of a new relationship between entities or identified data gaps, improving situational awareness in high-stakes scenarios.\nAktiver’s system adaptability through an intuitive GUI delivers a dynamic knowledge graph-based solution that end users can readily adopt, allowing them to adapt to evolving operational needs and gain genuine analytical advantages.\nBy integrating real-time interaction capabilities, simplified query options, explainable AI, and customizable views, Aktiver empowers analysts and decision-makers to interact directly with complex data landscapes.\nThis approach not only reduces the learning curve for non-technical users but also ensures that the system remains responsive and relevant, enabling informed, timely decisions that drive mission success.\nIn summary, by focusing on the three (3) core pillars outlined above, Aktiver’s Knowledge Graph Decision Support Framework ensures that the system can scale to handle diverse, complex data sources across domains, flexible, efficient ontology management.\nThis approach streamlines the creation and adaptation of ontologies, allowing rapid updates that reflect evolving data and operational needs without overwhelming users.\nintegrate seamlessly with existing workflows, and enable A key component of Aktiver’s approach is our Deterministic Decision-Making System for Explainable AI: A Pre-AI Validation Approach.\nThis structured methodology prioritizes decision-making processes, enabling the system to “pause” and notify Subject Matter Experts (SMEs) when information is insufficient, based on principles of information gain and entropy.\nBy validating data and insights with SMEs before applying non- deterministic AI models, we ensure high accuracy and trustworthiness.\nThe intuitive GUI allows users to interact dynamically with the knowledge graph, providing a user-friendly experience that simplifies complex queries and adapts to user input.\nFigure 2 further illustrates this approach, highlighting how Aktiver’s framework integrates these three essential elements - scalability, ontology flexibility, and adaptability - to deliver a responsive, user- centered knowledge graph system.\nThe figure demonstrates how each component contributes to a streamlined, scalable solution that empowers users to leverage AI-driven insights confidently and efficiently across critical decision-making scenarios.\nThis holistic approach establishes Aktiver’s knowledge graph system as a robust, adaptable tool for enhancing decision-making across a range of applications.\nFigure 2: Aktiver’s Knowledge Graph Decision Support Framework: A scalable, adaptable system that integrates diverse data sources, enables flexible ontology management, and supports rapid updates to meet evolving operational needs.\n11",
        "19": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] 4.1 Aktiver’s use of Namespaces and Embedded Mappings Support Dynamic Knowledge Graphs A key advantage of our approach is the implementation of namespaces and embedded mappings, which facilitate the creation and management of dynamic knowledge graphs.\nThis design enables flexible data integration, schema evolution, and real-time reasoning, making it ideal for organizations requiring systems that can dynamically update, whether from new data inputs or user-driven updates, edits, or modifications.\nBy incorporating namespaces and mappings, Aktiver’s approach ensures that the system remains adaptable, scalable, and responsive to the evolving data landscape.\n1.\nAktiver’s Namespaces: Facilitating Scalability and Interoperability Aktiver’s implementation of namespaces serves to uniquely identify resources and relationships across different datasets.\nBy using unique URIs (Uniform Resource Identifiers) for entities and predicates, namespaces allow Aktiver’s graph to scale and integrate data from diverse sources seamlessly.\nThis capability is essential for dynamic knowledge graphs, which must evolve and expand as new data is ingested from various, often disparate, datasets.\na.\nInteroperability Across Datasets • Our use of namespaces enables different datasets to be integrated without conflicts.\nFor example, if multiple datasets use the term “location,” each can be referenced by its unique namespace (e.g., geo:location, schema:location, or dc:spatial).\nThis ensures that the meaning of each entity or relationship remains clear, avoiding ambiguity when different ontologies or vocabularies are used in the same knowledge graph.\n• Aktiver’s namespaces promote interoperability between data sources, facilitating seamless data fusion.\nAs a result, analysts can pull in new datasets and immediately map them to existing knowledge graphs, enabling real-time expansion and updates.\nb.\nScalability of Dynamic Graphs • In dynamic environments, new data may frequently be added to the knowledge graph.\nOur namespace implementation supports this scalability by allowing the graph to grow without requiring significant reconfiguration.\nUnique URIs associated with each namespace ensure that entities and relationships remain distinct, even as the graph expands or is updated with user defined changes.\n• Aktiver’s namespaces allows for distributed data management.\nDifferent parts of the knowledge graph can be maintained by different teams or systems, each using their own namespaces.\nThis enables a federated approach to knowledge management, where different organizations or departments can contribute data to the same graph without risking conflicts or overlaps.\n2.\nAktiver’s Embedded Mappings: Supporting Schema Evolution and Ontology Updates Embedded mappings allow the dynamic reconfiguration of the graph as new data is added or user-driven changes are made.\nThese mappings are critical for maintaining the structure of the knowledge graph as it evolves and for enabling advanced reasoning and inference capabilities.\nflexible relationships between entities, enabling for a.\nDynamic Ontology and Schema Evolution • Traditional RDF based graphs are often associated with formal ontologies, which define the classes, properties, and relationships within the graph.\nHowever, in dynamic environments, the ontology or schema may need to evolve as new types of data are introduced or as users and SMEs make changes.\nAktiver’s embedded mappings allow RDF graphs to adapt in real time by updating relationships between nodes, making the graph schema-flexible.\n• As new data is added to the graph, our system automatically generates new mappings that fit within the existing ontology.\nFor example, if a new type of entity (e.g., a specific kind of sensor or intelligence source) is introduced, the graph can dynamically map these new 12",
        "20": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] entities to existing categories or relationships, extending the graph’s schema without requiring manual reconfiguration.\n• Aktiver’s embedded mappings framework also enables cross-domain ontology integration, allowing the graph to link different ontologies through mappings between terms in each ontology.\nThis approach provides a richer representation of knowledge by combining concepts from multiple domains, resulting in a more comprehensive understanding of the data and its contextual relationships.\nb.\nInference and Reasoning • Aktiver’s embedded mappings enhance our graph’s ability to infer new relationships.\nAs user inputs or AI algorithms modify the graph, the system applies inference rules to suggest additional connections between entities based on the mappings.\nFor instance, if a user adds the system can automatically infer additional a new relationship between two entities, connections based on similar patterns elsewhere in the graph.\n• Aktiver’s embedded mappings allow for SPARQL queries (the RDF* query language) to return inferred data in addition to explicitly stored data.\nThis real-time reasoning enables analysts to uncover hidden patterns and connections in the graph, supporting faster decision- making in dynamic environments.\nc.\nMaintaining Data Integrity in Dynamic Graphs • In a dynamic knowledge graph, data is constantly being added, modified, or removed.\nAktiver’s embedded mappings ensure that as these changes occur, while the underlying integrity of the graph is maintained.\nMappings enforce constraints and consistency checks, ensuring that newly added data conforms to the graph’s schema and ontology, even as these evolve.\n• Aktiver’s mappings approach also helps highlight conflicting information in the graph.\nFor example, if two different datasets suggest contradictory relationships between the same entities, the system uses these mappings to identify and flag these inconsistencies, allowing the user to resolve them.\n3.\nSupporting User Interaction in Dynamic Knowledge Graphs One of the primary goals of dynamic knowledge graphs is to allow users to interact with the graph by making changes, adding data, and updating relationships.\nAktiver’s namespaces and embedded mappings framework directly support this goal by enabling: a.\nUser-Driven Modifications • When a user makes changes to the graph (e.g., adding a new entity or updating a relationship), the system can automatically map these modifications to the correct namespace, ensuring that the graph remains consistent and scalable.\n• Embedded mappings allow user-driven modifications to trigger real-time schema updates.\nFor instance, if a user introduces a new type of relationship, the system can dynamically update the graph’s ontology to accommodate this change, maintaining the graph’s relevance to the operational context.\nb.\nSuggesting Additional Changes 1.\nAs users modify the graph, embedded mappings enable the system to suggest additional updates.\nFor example, if a user adds a new node or edge, the system can use existing mappings to infer related changes in the graph.\nThese suggestions help users identify missing links or new insights that might not be immediately obvious.\n2.\nEmbedded mappings also allow the system to suggest updates to the underlying ontology based on user input.\nIf a new data type or entity class is introduced, the system can propose updates to the ontology that integrate this new information seamlessly into the existing schema.\n13",
        "21": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] c.\nHighlighting Conflicts and Gaps • Aktiver’s Graph structure, combined with embedded mappings, allows the system to identify and highlight conflicting information.\nIf a user adds data that conflicts with existing relationships or entities, the system uses embedded mappings to pinpoint the conflict and propose resolutions.\n• Similarly, mappings can help the system identify information gaps in the graph.\nBy analyzing patterns in the data, our system can suggest missing nodes or edges, helping the user complete the picture and ensure that the graph reflects the full scope of the available information.\n4.\nReal-Time Knowledge Graph Expansion Dynamic knowledge graphs are only useful if they can evolve as new data is ingested.\nAktiver’s namespaces and embedded mappings framework is key to enabling this real-time expansion.\n• As new datasets are added to the system, namespaces ensure that the new entities and relationships are integrated without conflict.\nMappings allow the system to automatically link these new entities to existing nodes in the graph, ensuring that the graph continues to grow without losing coherence.\n• Aktiver’s Human Level reasoning is supported through these mappings, enabling the system to update and suggest additional connections as the graph expands.\nThis capability is critical for applications like situational awareness, where new intelligence data must be integrated and acted upon in near real-time.\n4.2 Application Example An example of how Aktiver’s framework will dynamically adapt to new data inputs and user-defined updates, applying human-level reasoning to provide near-real-time (NRT) critical information connections, is outlined below.\nIn this notional scenario, we examine an F-16CJ aircraft assigned to the 13th Fighter Squadron at Misawa Air Base in Japan, which has been forward deployed to AirBase01 as part of Military Exercise 01ZYX321.\nThe squadron's mission includes executing air superiority missions with both offensive and defensive counter-air capabilities and the Suppression of Enemy Air Defenses (SEAD).\nIn Figure 3 below, we start with the reference knowledge model, the Military Equipment Ontology (MEO), which contains the parametric data common to all instances of an equipment item class.\nThe MEO was developed by the MEPED program office in collaboration with Intelligence Production Centers responsible for producing Scientific and Technical (S&T) intelligence on adversary weapons.\nFigure 3: Starting with the MEO Reference Knowledge Model Figure 4 includes user-defined input from the Integrated Intelligence Center (IIC), which determines the assignment of specific aircraft to operational units and defines their roles.\nThe IIC, along with other production centers, also identifies the location and function of installations and facilities within their Area of Responsibility (AOR).\nHowever, there remains an intelligence gap around the “Event Object”, in this case, the military exercise itself.\n14",
        "22": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] Figure 4: New Data Enters the System As new data enters the system about the event, Aktiver rapidly infers the remaining connections to address intelligence gaps and provide a complete picture.\nThe newly inferred connections are highlighted in Figure 5 by the dashed circles.\nThese connections can be quickly validated, updated, or adjusted based on SME input.\nThe strength of Aktiver’s approach lies in the system’s ability to learn from both inferred connections and SME inputs, dynamically updating the entire graph structure.\nThis process offers insights into additional key intelligence connections that analysts may not have previously identified, significantly enhancing the speed and accuracy of decision-making while reducing the cognitive load on analysts and users.\nFigure 5: Aktiver’s Dynamic Knowledge Graph Response: As new data enters the system, Aktiver rapidly infers connections to close intelligence gaps, highlighted by dashed circles.\nThese inferred connections can be validated or adjusted with SME input, allowing the system to learn dynamically.\n4.3 Aktiver’s Ontology Validation and Re-Validation Approach Aktiver’s advanced design and knowledge model framework integrates seamlessly with ontology-building tools like Protégé, supporting users in the rapid development, testing, and validation of ontologies.\nThis approach provides a robust environment for creating, managing, and evaluating ontologies, enabling quick iteration and refinement to ensure that the knowledge graph accurately reflects real-world operational needs.\nBelow is a discussion on how Aktiver’s ontology development workflow facilitates the rapid testing and validation of ontologies, ensuring both accuracy and relevance for mission-critical applications in dynamic data-intensive environments.\n15",
        "23": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] 1.\nSeamless Integration with Ontology-Building Tools Aktiver’s framework is designed to work directly with industry-standard ontology tools, allowing users to leverage these tools to rapidly establish features for ontology design and modification.\nThis integration enables users to: • Create and Modify Ontologies: Users can easily design complex ontologies with class hierarchies, object properties, and data properties, all of which are essential for representing real- world entities and their relationships.\n• Maintain Compatibility with OWL Standards: Support for Web Ontology Language (OWL) standards ensures that ontologies created within Aktiver are interoperable across systems, which is critical for applications requiring data exchange and shared intelligence.\n• Enable Iterative Testing and Validation: Users can rapidly prototype, test, and adjust ontologies, ensuring they align with the mission objectives and evolving data requirements.\n2.\nRapid Development and Real-Time Testing Aktiver’s framework provides a streamlined environment where users can efficiently develop ontologies and perform real-time testing to assess accuracy and relevance.\nThis iterative workflow ensures that ontologies remain aligned with mission-critical demands, adapting to new data and user-defined inputs.\nThe process includes: • Ontology Testing Against Live Data: By using actual data streams, Aktiver allows users to test ontologies in real-time, identifying areas where adjustments are needed to improve alignment with operational data.\nThis live-testing approach supports early detection of gaps or inconsistencies within the ontology structure.\n• Immediate Validation and Refinement: Following each test cycle, users can validate the ontology’s structure and relationships directly within the Ontology tool environment, leveraging built-in reasoning tools to check logical consistency and accuracy.\nThis rapid feedback loop helps ensure that ontologies are validated quickly and accurately.\n3.\nOntology Testing with SME Feedback Aktiver’s user-friendly interface makes it accessible not only for developers but also to SMEs, allowing them to provide input during the ontology-building process.\nThis is especially valuable when testing and refining ontologies to ensure they align with dynamic real-world operational needs.\n• SMEs can interact with the ontology, review its structure, and provide feedback on the relationships and classes defined.\nAktiver enables quick updates based on SME input, allowing rapid iterations and refinements.\n• The ability to annotate classes, properties, and relationships within Aktiver also allows SMEs to leave comments or suggestions, streamlining communication between developers and domain experts.\n4.\nScenario-Based Testing and Simulation Aktiver supports scenario-based testing of the ontology, allowing developers to simulate different operational scenarios and assess how the knowledge graph responds.\nThis process is valuable for: • Validating ontology behavior: Developers can simulate data inputs and observe how the ontology reacts to new entities or relationships, ensuring that the logical structure supports dynamic changes.\n• Testing scalability: Aktiver’s reasoning capabilities allow users to test how the ontology behaves as new data is introduced, ensuring that the system can scale to handle the complexity and size of real-world datasets.\n5.\nOntology Modularization and Reuse Aktiver allows for the modularization of ontologies, enabling developers to break down complex ontologies into manageable components.\nThis modular approach allows for: 16",
        "24": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] • Faster validation cycles: Individual modules can be tested and validated separately before being integrated into the larger knowledge graph.\nThis reduces the complexity of testing and accelerates the development process.\n• Reusability: Once validated, ontology modules can be reused in different contexts or applications, speeding up the development of new knowledge graphs.\nAktiver facilitates the reuse of existing ontologies, ensuring that previously validated components can be quickly integrated into new projects.\n6.\nCollaborative Development and Versioning Aktiver supports collaborative development through version control plugins, allowing multiple users to work on an ontology simultaneously.\nThis is particularly useful for large-scale projects where teams of developers and SMEs may need to work together to refine the ontology.\n• Version control ensures that changes can be tracked and rolled back if necessary, reducing the risk of errors or inconsistencies being introduced during the development process.\n• Collaboration tools allow for distributed ontology development, ensuring that teams can contribute to the project remotely while maintaining a unified version of the ontology.\n7.\nExporting and Integrating with Aktiver’s RDF* Knowledge Graphs Once the ontology is validated, it can be exported in various formats, including OWL and RDF* Schema.\nThis allows for seamless integration with Aktiver’s RDF* based knowledge graphs.\nBy using ontology tools to test and refine the ontology, the Aktiver team or US Government (USG) end users can ensure that the resulting graph is both logically consistent and operationally relevant.\n• The ability to export ontologies directly into Aktiver means that the validated ontology can immediately be used in the broader system reducing the time required to implement changes and ensures that the knowledge graph remains flexible and adaptive.\n• Integration with Aktiver’s RDF* graph store enables real-time updates and reasoning based on the ontology, ensuring that the system remains agile and responsive to new data inputs.\n4.4 Aktiver’s GUI Approach to Support Dynamic User Updates and Changes Traditionally, GUIs for knowledge graph systems have lacked the intuitiveness needed to support effective analytics, especially as the complexity of the graph increases.\nThese interfaces often become cumbersome and less navigable as more entities, relationships, and data layers are added, creating a barrier for users who require rapid, accurate, and actionable responses from the system.\nMoreover, such GUIs typically offer limited or no mechanisms for users or SMEs to update or modify the underlying graph structure, including its ontology, schema, or individual edges and nodes.\nThis lack of interactivity restricts users’ ability to adapt the knowledge graph to evolving data or operational requirements, preventing the system from truly reflecting real-world scenarios.\nFor knowledge graphs to fully support dynamic analytical processes, an intuitive, adaptable GUI that facilitates real-time updates and user-driven modifications is essential.\nAktiver has previously explored GUI development using modern applications like React.js.\nHowever, due to React’s limited capabilities in handling the complex, data-rich interfaces required for dynamic knowledge graph interactions, Aktiver has sought alternative approaches better suited to highly interactive and scalable UIs.\nWhile React offers flexibility for standard application development, it can be less effective in managing real-time data updates and the intensive visualization demands of knowledge graphs, especially as graph complexity grows.\nIn addition to its limitations with high-complexity data, React presents security implications when used in applications requiring role-based access control (RBAC).\nReact’s single-page application model can make it challenging to enforce strict access controls, especially for sensitive data scenarios where permissions must be managed at a granular level, including specific nodes and edges within a knowledge graph.\nWhile RBAC can be implemented within React, it often requires complex custom configurations to ensure that each user’s access level aligns precisely with their role, especially as permissions change dynamically.\n17",
        "25": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] As a result, Aktiver’s current development strategy prioritizes frameworks and tools that not only support adaptive, data-driven interfaces but also enhance security by providing robust, built-in mechanisms for RBAC and data access management.\nThis approach allows Aktiver to offer a more secure, intuitive user experience tailored to the needs of analysts and operational users while ensuring compliance with stringent data access policies.\nFor this prototype effort, Aktiver will utilize frameworks like VueJS as the preferred choice for GUI development due to its speed, lightweight architecture, and minimal footprint, all of which enhance application performance and scalability.\nUnlike heavier frameworks, VueJS enables faster loading times and greater responsiveness, essential for managing dynamic, data-rich interactions within a knowledge graph system.\nIts modular structure also simplifies the development process, allowing Aktiver to create an intuitive, adaptable user interface without burdening the system with unnecessary components.\nA key advantage of VueJS is its separation of concerns, where essential security measures and sensitive operations are isolated in the backend.\nThis setup minimizes any security vulnerabilities within the frontend itself, ensuring that the interface remains lightweight and secure.\nFor user authentication and access control, Aktiver uses Keycloak as a dedicated backend solution for RBAC, user authentication, and permissions management.\nBy centralizing these critical security features in Keycloak, Aktiver can ensure that data access and permissions are strictly managed without compromising the frontend’s performance or flexibility.\nFigure 6, showcases Aktiver's preliminary GUI development efforts, illustrating the foundational design and functionality that support dynamic interaction with the knowledge graph.\nThese early GUI prototypes emphasize a user-friendly, responsive interface tailored for seamless data exploration, rapid validation, and real-time updates.\nBy prioritizing intuitive design, Aktiver’s GUI aims to reduce cognitive load, enabling analysts to interact effortlessly with complex data relationships, validate inferred connections, and make rapid, informed decisions within the knowledge graph environment.\nFigure 6: Aktiver’s Preliminary GUI Development: An intuitive, responsive interface designed for dynamic interaction with the knowledge graph.\n4.5 Other Advanced Approaches In addition to the robust technical approach outlined in the sections above, the Aktiver engineering team is actively exploring advanced graph techniques to further enhance a dynamic, deterministic decision- 18",
        "26": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] making knowledge graph system.\nRooted in logical reasoning and topological methods, these advanced approaches aim to provide a high-level, adaptable framework for accurate data labeling and dynamic knowledge graph construction.\nThese emerging technical approaches will be further explored under this SBIR effort and are further outlined below: 1.\nConstructing High-Level Hyper-Graph Frameworks with Topo Theory: Using sheaves and presheaves, this approach organizes knowledge into a hyper-graph that captures both stable and evolving relationships across complex domains.\nSheaves represent consistent, cohesive knowledge that can be shared across different parts of the graph, while presheaves allow for dynamic adjustments based on context or gaps in information.\nThis enables the graph to adapt and reorganize based on SME input and new data insights, maintaining structural coherence while accommodating flexible, evolving knowledge.\n2.\nDriving Continuous, Adaptive Learning: Through mechanisms like information entropy, the system identifies areas within the graph where data is uncertain or incomplete.\nThis feature supports a dynamic, learning-driven model where entities and their relationships can adapt based on new information.\nSMEs can influence these adjustments, ensuring the graph's relevance and reliability are continually refined.\n3.\nAchieving Scalable Semantic Consistency: By blending deterministic reasoning with high-level topological structures, for semantic this system creates a robust, scalable representation.\nAs SMEs provide guidance and new data is integrated, the knowledge graph autonomously recalibrates, making it capable of self-sustaining adaptation.\nThis continuous validation enriches the knowledge graph, creating an enduring, contextually accurate structure that scales with the system’s needs.\nframework 4.\nEmpowering Expert-Driven Adaptation: SMEs play an active role in guiding connections and relationships within the knowledge graph.\nBy defining and adjusting key concepts and terms in the system's thesauri, SMEs can seamlessly reshape relationships and hierarchies in the knowledge graph.\nThis flexibility ensures the graph remains aligned with domain knowledge and evolving context, with automated adjustments that reflect these SME-driven updates.\n4.6 Statement of Work (SOW) Tasks, Timeline and Schedule The following Statement of Work (SOW) outlines the key tasks, methods, and timelines for the Phase I research effort under this SBIR project.\nEach task is designed to address critical objectives that support the development and validation of Aktiver’s dynamic, user-interactive knowledge graph system.\nThe SOW provides a step-by-step approach to explore the feasibility of an adaptive knowledge graph platform that allows real-time data updates, predictive modifications, and user-driven interactions.\nThe work will leverage Aktiver’s robust technology framework, expertise in knowledge graphs, and advanced methodologies to create a prototype that meets DoD requirements for responsiveness, accuracy, and operational adaptability.\nEach task description includes specific deliverables and a schedule to ensure a structured approach, facilitating comprehensive analysis and informed recommendations for Phase II.\nTable 1 presents a detailed overview of each task and its corresponding timeline, providing a structured roadmap for completing the Phase I effort.\nThis table highlights the methods, performance location of work, schedule of major milestones, and anticipated deliverables for each task, ensuring a clear pathway for meeting project objectives and assessing the system’s feasibility for Phase II expansion.\nTable 1: Aktiver's SBIR Phase 1 Tasks, Timeline, Schedule, and Deliverables.\nTask Description Methods Performance Location Schedule Deliverables Task 1: Develop and Test User-Interactive Knowledge Graph Models Design and develop knowledge graph models that support dynamic user interactions, allowing real-time modifications and updates to the graph structure, nodes, and relationships.\nDevelop foundational knowledge graph schema using RDF-Star, integrate domain-relevant ontologies, conduct user testing for interaction quality.\nAktiver’s secure cloud environment Months 1-2 Initial knowledge model, data model, user testing results and feedback 19",
        "27": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] Task Description Methods Performance Location Schedule Deliverables Task 2: Evaluate Predictive Updating of Graph Structure Based on User Input Task 3: Establish Baseline Performance Metrics Task 4: Prototype an Intuitive GUI for Enhanced User Interaction Task 5: Assess Integration of Explainable AI for Decision Support Task 6: Develop Initial Prototype Design and Document Feasibility Study Results Create algorithms to predict and suggest graph modifications based on user interactions, such as inferred relationships and identifying data gaps.\nDefine baseline metrics (accuracy, completeness, response time) for knowledge graph effectiveness to guide Phase II improvements.\nDevelop a prototype GUI to enable intuitive user interaction with the knowledge graph, supporting query, update, and visualization.\nIntegrate explainable AI models within the knowledge graph to support decision-making with transparent insights.\nRefine prototype design based on results, document all findings, metrics, and recommendations for Phase II.\nImplement machine learning models to infer logical connections, use information gain and entropy-based algorithms for recommendations, analyze logs and user feedback for accuracy.\nMeasure initial metrics during user interaction, analyze accuracy and completeness before and after updates.\nAktiver’s cloud environment and physical machines Months 2-3 Aktiver’s internal systems Months 2-4 Build interface, conduct user testing, gather feedback to improve ease of use and interaction.\nAktiver’s development environment Months 3-5 Implement explainable AI models to provide recommendations, test user trust and confidence through feedback and analysis.\nAktiver’s cloud and internal systems Months 4-6 Consolidate results, develop a roadmap and design recommendations, document feasibility study results.\nAktiver’s documentation and development environments Months 5-6 Predictive updating feature with intelligent suggestions, performance analysis report Performance metrics report with baseline measurements, summary of areas needing improvement Prototype GUI with interactive functionality, user feedback report with proposed improvements Explainable AI functionality, report on AI performance and user trust Final prototype design, feasibility study document with Phase II recommendations Figure 7 illustrates our notional example of our Agile Development approach, where we start with a foundational product – such as a \"skateboard\" - and enhance it incrementally through each sprint based on user feedback and evolving requirements.\nThis phased approach allows us to progress through stages, from a scooter to a bike, then a motorcycle, and ultimately, a fully functional car.\nBy following this model, we can continuously deliver tangible value with each iteration, adapting the solution to better meet user needs while accelerating time-to-value.\nThis approach is particularly valuable for our SBIR project, where real-time adaptability and user-centered design are essential.\nThrough each phase of development, we’ll integrate feedback from early adopters and DoD stakeholders, refining features like user interactivity, dynamic data integration, and predictive updates.\nThis iterative process not only ensures alignment with DoD’s evolving requirements but also allows us to validate and optimize key functionalities in real-time, establishing a solid foundation for an adaptable, scalable solution.\nBy the final iteration, we aim to deliver a robust, fully-featured system that seamlessly supports operational decision-making within complex, time-sensitive environments.\nFigure 7: Aktiver's Agile Development Approach 20",
        "28": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] 4.7 Assessment of Likelihood of Success Table 2 highlights the factors that contribute to the high likelihood of success for Aktiver’s approach in developing an adaptive, interactive knowledge graph system.\nBy leveraging a well-defined framework grounded in semantic graph theory, lambda calculus, and explainable AI, Aktiver’s approach is uniquely positioned to meet and exceed the technical requirements of this SBIR Phase I effort.\nThe table outlines the key elements, such as advanced user interactivity, predictive update capabilities, and real-time decision support, that drive the effectiveness of this solution.\nEach factor is assessed for its impact on project outcomes, providing a clear indication of how Aktiver’s methodology will support the objectives of Phase I and lay a strong foundation for Phase II.\nWith a rigorous focus on adaptability, user trust, and machine learning integration, Aktiver’s approach is positioned to deliver a robust and reliable knowledge graph system that meets DoD’s high standards for operational performance.\nTable 2: Aktiver's Approach and Assessment of Likelihood of Success to meet the goals of this SBIR Aktiver’s Approach Advantage Description Desired Effect to the Project Likelihood of Meeting Project Goals Enhanced Expressiveness Embedded Mapping Proven Standards and Tools Automated Ontology and Schema Updates Improved Data Modeling Enhanced Data Governance Scalability Standardization Continuity Efficiency and Simplicity Dynamic User Interaction Flexibility and Interoperability AI-Enhanced Graph Modification Enables statements about other statements, allowing metadata (e.g., provenance, temporal information) to be directly added to relationships.\nAllows triples to act as subjects or objects within other triples, simplifying complex relationship representation.\nEnhances metadata management and traceability Supports advanced data representation Tool Ecosystem: mature ecosystem of tools enables rapid development and integration, allowing focus on AI/ML interactivity without reinventing core graph functionalities.\nSchema Evolution: Combined with ontologies, supports schema updates triggered by user modifications, enabling the knowledge graph to adapt to new data and operational demands.\nMetadata on Relationships: Allows metadata to be added directly to relationships (e.g., event dates, roles), simplifying what previously required reification.\nProvenance Information: Enables provenance information within the graph, improving data governance and trust by tracking data origin and history.\nDistributed Scalability: Graph databases scale effectively across distributed systems, maintaining performance and enabling real-time updates with large, diverse datasets.\nCompatibility with Existing Standards: Maintains compatibility with Semantic Web standards (e.g., SPARQL), allowing for integration with existing RDF infrastructures.\nSimplified Representation: By reducing the need for reification, Aktiver’s approach streamlines data representation, making it more readable and reducing document size.\nUser Interaction with the Graph: Enables user-friendly modification of data and structures, dynamically updating nodes and edges based on input, reducing manual corrections.\nRDF Triple-Based Model: Supports complex relationships and data types from diverse sources, making it ideal for integrating varied datasets and adapting to operational needs.\nAI/ML Integration: AI/ML algorithms applied to learn from user interactions, suggesting modifications and inferring new relationships, filling data gaps or inconsistencies.\nSpeeds up deployment and reduces development overhead Crucial for evolving knowledge graphs Reduces complexity in graph modeling Essential for data governance and traceability Necessary for handling large and evolving data loads Ensures seamless adoption into existing systems Increases model clarity and reduces resource usage Essential for real- time updates and operational efficiency Supports seamless data integration Automates updates and enhances graph accuracy High High High High High High High High High High High High 21",
        "29": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] Aktiver’s Approach Advantage Description Desired Effect to the Project Likelihood of Meeting Project Goals Automated Ontology and Schema Updates Time-Constrained Situational Awareness 4.8 Aktiver’s Related Work Schema Evolution: Combined with ontologies, supports schema updates triggered by user modifications, enabling the knowledge graph to adapt to new data and operational demands.\nReal-Time Decision Support: Aktiver’s model development, combined with AI-driven suggestions, reduces cognitive load by supporting rapid, real-time updates, enhancing decision-making under pressure.\nCrucial for evolving knowledge graphs Vital for fast-paced threat detection and response High High Aktiver’s Principal Investigator (PI) and Lead Engineer (LE) for this SBIR effort bring a wealth of expertise that is directly relevant to the project’s objectives.\nTheir combined experience spans knowledge graph construction, AI-driven decision support systems, and real-time data integration within complex operational environments, both in the private sector and for defense applications.\nBoth the PI and LE have an extensive background in RDF semantic knowledge graphs, ontology development, and causal AI systems, which are essential for designing adaptive, interactive frameworks that align with DoD requirements.\nThe LE complements this skill set with proven experience in engineering scalable, user- centered interfaces that allow for intuitive interaction with complex data structures.\nTogether, they lead a team capable of translating cutting-edge research into operational, user-friendly systems that meet the DoD’s needs for accuracy, adaptability, and responsiveness in time-sensitive environments.\nTheir expertise ensures that the knowledge graph prototype developed in Phase I will be both technically sound and highly functional, laying a strong foundation for success in subsequent project phases.\n4.8.1 Aktiver’s Experience in Knowledge Graphs and AI for Decision Support As Co-Founder and VP of R&D at Aktiver, the PI leads our development of a knowledge graph system designed for high adaptability and real-time response.\nAktiver’s technical framework leverages lambda calculus, graph theory, and geometric spatial logical reasoners, forming a basis that is deterministic, interpretable, and explainable.\nThis expertise aligns directly with the SBIR objectives, especially the need for a transparent, adaptive knowledge graph that supports SME validation and confidence.\nAktiver’s framework integrates explainable AI models, allowing decision points to be traceable back to subject matter experts (SMEs) and providing system alerts in cases of insufficient information, embodying a structured approach to human-machine teaming.\nThe deterministic nature of this approach ensures that critical decision points are addressed with a high degree of certainty, creating a robust foundation for integrating stochastic AI models when the need for deeper insights arises.\n4.8.2 Planned Coordination and Collaboration Earlier this year, Aktiver launched an Early Adopter Program aimed at onboarding industry-leading experts and companies to test, evaluate, and collaborate on our advanced knowledge graph platform.\nThe program has generated significant interest, with large food and beverage companies, healthcare providers, and software companies already participating.\nThese early adopters offer a diverse testing environment, enabling preliminary feedback on user interaction, system scalability, and real-time adaptability, which will help refine the platform’s core functionalities to ensure ease of use and robust performance.\nIn addition, Aktiver’s established relationships with Intelligence Community (IC) stakeholders have led to expressed interest from IC agencies to explore the technology for operational applications.\nThis involvement provides critical insights into the specific needs of defense and intelligence sectors, shaping the platform to meet high-security, mission-critical requirements.\nThese collaborations will contribute valuable feedback that will drive iterative enhancements throughout the SBIR process, facilitating broader adoption and setting a foundation for deployment across multiple sectors as the technology matures.\n22",
        "30": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] 4.8.3 State-of-the-Art Awareness and Project Alignment technology Aktiver’s engineering team and Founders are active thought leaders, contributors, and participants in advanced the improvement, scalability, and efficiency of knowledge graph systems.\nThrough these engagements, Aktiver remains at the forefront of knowledge graph technology, with a clear awareness of the technology's current limitations, particularly in areas like user interactivity, adaptability, and real-time data integration.\nforums, discussion groups, and industry engagements focused on The team’s deep understanding of existing solutions and their shortcomings, particularly around the lack of flexibility to meet DoD’s dynamic requirements, has guided the development of Aktiver’s unique framework and approach.\nThis SBIR proposal leverages proven techniques in semantic data modeling and real-time ontology adaptation to address these challenges, representing a next-generation solution that advances beyond traditional knowledge graph applications.\nThis proposed SBIR project will capitalize on Aktiver’s combination of technical expertise, thought leadership, and robust technology framework, building upon advanced methodologies to create a dynamic, interactive knowledge graph system specifically tailored to meet the demanding needs of defense and intelligence applications.\nThe Phase I effort will lay a strong foundation for a fully operational, scalable solution in Phase II.\n5.0 Relationship with Future Research or Research and Development 5.1 Anticipated Results of the Proposed Approach If the project is successful, the anticipated results of Aktiver’s proposed approach will include: • Feasibility and Prototype of a User-Interactive, Adaptive Knowledge Graph: Aktiver will develop and assess multiple approaches that allow users to make modifications within a dynamic knowledge graph, with the system intelligently predicting and suggesting additional updates based on these inputs.\nBy experimenting with various methods and obtaining baseline performance metrics, such as accuracy and graph completeness, Aktiver will identify the most promising approach and use this to design an initial prototype.\nThis prototype will demonstrate the feasibility of a knowledge graph that adapts in real time to evolving data inputs and user- driven changes.\n• Enhanced Situational Awareness and Faster Decision-Making: The prototype will enable real- time adjustments to the knowledge graph, providing end users with faster and more accurate situational awareness by dynamically integrating new data and user input.\nBy continuously updating and predicting necessary changes, the knowledge graph will support pattern-of-life analysis, threat detection, and targeting operations, ultimately allowing analysts to make better- informed decisions in time-sensitive environments.\n• Baseline Performance Metrics to Support Future Development: Aktiver will establish baseline metrics for the accuracy, completeness, and adaptability of the knowledge graph, ensuring that its outputs align with mission-critical needs.\nThese performance indicators will serve as essential benchmarks for evaluating improvements, guiding future development, and confirming the system’s ability to provide consistent and reliable insights.\n• Reduction in Cognitive Load and Increased Analytical Efficiency: Through an intuitive GUI and explainable AI, the system will reduce the cognitive load on analysts by enabling straightforward, real-time interaction with the knowledge graph.\nThis interface, paired with predictive graph updates, will allow analysts to focus on high-value analysis without being encumbered by technical complexities, directly enhancing analytical efficiency and mission outcomes.\n• Documented Feasibility Study for State-of-the-Art Knowledge Graph Techniques: The Phase I include comprehensive documentation of the feasibility study, detailing the project will approaches tested, performance metrics, results, and the rationale behind the selected design.\nThis report will not only capture technical achievements but also provide critical insights into 23",
        "31": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] state-of-the-art groundwork for future development and deployment.\ntechniques for dynamic, user-interactive knowledge graphs, laying the If successful, Aktiver’s approach will demonstrate a robust, adaptable knowledge graph prototype that evolves with operational demands, providing a competitive edge in intelligence analysis and supporting the Air Force's mission-critical situational awareness and decision-making needs.\n5.2 Significance of this Phase I The significance of the Phase I effort lies in its role as a critical foundation for advancing to a robust Phase II research and development initiative, specifically tailored to address the Air Force’s need for a dynamic, user-interactive knowledge graph system.\nPhase I will serve to rigorously validate the feasibility of various approaches to user-driven modifications within a knowledge graph and assess the system’s capacity to predict and suggest further graph adjustments.\nBy establishing key baseline performance metrics such as accuracy, completeness, and user trust, Phase I will enable the selection of the most promising approach for further development.\nThrough Phase I, Aktiver will create a prototype design that demonstrates real-time adaptability based on new data inputs and user interaction.\nThis prototype will serve as a proof of concept, illustrating how the system can support critical applications.\nPhase I’s rigorous experimentation and documentation will ensure that the initial design is scalable, accurate, and aligned with operational needs, which is essential for advancing the technology into more comprehensive testing and field application in Phase II.\nWith a proven foundation from Phase I, the Phase II effort will focus on scaling and refining the prototype, further refining from system from Phase 1 lessons learned and user feedback.\nPhase II will also expand upon the baseline metrics obtained in Phase I, enabling Aktiver to measure improvements in analytical efficiency, accuracy, and user adaptability.\nUltimately, the knowledge and insights gained in Phase I will empower Phase II to deliver a mission-ready, scalable knowledge graph system that meets the Air Force’s requirements for real-time intelligence, dynamic adaptability, and operational effectiveness in decision-making environments.\n5.3 Phase II research and development effort The Aktiver’s Engineering team is highly experienced in developing and delivering enterprise software on DoD networks, following best practices in security requirements, vulnerability assessments, and zero trust environments.\nThis expertise ensures that our software is designed for seamless deployment within the customer’s environment, whether on-premises or in the cloud.\nOur team is also well-versed in the Authority to Operate (ATO) process, having successfully navigated the Risk Management Framework (RMF) on past projects, and we are fully prepared to support the ATO requirements for this effort.\nFollowing a successful Phase I R&D effort, during which we will experiment with and select an initial prototype design, we will transition to Phase II to conduct in-depth research and deliver a full-scale prototype for an adaptive, interactive dynamic knowledge graph system.\nThis phase will focus on refining the solution and demonstrating its effectiveness in an Air Force relevant application.\nOur deployment strategy will prioritize simplicity and compatibility with the customer’s network architecture, ensuring that the software can be installed quickly and efficiently.\nGiven our experience in DoD software development and network deployments, we are confident that our solution can achieve an ATO with Conditions (ATO-C) relatively quickly, expediting the testing and evaluation phases for the customer.\nThis streamlined approach will ensure that the customer can experience the benefits of a secure, scalable, and adaptive knowledge graph system with minimal delay, allowing for prompt feedback and optimization of mission-critical capabilities.\n6.0 Commercialization Strategy 6.1 Market Need and Opportunity Aktiver’s dynamic, adaptive knowledge graph technology addresses a critical need for real-time, data- driven decision support systems that evolve with new data inputs and user interactions.\nThis technology is essential for the Department of Defense (DoD), Federal Agencies, the Intelligence Community (IC), and private sector markets, especially in industries that handle complex data landscapes, such as healthcare, 24",
        "32": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] food and beverage, regulatory authorities, financial services, pharmaceuticals and biotechnology, energy and utilities, telecommunications, supply chain and logistics, retail and e-commerce, insurance, and cybersecurity.\nEach of these sectors requires solutions that can integrate vast and diverse data sources, provide real-time insights, and dynamically adapt to evolving data environments to support critical decision-making and operational efficiency.\nIn the DoD and intelligence sectors, Aktiver’s technology is well-suited to meet the high operation demands of these organization offering significant advancements in intelligence cycle efficiency, reduced cognitive load, and improved situational awareness.\nThe DoD intelligence software market is projected to reach $11 billion by 2026, driven by rising investments in AI and decision support technology.\nAktiver’s Early Adopter Program is gaining significant traction in the commercial markets and DoD and IC spaces, showcasing our technology’s versatility.\n6.2 Commercial Product Roadmap 1.\nSaaS Product Launch (January 2025) Aktiver will release a commercial Software-as-a-Services (SaaS) knowledge graph platform in January 2025, designed to allow companies to access a secure, cloud-based version of our technology.\nThis SaaS product offers immediate benefits to clients in healthcare, finance, and manufacturing by enabling seamless data integration and adaptive insights without the need for extensive infrastructure.\nThe SaaS platform will provide tools for ontology management, data ingestion, and real-time decision support, accessible through an intuitive, user-friendly GUI.\n2.\nPaaS Development (Q4 2025 – Q1 2026) Following the SaaS launch, Aktiver will launch our Platform-as-a-Service (PaaS) product focused on customers who’s company policies, data sensitivity requirements, or network restrictions disallow SaaS product use.\nThe PaaS offering will allow customers to host their data in private, secured environments within our platform, offering them enhanced control over their knowledge graph infrastructure, data governance, and integration with internal systems.\nThe PaaS will include features such as advanced API integrations, custom ontology capabilities, and extended access controls to support regulated industries like healthcare and finance.\no Deliverables by Q1 2026:  Launch PaaS with multi-tenant support for large-scale enterprise integration.\n Provide secure APIs and developer tools for custom ontology development.\n Enhanced compliance and security modules tailored for regulated industries.\n6.3 Phase II Timeline for DoD and Federal Applications In addition to commercial deployment, Aktiver will develop and demonstrate the effectiveness of this technology in DoD relevant applications as part of the Phase II SBIR program.\nThis includes deployment in intelligence, logistics, and command and control environments, where adaptive knowledge graphs will support rapid decision-making in dynamic settings.\nExpected Commercialization Milestones 1.\nPhase II and Beyond (2025–2026) o Federal and DoD Contracts: Post-Phase II, Aktiver will expand knowledge graph deployment to other DoD branches and federal agencies, including DHS and DOJ.\no Scaling SaaS and PaaS in the Private Sector: Continue onboarding early adopters and begin large-scale marketing for SaaS and PaaS solutions across healthcare, finance, and manufacturing.\n2.\nRevenue and Growth Goals (2026–2028) o Quantitative Revenue Targets: Aktiver projects revenue from federal contracts to reach $10 million annually by 2028.\nSaaS/PaaS subscriptions are expected to generate approximately $5–$7 million annually as new clients onboard.\n25",
        "33": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] o Market Penetration: Target 20–30 private sector clients across industries, generating an additional $7 million in annual revenue by 2028.\n3.\nLong-Term Strategy (2029 and Beyond) o Product Diversification and Advanced Features: Aktiver plans to enhance the SaaS/PaaS platforms with advanced features such as predictive analytics, industry- specific ontologies, and machine learning-driven insights for enterprise clients.\nIntelligence Community Engagement: Expand outreach to the intelligence community and government agencies to address their evolving mission-critical requirements for dynamic decision support systems.\no 6.4 Commercialization Summary By focusing on SaaS and PaaS product offerings that meet the needs of both government and private sector clients, Aktiver is positioned to drive the adoption of adaptive knowledge graph technology in complex data environments.\nThis strategic approach enables us to deliver scalable, secure, and adaptable solutions that empower industries to make faster, data-driven decisions, ultimately transforming knowledge graph systems into indispensable tools for operational intelligence and competitive advantage.\n7.0 Key Personnel Principal Investigator: Joe Hoeller For the past five years, Mr.\nJoe Hoeller has served as an Advisor to the Joint Staff J2 directorate, focusing on causal knowledge graph-based AI systems and advanced analytical methods.\nJoe brings extensive experience in RDF semantic knowledge graph construction, ontology integration, and AI-driven decision support systems across both private and public sectors.\nAs the Director of Data Science, R&D at Function Health, Mr.\nHoeller led the development of an automated clinical decision support system, a groundbreaking RDF knowledge graph-based software that integrates logical inference (clinical reasoning capabilities) to provide insights that are both explainable and interpretable for medical professionals.\nHis work included automating NIH/UMLS ontology matching to clinical tests using UMLS Metathesaurus CUIs, culminating in a clinical decision support system that received validation from Stanford Medicine during due diligence.\nThis innovation led to Function Health securing $60 million in Series A funding from a16z.\nMr.\nHoeller’s work within the DoD has been equally impactful.\nHe designed a semantic knowledge graph- based reasoning engine that automates the intelligence cycle, utilizing neural search to improve situational awareness and decision-making capabilities.\nThis system is underpinned by a robust semantic knowledge graph customized with domain-specific ontologies for defense applications.\nAs the lead PI for the Naval Special Warfare Group 8 AI competition in 2022, Joe earned top honors for his innovative approach, blending deep learning architecture with semantic knowledge graph technology to identify and re-identify vessels from multi-sensor data in open ocean environments.\nAs a Co-Founder and VP of R&D at Aktiver, Joe leads our software development team with the mission of revolutionizing adaptive, interactive knowledge graphs and redefining how organizations across industries, including healthcare, the Department of Defense (DoD), finance, and manufacturing make more informed, accurate decisions with their data.\nBy fully harnessing the untapped potential of AI, Aktiver enables these sectors to tackle complex, mission-critical challenges and make data-driven, strategic decisions with confidence.\nOur approach transforms knowledge graphs into intelligent, real-time systems capable of learning, adapting, and delivering actionable insights that empower organizations to navigate dynamic environments, drive innovation, and maintain a competitive edge in an increasingly complex world.\nDespite lacking a formal academic background, Mr.\nHoeller approaches innovation in the spirit of Orville and Wilbur Wright, who pioneered flight before formal aerospace engineering programs existed.\nJoe has trained and mentored multiple PhDs in AI and graph-based machine learning over his career, and with 26",
        "34": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] more than 20 models in production to date, he continues to drive impactful advancements in knowledge graph and AI technology.\nRelevant Publications: 1.\nHoeller, Joe.\n\"Understanding Graph Types and Ontological-Driven Data Structures.\" Medium, June 26, 2024.\n2.\nHoeller, Joe.\n\"Intro to Taxonomy, to Thesaurus, to Ontology, to Knowledge Graph.\" Medium, June 26, 2024.\n3.\nHoeller, Joe.\n\"DevOps for Data Scientists.\" Medium, February 7, 2020 Lead Engineer: Malachi Keddington Education: • Master of Science (Engineering), Northern Arizona University, May 2003 • Bachelor of Science (Pre-Medicine), Minor (Physics/Chemistry) Northern Arizona University, May 2001 Mr.\nKeddington is a seasoned engineering leader with a demonstrated ability to drive high-impact programs across government and commercial organizations.\nWith over two decades of operational experience, he has developed deep expertise in aligning advanced technical solutions with mission- critical objectives, leveraging his skills in Model-Based Systems Engineering (MBSE), rapid research and development (R&D) initiatives, and agile project management.\nHis background includes managing complex development pathways, delivering on priority efforts for the Department of Defense (DoD) and various commercial clients, and ensuring that project outcomes meet stringent operational demands.\nAt Aktiver, Mr.\nKeddington collaborates with the development team on the strategic design and implementation of adaptive, knowledge graph-based systems tailored to meet both DoD and commercial needs.\nIn this role, he leads a multi-disciplinary team in building scalable, real-time data solutions that enhance decision-making through the integration of explainable AI and semantic knowledge graphs.\nHis leadership ensures that Aktiver’s solutions are not only technically advanced but also aligned with mission-specific objectives, delivering measurable value and operational efficiency.\nAs a Principal at SeerAI, a technology start-up specializing in data mesh architecture with semantic knowledge graph integrations, Mr.\nKeddington played a pivotal role in establishing high-value partnerships and positioning the company as an In-Q-Tel (IQT) portfolio company.\nHe successfully secured IQT-funded contracts with the National Geospatial-Intelligence Agency (NGA) and the Defense Intelligence Agency (DIA), advancing innovative semantic knowledge graph integrations that enhance data connectivity and strengthen intelligence capabilities.\nMr.\nKeddington is an expert in decision support systems, specializing in applications that integrate knowledge graphs and Generative AI (GenAI) to optimize strategic planning and operational execution.\nHis work has consistently improved data-driven decision-making, ensuring that organizations maximize efficiency and effectiveness in both high-stakes government missions and competitive commercial markets.\nKnown for his ability to bridge technical and operational domains, Mr.\nKeddington leads teams to harness AI and knowledge-driven approaches that solve complex challenges, providing a technological edge in both sectors.\nIn addition to his technical expertise, Mr.\nKeddington is Project Management Professional (PMP) certified, holds a Six Sigma Black Belt, and is highly skilled in Agile software development methodologies.\nHis comprehensive understanding of MBSE, combined with his expertise in Six Sigma and Agile practices, enables him to manage projects demanding precise coordination and execution, driving innovation while maintaining a focus on achieving measurable outcomes.\nWith a proven track record, Mr.\nKeddington is recognized for his leadership and technical acumen in delivering scalable, adaptable, and impactful systems that empower organizations to operate at the forefront of their capabilities.\n27",
        "35": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] 8.0 Foreign Citizens None 9.0 Facilities/Equipment Aktiver is fully equipped with the necessary instrumentation and physical facilities to support the successful execution of the Phase I effort.\nAll work will be performed using Aktiver's internal resources, including both on-premises physical machines and a secure cloud environment designed to support rapid research and development efforts.\n9.1 Available Instrumentation and Physical Facilities 1.\nInternal Physical Machines: Aktiver’s includes high-performance internal computing servers equipped with state-of-the-art GPUs and CPUs to support computationally intensive tasks, data processing, and model training required for knowledge graph construction, ontology testing, and user interaction simulations.\ninfrastructure 2.\nSecure Cloud Environment: Aktiver utilizes a cloud infrastructure configured to accommodate large-scale data storage and real-time processing capabilities, critical for developing and testing dynamic knowledge graph prototypes.\nThe cloud environment is equipped with secure access protocols to ensure data integrity and support for scaling R&D tasks as needed throughout the Phase I effort.\n3.\nCompliance with Environmental Regulations: With a completely remote workforce Aktiver meets or exceeds all environmental laws and regulations of federal, state, and local governments, including Texas, Florida, and Chicago for: o Airborne Emissions: No work will involve emissions beyond standard HVAC use within the facility.\no Waterborne Effluents: There are no waterborne effluents associated with the proposed work.\no External Radiation Levels: All equipment and facilities comply with safe radiation levels.\no Outdoor Noise: Aktiver’s work environment operates within allowable noise levels and does not involve heavy machinery or disruptive equipment.\no Solid and Bulk Waste Disposal: Waste disposal practices adhere to federal and state guidelines, with secure disposal methods for any electronic or data-related waste.\no Handling and Storage of Toxic and Hazardous Materials: This R&D effort does not require the handling or storage of any toxic or hazardous materials.\nJustification for Additional Equipment Purchases To support the Phase I objectives, Aktiver may need to acquire evaluation licenses of third-party software for evaluating specific methodologies and enhancing the knowledge graph system’s functionality.\nAny such purchases will be carefully assessed and justified based on their potential to meet technical requirements outlined in the SBIR R&D effort.\nDetailed pricing for third-party software and any additional equipment purchases will be provided in the Cost Volume.\nAktiver’s comprehensive suite of in-house resources, combined with our ability to integrate third-party solutions, will ensure we are well-prepared to execute the Phase I work plan effectively.\nThis infrastructure supports both the computational and security needs of the project, allowing us to deliver a robust, adaptive knowledge graph prototype in compliance with all regulatory requirements.\n10.0 Subcontractors/Consultants None 28",
        "36": "Proposal Number [F244-0001-0064] Topic Number [AF244-0001] 11.0 Prior, Current or Pending Support of Similar Proposals or Awards No prior, current, or pending support has been provided for proposed work.\n12.0 Technical Data Rights Aktiver will comply with all technical data rights requirements as specified in DFARS clause 252.227-7018 Class Deviation 2020-O0007.\nAktiver has no assertions concerning data rights and acknowledges that any technical data, including software, developed under this SBIR contract will include a Government royalty-free license for Government use, commencing from the contract award date and extending for twenty years following project completion.\nDuring this license period, Aktiver will mark data with the restrictive legend specified in DFARS 252.227-7018, as required.\nAktiver understands that during the restrictive license period, the Government will not release or disclose SBIR data to external entities except under the following circumstances: for evaluation purposes, as expressly permitted by Aktiver, or when necessary for emergency repair or overhaul of Government- operated items.\nUpon the expiration of the twenty-year license period, the Government will obtain unlimited rights in the SBIR data.\nAktiver remains committed to full compliance with these data rights provisions throughout the contract term.\n13.0 Identification and Assertion of Restrictions on the Government's Use, Release, or Disclosure of Technical Data or Computer Software None (Intentionally Left Blank) 29",
        "37": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Cage F244-0001-0064 AF244-0001 Operationalizing Dynamic Knowledge Graphs to Enhance AI/ML-Driven Decision- Making and Situational Awareness 11/06/2024 11:35:25 AM AKTIVER LLC 2438 N SURREY CT, CHICAGO, Illinois, 60614 https://www.aktiver.io/ LLZYM735J8U6 92TL7 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 10%) x Base (TDL) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) $139,247.00 $139,247.00 $0.00 $0.00 $0.00 $126,050.00 $0.00 $0.00 $1,092.00 $0.00 $0.00 $12,105.00 $139,247.00 $0.00 -$0.00 $0.00 $139,247.00 $0.00 $0.00 $0.00 $0.00",
        "38": "Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Software Developer/ Principal Investigator $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $150.00 625 $93,750.00 Computer and Information Research Scientist/ Lead Engineer (Malachi Keddington) $150.00 182 Subtotal Direct Labor (DL) Labor Overhead Cost Total Direct Labor (TDL) Direct Equipment Costs Cloud Compute and Resources Total Direct Equipment Costs (DE) Other Direct Costs N/A Total Other Direct Costs (TODC) G&A (rate 0%) x Base (TDL) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Year 2 Direct Labor Costs $27,300.00 $121,050.00 $5,000.00 $126,050.00 $1,092.00 $1,092.00 $0.00 $0.00 $12,105.00 -$0.00 $0.00 $139,247.00 $0.00",
        "39": "Category / Individual-TR Software Developer/ Principal Investigator Computer and Information Research Scientist/ Lead Engineer (Malachi Keddington) Subtotal Direct Labor (DL) Labor Overhead Cost Total Direct Labor (TDL) Direct Equipment Costs None Total Direct Equipment Costs (DE) Other Direct Costs N/A Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $150.00 0 $150.00 0 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Malachi Keddington Phone: (813) 285-6652 Phone: mk@aktiver.io Title: Proposal Owner If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: No Select the Type of Payment Desired: Partial payments",
        "40": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Software Developer Principal Investigator Some College Computer and Information Research Scientist Lead Engineer Master's Degree 22 20 625 $150.00 $93,750.00 182 $150.00 $27,300.00 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\nThe cost associated with our Principal Investigator (PI) reflects their significant expertise and critical role in executing the technical objectives outlined in this SBIR Phase I effort.\nProvide any additional information and cost support data related to the nature of the direct labor detailed above.\nThe PI’s $150/hr rate for 750 hours covers project planning, technical oversight, AI integration, and documentation, ensuring advanced expertise for this complex DoD-focused knowledge graph system.\nDirect Labor Cost ($): Year2 $121,050.00 Category Description Education Yrs Experience Hours Rate Fringe Rate Software Developer Principal Investigator Some College 22 Computer and Information Research Scientist Lead Engineer Master's Degree 20 0 0 $150.00 $150.00 Are the labor rates detailed below fully loaded?\nPlease explain any costs that apply.\nThe cost associated with our Principal Investigator (PI) reflects their significant expertise and critical role in executing the technical objectives outlined in this SBIR Phase I effort.\nProvide any additional information and cost support data related to the nature of the direct labor detailed Total $0.00 $0.00 YES",
        "41": "above.\nThe PI’s $150/hr rate for 750 hours covers project planning, technical oversight, AI integration, and documentation, ensuring advanced expertise for this complex DoD-focused knowledge graph system.\nDirect Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Cost Apply Overhead to Direct Equipment Cost?\nApply Overhead to Direct Other Cost?\nOverhead Comments: The project includes Compute Costs and Third-Party Applications to support experimentation and ensure robust system performance.\nCompute Costs: To develop and test adaptive knowledge graph models, Aktiver requires cloud-based computing resources.\nThese resources will provide scalability, enable high- performance data processing, and support real-time experimentation crucial for model development.\nEstimated compute costs will cover the processing power, storage, and bandwidth needed throughout Phase I.\nThird-Party Applications: To evaluate the compatibility and performance of various components, we will use specialized third-party applications.\nThese tools are essential for experimentation with different algorithms, knowledge graph integrations, and AI model validation.\nThey will allow us to benchmark performance and fine-tune the system efficiently.\nThese ODCs are critical for achieving SBIR objectives, supporting experimentation, and ensuring a high-performing, adaptive knowledge graph solution.\nOverhead Cost ($): Year2 Labor Cost Overhead Cost Apply Overhead to Direct Equipment Cost?\nApply Overhead to Direct Other Cost?\nOverhead Comments: The project includes Compute Costs and Third-Party Applications to support experimentation and ensure robust system performance.\nCompute Costs: To develop and test adaptive knowledge graph models, Aktiver requires cloud-based computing resources.\nThese resources will provide scalability, enable high- performance data processing, and support real-time experimentation crucial for model development.\nEstimated compute costs will cover the processing power, storage, and bandwidth needed throughout Phase I.\nThird-Party Applications: To evaluate the compatibility and performance of various components, $0.00 $121,050.00 $5,000.00 NO NO $5,000.00 $0.00 NO NO",
        "42": "we will use specialized third-party applications.\nThese tools are essential for experimentation with different algorithms, knowledge graph integrations, and AI model validation.\nThey will allow us to benchmark performance and fine-tune the system efficiently.\nThese ODCs are critical for achieving SBIR objectives, supporting experimentation, and ensuring a high-performing, adaptive knowledge graph solution.\nOverhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to ODC- Equipment?\nApply G&A Rate to Other Direct Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nAktiver’s General and Administrative (G&A) costs are calculated at a rate of 22% and cover essential operational and overhead expenses associated with managing and supporting the SBIR project.\nThese costs are distributed across various sources, as follows: Direct Labor Costs: G&A is applied to the direct labor expenses, including the PI, Lead PM, and other engineering or support staff involved in the project.\nThis ensures all personnel-related administrative functions are adequately funded.\nOther Direct Costs (ODCs): G&A is applied to compute costs and third-party application expenses essential for experimentation and system development.\nThis includes cloud resources and external software required for testing and validation.\nMaterial and Supply Costs: If additional materials or supplies are necessary to support the R&D effort, G&A covers procurement processes, inventory management, and administrative handling of these items.\nG&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\n$0.00 $5,000.00 10 NO YES NO NO $12,105.00 0 NO NO",
        "43": "Apply G&A Rate to ODC- Equipment?\nApply G&A Rate to Other Direct Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nAktiver’s General and Administrative (G&A) costs are calculated at a rate of 22% and cover essential operational and overhead expenses associated with managing and supporting the SBIR project.\nThese costs are distributed across various sources, as follows: Direct Labor Costs: G&A is applied to the direct labor expenses, including the PI, Lead PM, and other engineering or support staff involved in the project.\nThis ensures all personnel-related administrative functions are adequately funded.\nOther Direct Costs (ODCs): G&A is applied to compute costs and third-party application expenses essential for experimentation and system development.\nThis includes cloud resources and external software required for testing and validation.\nMaterial and Supply Costs: If additional materials or supplies are necessary to support the R&D effort, G&A covers procurement processes, inventory management, and administrative handling of these items.\nG&A Cost ($): Sum of all G&A Costs is ($): ODC-Equipment Base NO NO $0.00 $12,105.00 Description: Cloud Compute and Resources Vendor: AWS Quantity: 6 Total Cost ($): $1,092.00 Competitively Sourced?\nyes Exclusive for this Contract?\nyes Supporting Comments: To support the development and testing of our adaptive knowledge graph system, cloud compute and developer resources in AWS are essential.\nAt a cost of $182 per month for 6 months, these resources provide the scalability, flexibility, and performance needed to handle data-intensive processes, algorithm testing, and real-time system modifications.\nAWS enables our team to conduct secure, high-speed experimentation and development efficiently, ensuring that all computational requirements for the SBIR project are met without the need for costly on-premises infrastructure.\nThis allocation is crucial for maintaining productivity and ensuring the timely achievement of Phase I objectives.\nYear2 Description: None Quantity: 0 Vendor: None Total Cost ($): $0.00 Competitively Sourced?\nyes Exclusive for this Contract?\nyes Supporting Comments: To support the development and testing of our adaptive knowledge graph system, cloud compute and developer resources in AWS are essential.\nAt a cost of $182 per month for 6 months, these resources provide the scalability, flexibility, and performance needed to handle data-intensive processes, algorithm testing, and real-time system modifications.\nAWS enables our team to conduct secure, high-speed experimentation and development efficiently, ensuring that all computational requirements for the SBIR project are met without the need for costly on-premises infrastructure.\nThis allocation is crucial for maintaining productivity and ensuring the timely achievement of Phase I objectives.",
        "44": "ODC-Other Base Description: N/A Quantity: 0 Vendor: N/A Total Cost ($): $0.00 Competitively Sourced?\nyes Exclusive for this Contract?\nyes Supporting Comments: For this SBIR Phase I effort, Aktiver is proposing the research, prototype development, and all associated direct costs at no additional profit.\nOur focus is on the successful completion of this project and advancing the technology solution to meet DoD requirements, without generating profit from this Phase I initiative.\nAll funding allocated will directly support labor, cloud compute, materials, and any necessary third-party applications required for experimentation and prototype testing.\nAktiver’s commitment to this project reflects our dedication to R&D and to establishing a strong foundation for potential future phases.\nYear2 Description: N/A Quantity: 0 Vendor: N/A Total Cost ($): $0.00 Competitively Sourced?\nyes Exclusive for this Contract?\nyes Supporting Comments: For this SBIR Phase I effort, Aktiver is proposing the research, prototype development, and all associated direct costs at no additional profit.\nOur focus is on the successful completion of this project and advancing the technology solution to meet DoD requirements, without generating profit from this Phase I initiative.\nAll funding allocated will directly support labor, cloud compute, materials, and any necessary third-party applications required for experimentation and prototype testing.\nAktiver’s commitment to this project reflects our dedication to R&D and to establishing a strong foundation for potential future phases.\nODC-Summary Base Do you have any additional information to provide?\nYear2 Do you have any additional information to provide?\nProfit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: For this SBIR Phase I effort, Aktiver is proposing the research, prototype development, and all associated direct costs at no additional profit.\nOur focus is on the successful completion of this project and advancing the technology solution to meet DoD requirements, without generating profit from this Phase I initiative.\nAll funding allocated will directly support labor, cloud compute, materials, and any necessary third-party applications required for experimentation and prototype testing.\nAktiver’s commitment to this project reflects our dedication to R&D and to establishing a strong foundation for potential future NO NO -$0.00 0",
        "45": "phases.\nTotal Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: For this SBIR Phase I effort, Aktiver is proposing the research, prototype development, and all associated direct costs at no additional profit.\nOur focus is on the successful completion of this project and advancing the technology solution to meet DoD requirements, without generating profit from this Phase I initiative.\nAll funding allocated will directly support labor, cloud compute, materials, and any necessary third-party applications required for experimentation and prototype testing.\nAktiver’s commitment to this project reflects our dedication to R&D and to establishing a strong foundation for potential future phases.\nTotal Profit Cost ($): Total Proposed Amount ($): $0.00 -$0.00 0 $0.00 $139,247.00",
        "46": "Malachi Keddington, AKTIVER LLC Nov 04, 2024 Nov 04, 2025"
    },
    "images": [
        {
            "page": 8,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page8_img1.png",
            "hash": "f00807ff078ffa05",
            "position": "Top Right"
        },
        {
            "page": 9,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page9_img1.png",
            "hash": "f00807ff078ffa05",
            "position": "Top Right"
        },
        {
            "page": 10,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page10_img1.png",
            "hash": "f00807ff078ffa05",
            "position": "Top Right"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page11_img1.png",
            "hash": "f00807ff078ffa05",
            "position": "Top Right"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page12_img1.png",
            "hash": "f00807ff078ffa05",
            "position": "Top Right"
        },
        {
            "page": 13,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page13_img1.png",
            "hash": "f00807ff078ffa05",
            "position": "Top Right"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page14_img1.png",
            "hash": "f00807ff078ffa05",
            "position": "Top Right"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page15_img1.png",
            "hash": "f00807ff078ffa05",
            "position": "Top Right"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page15_img2.png",
            "hash": "83a678e907d1f196",
            "position": "Middle Center"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page16_img1.png",
            "hash": "f00807ff078ffa05",
            "position": "Top Right"
        },
        {
            "page": 17,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page17_img1.png",
            "hash": "f00807ff078ffa05",
            "position": "Top Right"
        },
        {
            "page": 18,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page18_img2.png",
            "hash": "9c724b8fd0796594",
            "position": "Bottom Center"
        },
        {
            "page": 21,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page21_img2.png",
            "hash": "c1c91d9ee234e1cd",
            "position": "Bottom Center"
        },
        {
            "page": 22,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page22_img2.png",
            "hash": "dcdabe9163341919",
            "position": "Top Center"
        },
        {
            "page": 22,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page22_img3.png",
            "hash": "dc997f1621331569",
            "position": "Middle Center"
        },
        {
            "page": 25,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page25_img2.jpeg",
            "hash": "bad55ada1daae420",
            "position": "Middle Center"
        },
        {
            "page": 27,
            "image_file": "docNAC01FB7453536a7ba16d14710c93bbb27a81766f6b9205e774cacc5795125f3f27b973131773_page27_img2.png",
            "hash": "c07c3fffc0c00787",
            "position": "Bottom Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "aktiver.io",
        "name": "N/A",
        "phone": "N/A"
    }
}