{
    "filename": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0034 Proposal Title: KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: Technergetics, LLC Address: Website: UEI: DUNS: CAGE: 114 Genesee Street , Utica, NY 13502-3508 http://www.techngs.com XWYVA88GZ1F5 078840730 6X4M8 SBA SBC Identification Number: 000700589 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 75 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_000700589 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_000700589_sbir.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [X] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Robert Harrod Signature Title Business Name Date Robert Harrod President Technergetics, LLC 02/12/2020",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?\nWas your accounting system approved by the auditing agency?\nWas a rate agreement negotiated with the auditing agency?\nWas an overhead and/or cost audit performed?\nYES Last Audit Date: 04/16/2024 YES Last Update Date: 09/19/2019 YES Last Update Date: 11/08/2023 YES Date of Overhead Audit: 06/18/2019 Date of Cost Audit: 06/18/2019 Are the rates from the audit agreement used for this firms proposal?\nYES Firm Information: Agency Firm: Address: Point of Contact (POC) Name: POC Phone: POC Email: Defense Contract Audit Agency 5795 Widewaters Parkway 2nd Floor Dewitt , New York 13214 Tong Sun (571) 448-9307 xiaotong.sun.civ@mail.mil Upload a copy of the audit information: • 01 DCAA MFR 03441-2018U10100004-final-Signed-1.pdf VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract:",
        "5": "Data has emerged as a pivotal component of modern warfare, rivaling conventional weapons in its strategic significance.\nThe seamless flow of information is integral to the operational effectiveness of our economy, military capabilities, and command structures.\nAs we navigate increasingly complex global military dynamics, information superiority—the capacity to collect, process, and exploit operational data—becomes crucial for outpacing adversaries.\nThe demand for a real-time strategic knowledge architecture capable of aggregating operational data is growing, evident in the use cases of the Department of the Air Force (DAF) Intelligence, Surveillance, and Reconnaissance (ISR).\nThis architecture would facilitate rapid decision-making across various scenarios, including combat, humanitarian operations, and peacetime engagements.\nBy converting data into actionable intelligence, we can enhance situational awareness, empower decision-makers, and optimize power projection through Multi-Domain Operations (MDO) across cyberspace and physical domains.\nThis transformation informs faster tactical responses and sustains operational readiness in an evolving battlefield landscape.\nKnowledge Graphs (KGs) have become essential tools across industries; in commercial settings, KGs often function as a unified, authoritative source of truth, even if deployed across distributed infrastructures.\nHowever, military applications demand a different approach.\nOperational units, such as individual squadrons or organizations, must be able to construct, adapt, and customize their KGs to address unique engagement scenarios.\nThis is particularly exacerbated if a unit needs to operate in a contested environment under degraded network conditions, such that even a unit’s KG may diverge from itself.\nThis decentralized need inevitably leads to the creation of multiple disconnected or partially aligned KGs, increasing the risk of information silos and fragmented knowledge.\nCreating a robust solution for interactive and editable KGs that can effectively manage the complexities of dynamic, real-time decision-making scenarios while ensuring interoperability across organizational units involves various engineering challenges.\nOur team possesses the expertise necessary to tackle these obstacles head-on.\nFurthermore, Technergetics has established a solid reputation in this domain, leveraging extensive experience in large-scale data collection and KG development to enhance the effectiveness of our solution.\nIn this Phase 1 effort, our combined team will assess the feasibility of a software ecosystem that brings these solutions together, along with a deep alternative analysis of current SOTA methodologies in dynamic KG alignment and reinforcement learning (RL), to advance the development of KnowFlow: An Interactive, Mutable, and Federated KG Environment (IMF- KGE), a novel solution for intelligence analysis, enhanced situational awareness, threat detection, and targeting operations.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: We propose to research and develop KnowFlow IMF-KGE to address the DAF need for adaptive, interactive, and dynamic KGs.\nOur effort focuses on applying version control principles to manage dynamic mutations within the IMF-KGE.\nWith these principles in place, we can automate data ingestion, mapping, and recommendation features while providing users with a streamlined user interface (UI) to interact with the IMF-KGE.\nThe result should be increased ML labeling efficiency, streamlined",
        "6": "operational analytics, and knowledge collaboration to support “fight-tonight” readiness.\n1.\nResearch and design automatic data ingestion methodologies to translate tabular data stores into knowledge graph entries, specifically targeting situational awareness use-cases.\n2.\nResearch and design a KG version control system that tracks a federated KG state with data version control systems while maintaining rich context to support downstream recommendations tasks leveraging nanopublications.\n3.\nResearch and evaluate SOTA approaches for automatic KG recommendations based on user modeling with RL as well as graph completion algorithms leveraging KG embeddings.\n4.\nAssess the viability of Cytoscape.js (U.S.\nNational Human Genome Research Institute (NHGRI), n.d.) as a KG visualization and interaction mechanism once integrated with a viable KG version control system.\nTechnergetics' strategy for the technology offers opportunities for DoD and non-DoD customers to optimize product revenue.\nA key differentiator between the two customer markets is that DoD customers will receive unlimited rights developed within this effort.\nThis benefit will reduce the barrier of entry for the DoD.\nThe market's growth is primarily propelled by organizations' need to effectively manage and derive insights from large, complex datasets.\nThe rising demand for personalized user experiences and the imperative for interoperability and seamless data sharing among diverse systems further fuel this expansion.\nKnowledge graphing technologies are finding applications across multiple sectors—including healthcare, media and entertainment, financial services, e-commerce, and manufacturing—where they enhance operational efficiency, reduce costs, and deliver tailored experiences to end users.\nPotential customers of interactive KGs span various industries and sectors, primarily driven by their need to analyze complex data relationships, derive insights, and improve decision-making processes.\nWe envision initial primary customers as AFRL and DAF intelligence analysts.\nThe global KG market is experiencing significant growth, driven by the increasing need for efficient data integration and management solutions.\nIn 2022, the market was valued at approximately USD $1.3B and is projected to reach USD $3.6B by 2030, reflecting a compound annual growth rate of 14.2%.\nThese projections underscore the growing adoption of KGs as organizations seek to harness complex data relationships for enhanced decision-making and operational efficiency.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary:",
        "7": "0 List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: Interactive Knowledge Graphs, Knowledge Acquisition, Knowledge Graph Versioning, Data Collection, Nanopublication Architecture, Data Visualizations, Federated Data Environment, AI/ML-Enhanced Nodes and Edges VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\n3.\nDuring the performance of the contract, the research/research and development will be performed in the United States.\n67.88% 32.12% YES YES 4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\n8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES NO NO NO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and",
        "8": "included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\n15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\n16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES NO 20% NO YES Partners: Partner Name Simage Partner Type Small Business Point of Contact Dr Chase Yakaboski VOL I - Contact Information Principal Investigator Name: Robert Harrod Phone: (315) 271-2096 Email: robert.harrod@techngs.com Address: 114 Genesee Street , Utica, NY 13502 - 1111 Corporate Official Name: Robert Harrod Phone: (315) 271-2096 Email: robert.harrod@techngs.com Address: 114 Genesee Street , Utica, NY 13502 - 1111 Authorized Contract Negotiator Name: Ms.\nEvi Jesaitis Phone: (315) 271-2096 Email: evi.jesaitis@techngs.com Address: 114 Genesee Street , Utica, NY 13502 - 1111 Form Generated on 11/06/2024 10:55:09 AM",
        "9": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 This proposal includes data that must not be disclosed outside the Government and must not be duplicated, used, or disclosed in whole or in part for any purpose other than to evaluate this proposal.\nIf, however, a contract is awarded to this submitting small business concern as a result of or in connection with the submission of this data, the Government has the right to duplicate, use, or disclose the data to the extent provided in the resulting contract.\nThis restriction does not limit the Government’s right to use the information contained in this data if obtained from another source.\nTable of Contents 1.0.\nIDENTIFICATION AND SIGNIFICANCE OF THE PROBLEM OR OPPORTUNITY ...........\n2 2.0.\nTECHNICAL OBJECTIVES ..............................................................................................................\n4 2.1.\nTECHNICAL APPROACH AND FEASIBILITY .............................................................................................\n5 2.2.\nALTERNATIVE TECHNICAL APPROACHES ............................................................................................\n16 2.3.\nTECHNICAL RISK MITIGATION ............................................................................................................\n17 3.0.\nPHASE I STATEMENT OF WORK OUTLINE ............................................................................\n17 3.1.\nSCOPE ................................................................................................................................................\n17 3.2.\nTASK OUTLINES..................................................................................................................................\n18 3.3.\nMILESTONE SCHEDULE AND DELIVERABLES .......................................................................................\n19 4.0.\nRELATED WORK .............................................................................................................................\n19 4.1.\nIMPROVED DATA COLLECTION AND KNOWLEDGE GRAPHING IN THE TAK ECOSYSTEM .......................\n19 4.2.\nARMY TECH MARKETPLACE (ATM) ...................................................................................................\n21 4.3.\nFUELAI: DATA LABELING PLATFORM FOR TRAINING AI/ML ALGORITHMS .........................................\n22 4.4.\nWINGMANAI: AI ALGORITHM MARKETPLACE, EVALUATION, AND DEPLOYMENT PLATFORM ..............\n22 4.5.\nTHE SAWLINK MODEL .......................................................................................................................\n22 4.6.\nD-SPARK: A VERSATILE PLATFORM FOR KNOWLEDGE DISCOVERY AND SITUATIONAL AWARENESS..\n25 5.0.\nRELATIONSHIP WITH FUTURE RESEARCH OR R&D ..........................................................\n26 6.0.\nCOMMERCIALIZATION STRATEGY .........................................................................................\n27 7.0.\nKEY PERSONNEL ............................................................................................................................\n29 8.0.\nFOREIGN CITIZENS........................................................................................................................\n31 9.0.\nFACILITIES/EQUIPMENT .............................................................................................................\n31 10.0.\nSUBCONTRACTORS/CONSULTANTS ......................................................................................\n31 10.1.\nSIMAGE AUTONOMY LLC (SIMAGE) .................................................................................................\n31 11.0.\nPRIOR, CURRENT, OR PENDING SUPPORT OF SIMILAR PROPOSALS/AWARDS......\n32 12.0.\nREFERENCES .................................................................................................................................\n32 Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n1",
        "10": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 1.0.\nIdentification and Significance of the Problem or Opportunity Data has emerged as a pivotal component of modern warfare, rivaling conventional weapons in its strategic significance.\nThe seamless flow of information is integral to the operational effectiveness of our economy, military capabilities, and command structures.\nAs we navigate increasingly complex global military dynamics, information superiority—defined as the capacity to collect, process, and exploit operational data—becomes crucial for outpacing adversaries.\nThe demand for a real-time strategic knowledge architecture capable of aggregating operational data is growing, evident for Department of the Air Force (DAF) Intelligence, Surveillance, and Reconnaissance (ISR).\nThis architecture would facilitate rapid decision-making across various scenarios, including intelligence exploitation, combat, humanitarian operations, and peacetime engagements.\nBy converting data into actionable intelligence, we can enhance situational awareness, empower decision-makers, and optimize power projection through Multi-Domain Operations (MDO) across cyberspace and physical domains.\nThis transformation informs faster tactical responses and sustains operational readiness in an evolving battlefield landscape.\nKnowledge Graphs (KGs) have become essential tools across industries, with prominent examples including Google Knowledge Graph [1], DBpedia [2], and Wikidata [3].\nIn the public sector, initiatives such as the NIH Biomedical Translator program [4] aim to build a federated KG of biomedical knowledge to accelerate drug discovery, repurposing, and translational research from the lab to the clinic.\nThese efforts demonstrate the power of KGs to consolidate and structure vast amounts of information, enabling advanced search, reasoning, and data integration.\nHowever, existing KGs in commercial and research environments typically operate on acquisition timelines of weeks to months.\nThis cadence is inadequate for highly dynamic, time-sensitive decision- making environments, such as those encountered by military personnel, where insights are needed within seconds or minutes.\nIn commercial settings, KGs often function as a unified, authoritative source of truth, even if deployed across distributed infrastructures.\nHowever, military applications demand a different approach.\nOperational units, such as individual squadrons or organizations, must be able to construct, adapt, and customize their own KGs to address unique engagement scenarios.\nThis is particularly exacerbated if a unit needs to operate in a contested environment under degraded network conditions, such that even a unit’s KG may diverge from itself.\nThis decentralized need inevitably leads to the creation of multiple disconnected or partially aligned KGs, increasing the risk of information silos and fragmented knowledge.\nTherefore, if an interoperable approach is not addressed, even the best KG solution will become immediately useless.\nDeveloping a solution to support interactive and editable KGs that can handle the real-time complexity of a dynamic and evolving decision-making scenario while maintaining interoperability between organizational units presents several engineering challenges.\nThe core engineering and R&D challenges include: 1.\nLarge-Scale KG Management and Cognitive Burden: Current KG systems primarily focus on visualization and query mechanisms, which are essential but insufficient in highly dynamic environments.\nAnalysts and operators often need to directly manage, track, and modify the graph's content to maintain accuracy and relevance.\nThis manual process can become time- consuming and cognitively overwhelming, creating barriers to adoption in high-pressure environments where fast decisions are critical.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n2",
        "11": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 2.\nProvenance Tracking of User Changes: As KGs evolve, ensuring accountability and traceability of changes is essential for trust and usability.\nHowever, most commercial off-the- shelf (COTS) solutions lack robust provenance tracking, particularly at the user level.\nDeveloping a method to log manual edits, additions, and deletions is key to ensuring the graph's integrity and usability over time.\n3.\nFederated Knowledge Fusion: In military settings, individual units are likely to create, manage, and curate their own KGs tailored to their specific operational needs.\nHowever, critical insights and better situational awareness emerge when these distributed graphs are aligned and fused into a coherent operational picture.\nAchieving seamless integration and knowledge fusion among these federated KGs without sacrificing their local autonomy is a complex challenge requiring innovative alignment techniques and ontology management.\n4.\nReal-Time Knowledge Ingestion and Event Data Integration: In dynamic environments, the ability to ingest, process, and incorporate real-time data, such as event streams, is crucial.\nThis involves creating robust data pipelines that convert raw, tabular, or unstructured data into actionable knowledge that can be linked and queried within the KG.\nProper data labeling, ontology alignment, and event mapping are non-trivial problems that need to be solved to make real-time data useful for situational awareness.\n5.\nAI/ML-Enhanced Node and Link Prediction: To reduce users' manual burden, the system must incorporate AI/ML techniques that predict missing or relevant nodes and edges within the KG.\nThis capability will allow users to focus on critical tasks while the system offers meaningful suggestions for graph updates.\n6.\nScalability and Performance in Time-Constrained Operations: Military operations often involve time-sensitive scenarios where latency in knowledge retrieval or graph updates can impact mission success.\nEnsuring the system can perform efficiently at scale without compromising accuracy or functionality will be critical.\nThis requires optimizing the underlying graph architecture and the algorithms for query and update performance.\nOur team is well-positioned to address each of these challenges.\nTechnergetics has developed and matured the FuelAI Machine Learning (ML) data labeling platform, has integrated it with Team Awareness Kit (TAK) to process tactical data streams, and has deployed FuelAI to operational DoD networks for AF ISR use cases, addressing Challenge 4.\nAdditionally, Technergetics is developing the Army Tech Marketplace (ATM), which aims to become the “Research Intelligence Network” for Army researchers to participate in the innovation economy through dynamic connections to Government agencies, industry, and investors.\nATM R&D is implementing a recommender system to proactively predict potential KG relationships, addressing Challenge 5.\nFurthermore, Technergetics has the expertise and experience to optimize our solution for time- constrained operations and a proven track record of delivering solutions in such contexts, directly addressing the listed Challenge 6.\nSimage has developed the D-SPARK platform for the National Institute of Health (NIH), specifically addressing Challenges 1, 2, and 3.\nOur D-SPARK platform allows organizations to set up multiple KGs, automatically aligning and implementing a LinkML [5] data model, a human- readable and extendable open-source ontology solution, while operating in an inherently federated architecture.\nAdditionally, organizational users can edit and manipulate KGs in real-time with full provenance tracking through our RDF nanopublication model.\nThis enables robust tracking and Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n3",
        "12": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 efficient semantic reasoning while abstracting away the complexities of managing RDF statements and governing ontologies.\nIn this Phase 1 effort, our combined team will assess the feasibility of a software ecosystem that brings these solutions together, along with a deep alternative analysis of current SOTA methodologies in dynamic KG alignment and reinforcement learning (RL), to advance the development of an Interactive, Mutable, and Federated (IMF) KG solution for intelligence analysis, enhanced situational awareness, threat detection, and targeting operations.\n2.0.\nTechnical Objectives Objective 1: Knowledge Acquisition.\nCan we develop knowledge ingestion pipelines that allow users to ingest actionable data into respective KGs?\n➢ Key Result: Establishes a foundational KG tailored to the specific use case of an analyst or organization, reducing the manual burden of data entry and minimizing errors from hand- curated statements.\n➢ Measure of Success: Demonstrate the pipeline’s capability to process raw situational awareness data (e.g., sensor data, event information) and translate this data into an initial KG using our existing Situational AWareness Linked Data (SAWlink) ontology and FuelAI research.\nObjective 2: Knowledge Graph Versioning.\nCan we demonstrate a novel approach to track user KG modifications within an independent graph database to manage changes over time?\n➢ Key Result: Develop a federated KG version control platform that tracks KG state with a data version control system, with updates contextualized via a nanopublication framework for effective downstream predictive recommendations.\n➢ Measure of Success: Show enhanced capabilities for version control of KG states and establish a GovCloud nanopublication server for tracking contextualized analyst updates.\nObjective 3: Knowledge Refinement.\nCan we develop a Reinforcement Learning (RL) data collection approach to gather user changes to KGs and train a future KG recommender?\n➢ Key Result: Develop a prototype data collection methodology leveraging our nanopublication architecture to capture and structure analyst-driven KG modifications, creating a foundation for training KG refinement recommendations.\n➢ Measure of Success: Validate a prototype RL agent's ability to improve KG accuracy within a simulated environment using a KG generated from our acquisition pipeline (Technical Objective 1).\nObjective 4: User Experience.\nCan we design a user interface which provides users with methods to provide input to the KG, and knowledge managers with methods to manage user input and provenance for federated knowledge graph?\n➢ Key Result: Design a prototype user interface (UI) which provides effective interaction with the KG, while preserving the depth of contextual information provided by these features.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n4",
        "13": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 ➢ Measure of Success: Show ease of use in navigating and editing a federated KG through this intuitive, user interface and its associated visualizations to potential user and knowledge manager stakeholders.\n2.1.\nTechnical Approach and Feasibility Figure 1: KG Tracking and Versioning with Nanopublications, all user edits are published as nanopubs We propose to research and develop KnowFlow, an Interactive, Mutable, and Federated Knowledge Graph Environment (IMF-KGE), to address the DAF need for adaptive, interactive, and dynamic KGs.\nOur effort focuses on applying version control principles to manage dynamic mutations within the IMF-KGE.\nWith these principles in place, we can automate data ingestion, mapping, and recommendation features, while providing users with a streamlined user interface (UI) to interact with the IMF-KGE.\nThe result should be increased ML labeling efficiency, streamlined operational analytics, and knowledge collaboration to support “fight-tonight” readiness.\nTo accomplish this vision, our approach centers around research within four primary areas aligned with our technical objectives and depicted in Figure 1.\n1.\nResearch and design automatic data ingestion methodologies to translate tabular data stores into knowledge graph entries, specifically targeting situational awareness use-cases.\n2.\nResearch and design a KG version control system that tracks a federated KG state with data version control systems while maintaining rich context to support downstream recommendations tasks leveraging nanopublications.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n5",
        "14": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 3.\nResearch and evaluate SOTA approaches for automatic KG recommendations based on user modeling with RL as well as graph completion algorithms leveraging KG embeddings.\n4.\nAssess the viability of Cytoscape.js [1] for KG visualization and interaction mechanism once integrated with a viable KG version control system.\n2.1.1.\nScientific Feasibility In this section, we present an initial scientific feasibility assessment of three key research areas to demonstrate that our approach is well-supported by current trends in academic literature.\nSince Research Area 2, which focuses on KG version control, is primarily implementation-oriented rather than research-driven, our review will focus on the scientific literature relevant to Research Areas 1, 3, and 4.\nAligning and Converting Flat Tabular Data into Knowledge Statements One of the most common challenges organizations face with implementing KG-based solutions is that their data is not inherently organized in a graph structure [2].\nInstead, data typically resides in relational databases, CSV files, or Excel sheets, all of which must be transformed into knowledge triples (subject-relationship-object) to become useful within a KG.\nA study by Hofer et al.\n(2023) [3] highlights this challenge, noting the significant, often manual, effort required for schema alignment and custom data integration.\nThe authors point out that many organizations lack a unified schema, either across or within departments, which adds complexity to the harmonization process.\nDeveloping a schema from scratch is a cognitively demanding task, further complicating the adoption of KGs.\nMoreover, in the context of the semantic web, the limitations of tabular data formats become even more apparent.\nTabular data lacks intrinsic semantic content, making it difficult to automatically convert into meaningful graph structures.\nAs a result, attempts to transform tabular data or real- time data streams into graphs without sufficient semantic context often lead to degraded graph quality [4].\nThese challenges, along with frequent feedback from organizations using KG solutions, indicate a clear need for robust methodologies to transform existing data assets into foundational KGs.\nDeveloping a schema or ontology mapping solution appears to be the most promising path forward, providing a structured approach to harmonize disparate data sources and streamline KG construction.\nFor example, Wu et al.\n[5] argue that without an underlying ontology that organizes nodes and edges based on background knowledge of concepts, a KG system is essentially just a data graph.\nWhile establishing an ontological foundation is a barrier to KG adoption for many organizations, once an ontology or data model is in place, the problem becomes more tractable.\nA rich body of research supports the conversion of raw sensor data [6] and text data [7] into semantic web triples, as well as the development of full data acquisition pipelines [2] [8] [9].\nTo formalize this process, we define KG construction as follows: Key Definition 1: Knowledge Graph Construction.\nKG construction is a procedure, 𝑓, that maps a data source or data stream into a KG: 𝑓: 𝐷 × 𝑓𝑘(𝐷) → 𝐺 where 𝐷 is the set of data sources and 𝑓𝑘(𝐷) is an ontology or data model representing the target structure.\nIn our case, the SAWlink Model will serve as 𝑓𝑘 and significant progress has already been made in building this ontological model for situational awareness.\nSee Section 4.5 for a detailed introduction of our SAWlink Model.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n6",
        "15": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 With the KG construction problem well-defined, the function 𝑓 generally takes three primary forms: (1) named entity recognition and extraction, (2) event recognition and extraction, and (3) entity linking.\nEach of these methods has been extensively studied in the semantic web community and has found successful applications in systems like TransOMCS [10] and ASER [11].\nKG Recommendations via Embeddings, Graph Neural Networks, and Path-based Methods Recent advances in Knowledge Graph (KG) embeddings and deep learning demonstrate the feasibility of using Graph Neural Networks (GNNs) and embedding-based methods for KG recommendations [12] [13] [14] [15] [16].\nEmbedding-based approaches convert KG entities and relationships into continuous vector spaces, enabling more efficient manipulation and interpretation of graph elements for prediction tasks such as entity classification, link prediction, and recommendation systems.\nIn particular, recurrent knowledge graph embedding (RKGE) frameworks have been explored to integrate KGs with recommender systems, using pre-trained embeddings that represent KG elements in a latent vector space [17].\nBy incorporating these embeddings into a recommendation framework, it becomes possible to leverage relational patterns within the KG to inform recommendation processes.\nPath-based methods in KG recommendation systems utilize specific sequences of relationships, or “meta-paths,” to identify and recommend items based on their connections within the graph [16].\nIn a recommendation context, these meta-paths (e.g., user-item-user or user-item-category) enable the system to uncover patterns and relationships that link users to items in a meaningful way.\nBy following these paths, the system can suggest items that are likely to be relevant, based on how similar entities or users are connected to one another within the KG structure.\nTraditional path-based approaches often rely on manually designed meta-paths, which effectively capture domain-specific relational patterns [18].\nHowever, these manually constructed paths are labor-intensive to develop and can lack flexibility when applied to varied or evolving datasets.\nTo address these limitations, recent advances focus on using deep learning techniques to automatically identify useful paths.\nFor instance, [19] demonstrate that machine learning algorithms can dynamically discover optimal paths, enhancing recommendation accuracy without the need for extensive manual intervention.\nThese path-based methods not only improve recommendation relevance but also provide a transparent framework that reveals why certain recommendations are made, as they are based on explicit relational pathways within the KG.\nBy focusing on relationship patterns rather than standalone entities, path-based methods can dynamically adapt to new data in the KG, making them a valuable approach for building robust and contextually aware recommendation systems [20].\nFurther, recent research highlights the potential of combining KGs with Large Language Models (LLMs) to bridge structured and unstructured data [21, 22].\nBy aligning KG subgraph feature vectors with embeddings from unstructured data streams in latent space, it’s possible to integrate new knowledge into the KG.\nFor example, a Graph Convolutional Network (GCN) can aggregate features across connected nodes within a KG, while an LLM can extract semantic features from individual nodes.\nA hybrid approach could involve using the LLM for feature extraction at the Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n7",
        "16": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 Figure 2: Algorithmic approach to aligning novel unstructured data (e.g.\nwritten reports, mission briefs, news stories, user inputs, etc...) with nodes in the pre-existing KG.\nnode level and the GCN to capture the broader structural context across the KG.\nOn the data ingestion side, Language-Pretrained Models (LPTMs) like BERT, or multimodal models like CLIP, can convert unstructured data into vector embeddings that align with the KG’s vector space.\nAlthough, there are significant downsides to an approach based solely on LLMs for KG construction (see Alternative Technical Approaches section).\nThese techniques underscore the feasibility of our approach: leveraging GNNs, KG embeddings, and deep learning to develop a recommendation system that automatically suggests KG refinements.\nThrough these methods, we aim to achieve a dynamic KG that can evolve in response to new data, continuously enhancing situational awareness and analytic capabilities.\nKnowledge Graph Recommendations via Reinforcement Learning RL has become a cornerstone of AI research, achieving recent success in large language models (LLMs) like ChatGPT through a technique known as RL from Human Feedback.\nIn RL, an agent interacts with an environment, exploring potential actions and receiving rewards or penalties with the goal of maximizing cumulative rewards [23].\nAn RL problem is typically formulated as a Markov Decision Process (MDP), represented by a four-tuple (𝑆, 𝐴, 𝑇𝑎, 𝑅𝑎), where: • 𝑆 is the state space, representing all possible states of the environment in which the RL agent operates.\n• 𝐴 is the action space, where 𝐴𝑠 denotes the actions available from a given state 𝑠.\n• 𝑇𝑎(𝑠, 𝑠′) is the transition function, either deterministic or probabilistic, defining the likelihood that action 𝑎 at state 𝑠 at time 𝑡 will lead to state 𝑠′ at time 𝑡 + 1.\n• 𝑅𝑎(𝑠, 𝑠′) is the reward function, assigning a reward for transitioning from state 𝑠 to 𝑠′ as a result of action 𝑎.\nThe objective of RL algorithms is to find the optimal policy 𝜋, which specifies the action 𝜋(𝑠) that maximizes the expected cumulative reward from any state 𝑠.\nSolutions to this optimization problem generally fall into three categories: value-based methods, policy-based methods, and actor-critic methods.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n8",
        "17": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 A recent review by Huo et al.\n[24] examines the application of RL to four primary KG tasks: knowledge representation, extraction, fusion, and reasoning.\nKnowledge representation involves learning ontological structures or concepts either from raw data or from KGs with poor alignment.\nKnowledge extraction constructs KGs from structured (e.g., relational databases), semi-structured (e.g., tables, lists), or unstructured data (e.g., plain text).\nKnowledge fusion merges heterogeneous KGs or aligns different ontologies, while knowledge reasoning aims to infer new conclusions, correct errors, and identify gaps within the KG.\nWhile RL has proven successful across these areas, our research will focus on knowledge reasoning, as it will allow us to infer and suggest recommendations to analysts.\nSeveral methods have been published that leverage RL for tasks like inferring missing edges or answering specific queries by traversing paths within the KG, thus forming predictive connections between entities [25, 26, 27, 28].\nThese methods generally use graph traversal and rule-based logic to infer missing relationships.\nWhile we plan to incorporate these established techniques, we hypothesize that another approach could provide additional value.\nExisting methods focus on static, curated KGs, but if we consider a KG’s construction or editing history, a new sequential decision-making process emerges.\nWe believe that RL, particularly in the context of recommender systems, could be applied to the KG’s dynamic history through nanopublications that capture the KG’s evolution over time.\nLimited research exists on applying RL to the dynamic histories of KGs.\nHowever, there is substantial literature supporting RL’s utility in traditional recommender system settings [29].\nMapping the recommender system problem onto an MDP framework for KG recommendations is straightforward, where the analyst and the federated KG serve as the environment, and the MDP components are as follows: • 𝑆: A set of states defined by the analyst’s preferences and the KG change log.\n• 𝐴: A set of actions representing recommendations, such as nodes or edges to update (add, edit, delete).\n• 𝑇𝑎(𝑠, 𝑠′): The transition function encoding the probability of moving from 𝑠 to 𝑠′ if action 𝑎 is taken.\n• 𝑅𝑎(𝑠, 𝑠′): The reward assigned based on analyst feedback (e.g., accept or reject) in response to a recommendation.\nOur research aims to explore this RL-driven recommender system within the context of dynamic KGs, testing the feasibility of using analyst interactions and nanopublications to inform KG updates.\nGiven RL’s success in recommendation settings, we believe this approach could offer a powerful mechanism for continuous, user-guided KG refinement that adapts to new insights and evolving data.\nHuman Computer Interaction with Large Knowledge Graphs Recent research in human-computer interaction (HCI) highlights several challenges associated with visualizing and working with large graphs, including KGs and other types of graph data [30].\nFirst, many organizations, even small companies, deal with graphs containing billions of edges, creating significant scalability challenges.\nThe sheer size of these graphs often exceeds the limitations of current software, and although advances in graph databases have eased some of these issues, setting up and managing large-scale graph solutions still requires expert knowledge.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n9",
        "18": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 Visualization of large graphs presents additional hurdles, as scalability issues make navigation slow and cumbersome.\nGraph layouts frequently need recalculation, and users are often confronted with the “hairball” effect, where the visualization becomes an opaque, tangled mess.\nCreating a manageable visualization requires careful filtering to reduce complexity, often necessitating proficiency in a graph query language to apply meaningful filters that align with the user’s intended analysis.\nDespite these challenges, several open-source KG visualization tools are available that can handle large and dynamic graphs.\nFor instance, Cytoscape.js [1] is a widely used graph interaction and visualization tool, especially popular in large-scale life science and bioinformatics applications.\nIt has been successfully employed to visualize vast biomedical knowledge bases, such as Reactome [31], Pathway Commons [32], and Ensembl [33].\nCytoscape.js is also used by many Fortune 500 companies, including Amazon and IBM, as well as by universities and non-profits.\nOther open- source tools like Gephi [34] and Graphviz [35] offer alternatives but have more limited features and are, in our view, less extensible than Cytoscape.js, as they are not directly built as JavaScript libraries.\nGiven the success of these tools in large-scale domains, applying them to situational awareness KGs appears feasible.\nThe primary HCI challenge to address is abstracting away the complexity of graph query languages to enable users to create and interact with meaningful visualizations without encountering the “hairball” effect.\nDeveloping user-friendly interfaces and filtering options will be crucial to ensure the visualization aligns with users’ analytical goals while maintaining usability and clarity.\n2.1.2.\nData-to-KG Ingestion KGs are only as useful as the underlying data model supporting them.\nFor KGs to provide meaningful and actionable insights, the data feeding into them must be harmonized into a coherent, and structured model.\nFurther, if these KGs are to be dynamic, this data model must also be extendable over time.\nHowever, most organizations lack a unified data model across their curated datasets and especially their real- time data streams, creating a significant barrier to deriving actionable knowledge from a KG.\nWithout an initial alignment or fusion over these diverse data sources, any resulting KG may lack the consistency and relevance needed for real-time situational awareness use-cases.\nFigure 3: Data to KG Ingestion To circumvent this challenge, our approach beings with research and design efforts focused on first exploring viable solutions to automate this translation between flat, tabular data into structured KG entries.\nWe propose to extend Dagster as a basis for our Data-to-KG pipelines.\nDagster is an open-source data orchestrator for building, scheduling, and monitoring data pipelines.\nIt’s designed to help data engineers and data scientists manage complex workflows involving data ingestion, transformation, and analytics.\nWith Dagster, we can build (or extend) Python assets, and Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n10",
        "19": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 compose pipeline “graphs” to collect, transform, and ingest streaming data.\nOur approach is based upon successful implementations for the DoD; we have extended Dagster to import 700,000 entities and 1.4M relationships from open-source data sources to our ATM KG.\nFigure 4 is the Dagster visualization for our ATM ingestion pipeline for Federal Procurement Data System (FPDS) data, a publically contract available Government database.\nThis R&D could equip the DAF units with foundational KGs built from their existing data, minimizing the manual label of creating a KG from scratch.\nSuch foundational KGs could then serve as an immediate operational starting point, enabling organizations to leverage data they already maintain before adding more complex real-time data sources.\nWe have included a code snippet of the ATM FPDS Dagster ingestion function in Volume 5 of this proposal (KG-atm- dagster-code-snippet.pdf).\nFigure 4: Dagster FPDS Ingestion Pipeline to 2.1.3.\nKG Provenance Versioning with Nanopublications, Context, and Snapshots Our team has been developing an RDF nanopublication architecture track changes in mutable, federated KGs based on recent work in FAIR nanopublications for science [36, 37, 38].\nWhile our SAWlink model offers built-in provenance tracking making it possible to monitor changes directly within the KG itself, we opted to decouple these two frameworks for performance, scalability, and clarity of purpose.\nTracking every change and provenance detail within a KG would introduce significant complexity, making the graph cumbersome and ultimately impeding performance.\nThis separation ensures that the SAWlink model can remain lightweight and efficient for situational awareness tasks, while the nanopublication server provides a dedicated mechanism for managing and tracking edits.\nFigure 5: KG Versioning Subsystem query Our approach treats the nanopublication server as analogous to a git server, while the KGs represent the source code or files tracked by the server.\nHowever, unlike source code, knowledge graphs are highly dynamic and context-dependent, meaning that the sequence and purpose of Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n11",
        "20": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 changes carry just as much weight as the changes themselves.\nThis is where traditional event logs or change tracking systems fall short.\nSolutions such as Neo4j and Memgraph alone support change logs and event tracking, but these logs often lack the semantic context necessary to explain the “why” behind a change—much like commit messages in Git provide essential insight into a codebase’s evolution.\nTracking just the raw changes without capturing the rationale, assumptions, and goals behind each modification leaves the system blind to the intent of the users, creating cognitive load for analysts when they need to interpret the edits later.\nIn fast-moving operational environments, such as those involving threat detection or situational awareness for the DoD, this can become a critical bottleneck.\nAnalysts would have to manually piece together why a KG was updated, leading to inefficiencies and a lack of trust in AI-augmented workflows.\nThe nanopublication approach directly addresses these challenges by providing self-contained, contextualized “knowledge updates.” A nanopublication records not only what change was made (e.g., adding or removing an edge or node) but also why it was made and who made it, along with any supporting evidence or metadata.\nEach nanopublication contains the core subject-predicate- object triple along with provenance details, offering a concise but complete representation of the edit.\nThis modular structure supports semantic reasoning and traceability, making the KG evolution intelligible and actionable for both users and AI systems.\nFurthermore, our nanopublication architecture lays the groundwork for intelligent KG refinement workflows.\nBy aggregating nanopublications over time, we can identify patterns in user behavior and common edit paths, allowing the system to recommend future updates automatically.\nThis feedback loop between users and the system ensures that the KG continues to improve, becoming more accurate and relevant with each interaction.\nKG Snapshots to Ensure Data Integrity Our approach emphasizes a robust, DoD-compliant solution for version controlling the KG state, capturing snapshots of nodes, edges, and properties at designated intervals.\nBy integrating an open- source data version control system like lakeFS, we aim to create efficient, manageable “snapshots” that balance storage demands with data accuracy.\nThese snapshots act similarly to database backups, capturing the full state of the KG during key points in its evolution while maintaining manageable size constraints.\nTo accomplish this, we propose a snapshotting architecture analogous to a Git workflow, with KG merge requests (KG MRs) serving as a mechanism to periodically update the KG state.\nKG MRs allow for multiple nanopublications to be incorporated at once, ensuring that each update is contextualized with its own nanopublication metadata.\nThis structure offers a pragmatic trade-off, allowing us to manage the potentially large binary files that represent KG snapshots while still leveraging the modular functionality of nanopublications to maintain granularity.\nVersioning Process Artifacts to Ensure Data Integrity Within this architecture, version control is critical for maintaining data integrity across the KG’s lifecycle.\nBy treating each KG snapshot as a distinct artifact within the version control system, we can ensure that every modification is captured with historical context.\nThis level of versioning provides traceability, allowing analysts and operators to audit changes, revert to previous states if necessary, and confirm that the KG’s evolution aligns with mission requirements.\nThis approach Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n12",
        "21": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 also addresses data integrity concerns, offering transparency and accountability for each change introduced into the KG.\nGeneral Data Persistence The snapshotting strategy also addresses the broader challenge of data persistence.\nBy establishing intervals for capturing KG state, we avoid the overhead of continuous versioning while ensuring essential information is preserved for future analysis.\nThis approach supports long-term data retention policies by allowing specific KG versions to be archived in alignment with regulatory or mission-critical requirements.\nFurthermore, maintaining persistence through a structured snapshotting schedule ensures that data remains accessible and interpretable across shifts in technology and operational demands, supporting continuity in KG utilization.\nreal-time suggestions 2.1.4.\nKG Refinement Recommender System using RL and GNNs To enable continuous and adaptive updates to the KG or federated KGs, we propose a KG refinement recommender system that will provide for modifications based on two key modalities: (1) reinforcement learning (RL) applied to analyst nanopublication histories, and (2) pretrained graph embedding models that generate node and link predictions based on the current KG state.\nBy combining these approaches, we aim to loop where recommendations are initially derived from graph embeddings and presented to the analyst for review.\nEach recommendation, whether accepted or rejected, is recorded as a nanopublication.\nAs these nanopublications accumulate, the RL agent can learn from this feedback history to continually refine its recommendations, ensuring the KG remains relevant, accurate, and aligned with organizational needs.\nFigure 6: KG Recommendations and Prediction feedback establish a In this RS, we will model the decision-making process as an MDP with the following components: • 𝑆: A set of states (𝑝, ℎ, 𝐺, 𝑒) ∈ 𝑆 defined by a tuple of the analyst’s preferences 𝑝, the KG change log (analyst’s histories) ℎ, the current KG state 𝐺, and the current recommendations from the GNN embedding model 𝑒.\n• 𝐴: A set of actions representing recommendations.\nActions include accepting or ignoring embedding model suggestions, along with additional recommendations the embedding model might miss.\n• 𝑇𝑎(𝑠, 𝑠′): The transition function encoding the probability of moving from 𝑠 to 𝑠′ if action 𝑎 is taken.\n• 𝑅𝑎(𝑠, 𝑠′): The reward assigned based on analyst feedback (e.g., accept or reject) in response to a recommendation.\nDue to the large state space defined by the tuple (𝑝, ℎ, 𝐺, 𝑒) we plan to use deep Q-learning as our initial RL approach, supported by evidence of its effectiveness in handling high-dimensional state spaces.\nSelecting appropriate embedding models will also be critical.\nWe will explore publicly Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n13",
        "22": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 available graph embedding models on platforms like Hugging Face and fine-tune as necessary to optimize their relevance for our application.\nFor validation, we will set up a simulated training environment using our data-to-KG ingestion pipeline (Section 2.1.2).\nThis will generate an initial KG from real-world, SAWlink-aligned data, representing situational awareness use cases common to intelligence analysts.\nWe will then design reward functions to mimic different analyst behaviors, such as: • Maximizing Graph Completeness: Rewarding the RL agent for completing as many relevant connections as possible.\n• Minimalist Focus: Rewarding the agent for reducing the graph to a subgraph of critical relations most relevant to the analyst.\nThese workflows can be encoded within the MDP reward function, allowing us to test and refine the RL agent’s adaptability across different decision-making scenarios.\nFinally, we will run deep Q-learning to optimize the RL agent’s policy, adjusting the embedding model as needed to achieve an optimal policy under these simulated scenarios.\nTo assess the effectiveness of the KG refinement recommender system, we will focus on two primary metrics: 1.\nAverage Reward Convergence: By observing the RL agent’s reward patterns over time, we can determine how effectively it learns to optimize its actions in alignment with the ground truth KG.\nConvergence on a high average reward would indicate that the agent has successfully internalized a policy for generating accurate and valuable recommendations.\n2.\nPractical Utility of Recommendations: Beyond reward convergence, the true value of the recommender system lies in its ability to provide actionable insights that enhance situational awareness.\nWe will evaluate the utility of the agent’s recommendations in simulated scenarios, measuring how well they align with real-world analyst needs and contribute to improved decision-making.\nThrough this iterative process of data collection, training, and evaluation, the KG refinement recommender system can develop a robust understanding of KG maintenance needs, enabling it to feasibly adapt to new data sources and evolving situational contexts.\nBy capturing and structuring analyst interactions via nanopublications, we can create a feedback loop that ensures the system’s recommendations remain relevant and continually improve over time.\nThis approach positions the recommender system as an integral component for maintaining the KG’s integrity and operational value across diverse scenarios.\nA key consideration when building an operational recommender system will be mitigating the bias of the recommendations.\nAs one of the primary data sources in an RS is human interactions, both explicit and implicit, biases are bound to arise.\nMuch work has been done to understand sources of bias in recommender models [39].\nPotential sources of bias include popularity bias, position bias, selection bias, and temporal bias.\nFor example, popularity bias occurs when a handful of items receive the most user interaction, resulting in these items being recommended more frequently than other, less popular items.\nTraining methods such as introducing regularization terms have been shown to alleviate popularity bias in modern RS [39].\nCumulatively, these biases can lead to low-quality recommendations, unfair promotion of certain items, and an unsatisfactory Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n14",
        "23": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 user experience.\nBy considering these potential factors, we can achieve both more performant models and more fair and equitable models that can prevent unwanted consequences in our system, such as intelligence product/source preference.\n2.1.5.\nKnowledge Graph Visualization Figure 7: Interactive Knowledge Graph Visualization Concept Designing knowledge graph visualization requires a balance of clarity, interactivity, and scalability.\nNodes and edges should be distinct, with colors, shapes, or sizes representing different entities and relationships, while keeping labels minimal to avoid clutter.\nScalability can be achieved with techniques like progressive loading, clustering, and filters, allowing users to explore complex graphs in layers.\nInteractivity—such as zoom, pan, tooltips, and highlighting paths—lets users engage dynamically, and node selection helps focus on specific details without overwhelming the display.\nFor larger graphs, layout is essential to maintain readability, positioning nodes logically to reflect importance or connection strength.\nAesthetic choices, like minimalism, dark mode, and a consistent color scheme, enhance user experience by reducing visual strain, while responsive design and accessibility ensure usability across devices and for all users.\nClear navigation aids like breadcrumbs or mini maps help users orient within complex graphs, while context tools like lineage indicators can add transparency.\nIn essence, a well-designed knowledge graph visualization organizes complex relationships intuitively, making large datasets both informative and user-friendly.\nIn addition, it will be necessary to provide effective visualization of user updates that have been drafted to the federated KG.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n15",
        "24": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 During our past performance on similar tasks, we assessed multiple design systems for specific user interaction requirements.\nAs a result of these assessments which considered the costs/benefits in producing effective UIs for similar requirements, we recommend the Tailwind UI design system.\nTailwind UI is a collection of professionally designed, responsive UI components built with Tailwind CSS.\nIt offers pre-built components like buttons, forms, and navigation elements that are fully customizable using Tailwind’s utility classes, enabling rapid development with a consistent, polished design.\nTailwind UI’s flexibility allows developers to adapt each component to match their unique style, making it a great choice for web applications that need quick, visually appealing, and scalable interfaces.\nAdditionally, Tailwind CSS’s utility-first approach keeps code maintainable, responsive, and lightweight, ideal for building modern, mobile-friendly applications.\nIn addition to Tailwind UI, we recommend analyzing Cytoscape [1] to visualize our proposed IMF-KGE.\nOriginally developed for biological research, Cytoscape is open-source, and is widely used for visualizing molecular interaction networks, biological pathways, and genetic data.\nIt has since evolved to support a wide range of network analysis applications, including social networks, transportation networks, and more.\nCytoscape.js, Tailwind UI, and the React Javascript library are foundational open-source frameworks which can accelerate the development of a prototype capability for DAF.\nFigure 7 presents a concept that can be achieved with our approach presented.\n2.2.\nAlternative Technical Approaches KG Construction from Raw Text via Commercial Large Language Models (LLMs) While commercial LLMs like GPT-4 and ChatGPT show remarkable capability in natural language processing tasks, recent research highlights substantial limitations when directly applying them to KG construction, particularly without a well-defined ontological framework.\nZhu et al.\n[22] GPT-4 and ChatGPT underperformed compared to benchmark non-LLM methods on core KG tasks such as entity, relation, and event extraction.\nSimilarly, Gao et al.\n[40] LLMs struggled with event extraction, trailing behind task-specific models that use sequence-to-sequence and BERT-based methods.\nThese findings illustrate a key issue: while LLMs are adept at generating coherent, contextually appropriate text, they often lack the precision and structure required for effective KG construction from raw text.\nA primary drawback to using commercial LLMs for KG construction lies in their broad, generalized training.\nCommercial LLMs are designed for versatility across many language tasks rather than optimized performance in highly specialized applications.\nAs a result, they may introduce ambiguities or inaccuracies when tasked with identifying and structuring complex relationships in domain-specific data.\nThis is particularly concerning in fields like situational awareness, where KGs must be precise and reliable.\nFurthermore, the absence of a robust ontological framework exacerbates these issues.\nLLMs can produce inconsistent or contextually irrelevant entity and relationship mappings without a guiding ontology.\nAn ontology like SAWlink provides the necessary structure, ensuring that data is organized and interpreted within a consistent framework that aligns with the operational goals of situational awareness.\nWithout this framework, reliance on LLMs for KG construction could result in fragmented or contradictory information that lacks coherence and utility.\nIn contrast, traditional task-specific models that leverage established ontologies offer better control over entity and relationship definition, ensuring the resulting KG is accurate and contextually Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n16",
        "25": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 relevant.\nAlthough commercial LLMs may contribute to specific tasks within the KG pipeline, such as enhancing searchability or generating human-readable summaries, their direct use for KG construction remains problematic without foundational ontological support.\nOur approach, therefore, focuses on integrating these LLM capabilities selectively and coupling them with SAWlink’s robust ontology to ensure the KG retains both structural integrity and operational relevance.\n2.3.\nTechnical Risk Mitigation Phase I Risk Will a suitable Knowledge Graph (KG) be available for Phase I R&D?\nWill there be enough relevant data?\nHow can we mitigate Recommender Bias?\nWill KnowFlow be compatible with DoD networks?\nPhase I Mitigation Technergetics and Simage are actively developing the SAWlink model for AFRL, which is desirable for the Phase I effort.\nThis allows the research team to begin R&D on day 1, rather than relying on the Government to provide a relevant KG.\nMore relevant data is always desirable for operational success.\nHowever, our research will be successful based upon available datasets and simulations as described in this proposal.\nTo address recommender bias, we will implement recent research techniques, such as feedback-loop correction and diversity-promoting algorithms.\nThese methods will ensure that user feedback does not disproportionately influence future recommendations.\nAdditionally, we’ll introduce a periodic auditing process to identify and correct that representative, and recommendations aligned with diverse user needs.\n[41].\nTechnergetics will develop DoD-ready software based on experience deploying multiple software applications to DoD Platform One, DAF CLOUDWorks, BESPIN, and AF Cloud One.\nemerging remain biases, fair, ensuring any 3.0.\nPhase I Statement of Work Outline 3.1.\nScope The scope of this effort is to establish the KnowFlow software proof of concept and will assess the feasibility of different approaches to allow for user modifications to a dynamic Knowledge Graph (KG).\nResearch will be conducted into novel methods to predict additional changes to the graph based on the user's input.\nThis effort will also research version control principles to manage dynamic KG updates by users.\nAdditionally, we will design a streamlined user interface (UI) to interact with the dynamic KG environment applying best-practice HCI principles.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n17",
        "26": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 3.2.\nTask Outlines 3.2.1.\nMilestone 1: Kickoff Presentation to Government Stakeholders Within 30 days of the contract award, we will provide the Government with a project kickoff presentation that outlines the project plan and introduces the project team.\nFeedback from stakeholders will be collected and R&D action items will be documented.\n3.2.2.\nMilestone 2: Demonstrate Data Ingestion Pipeline KGs are only as useful as the underlying data model supporting them.\nFor KGs to provide meaningful and actionable insights, the data feeding into them must be harmonized into a coherent and structured model.\nThis task will extend our data pipeline architecture and demonstrate a prototype for automated translation between flat, tabular data into structured KG entries.\n3.2.3.\nMilestone 3: Demonstrate KG Nanopublications and Version Control This task will research a proof-of-concept architecture which can track and manage changes to mutable and federated KGs, akin to source code version control systems (e.g.\nGit).\nOur recommended nanopublication approach provides a loosely coupled provenance trail of contextualized knowledge updates to support downstream recommendation tasks.\nKG versioning provides traceability, allowing analysts and operators to audit changes, revert to previous states if necessary, and confirm that the KG’s evolution aligns with mission requirements.\n3.2.4.\nMilestone 4: Present Knowledge Graph Recommender R&D This milestone will focus on researching and designing a KG refinement recommender system that provides adaptive suggestions for KG modifications.\nWe will explore simulated scenarios within a RL framework, incorporating pretrained open-source graph embedding models to generate initial node and link predictions.\nOur goal is to validate the architecture in a controlled environment, laying the groundwork for potential future applications in real-world contexts.\nEvaluation will focus on two primary metrics, as outlined in our technical approach, to measure the system's effectiveness across two simulated user behavior models: maximizing graph completeness and focusing on critical relations.\n3.2.5.\nMilestone 5: Design and Present User Interface Prototype Designing interactive knowledge graph visualization(s) requires a balance of clarity, interactivity, and scalability.\nThis task will focus on designing dynamic knowledge graph visualization(s) that intuitively organize complex relationships, provide insights into federated KG changes happening in the environment, and make large datasets informative and user-friendly.\nThis design will feature user interface components that make interactions with the KG version control system straightforward.\n3.2.6.\nMilestone 6: Final Phase I Technical Report We will provide a final Phase I demonstration summarizing the R&D performed in these task areas.\nWe will also deliver a final technical report on the progress made during this effort.\nThis task focuses on preparing and presenting the final demonstration, as well as the compilation of the final technical report.\nFinal artifacts to be delivered may include software mock-ups, software roadmaps, presentations, and a prioritized task list of potential features for Phase II applications.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n18",
        "27": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 3.3.\nMilestone Schedule and Deliverables Table 1: Milestones for KnowFlow: IMF-KGE Phase I Milestone Schedule Timeframe Objective Deliverables Milestone 1 – Develop and Deliver Kickoff Presentation with Government Stakeholders Award + 30 Days Objective All Progress Report Milestone 2 – Demonstrate Data Ingestion Pipeline Award + 60 Days Objective #1 Progress Report Demonstration Milestone 3 – Demonstrate KG Nanopublications and Version Control Milestone 4 – Present Knowledge Graph Recommender R&D Milestone 5 – Design and Present User Interface Prototype Milestone 6 – Final Phase I Technical Report Award + 90 Days Objective #2 Progress Report Demonstration Award + 150 Days Objective #3 Progress Report Demonstration Award + 120 Days Objective #4 Progress Report Demonstration Award + 180 Days Objective All Final Report 3.3.1.\nProgress Reports Progress reports are due monthly at a minimum.\nThey shall be concise documents describing progress in meeting end-user needs.\nEach status report shall be no longer than 3 pages and/or 10 slides.\nThe status reports shall include progress toward Phase I objectives and key results.\n3.3.2.\nFinal Report with SF 298 The Phase I final report is due upon completion of the technical effort.\nIt shall be submitted via email to the cognizant AF Contracting Officer.\nThe first page of the final report will be a single- page project summary, identifying the work’s purpose, providing a brief description of the effort accomplished, and listing potential result applications.\nPhase I report will also describe the technology and anticipated applications/benefits for Government and/or private sector use.\nFinal Report will include SF 298, \"Report Documentation Page,\" with the first sentence reading, \"Report developed under SBIR contract for topic “Department of Defense (DoD) SBIR 2024.4, Topic Number AF244-0001”.\nThe abstract will identify the purpose of the work and briefly describe the work conducted, the findings or results, and the potential applications of the effort as outlined by applicable guidance.\n4.0.\nRelated Work Technergetics possesses extensive expertise in developing Machine Learning (ML) software solutions, and data analysis solutions which leverage Knowledge Graphs to interrelate data in a way that makes it easily accessible, interpretable, and usable.\nWe regularly navigate DoD software accreditation requirements and have deployed multiple software applications to DoD networks.\n4.1.\nImproved Data Collection and Knowledge Graphing in the TAK Ecosystem Collecting and organizing sensor data from tactical mobile devices is crucial for creating accurate and context-aware machine-learning models that can run efficiently and securely on the devices.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n19",
        "28": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 This data provides the foundation for training and fine-tuning models tailored to specific missions and their unique environments.\nHowever, this data only becomes actionable when harmonized across devices, users, and organizations.\nTo achieve this, we developed the SAWlink Model, which offers TAK stakeholders a unified source of truth for defining labels and context within a flexible, easily extendable ontology.\nThis model enables advanced knowledge graph reasoning over previously flat and disorganized feature labels, enhancing TAK decision-making capabilities.\nFigure 8: FuelAI Supports Predicate Labeling with SAWlink Ontologies Figure 9:FuelAI Custom Ontologies Extend SAWlink for TAK Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n20",
        "29": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 We have realized impressive capabilities in this effort with FuelAI and SAWlink, which relate to the requirements in this solicitation.\nSAWlink is the new upper ontology in FuelAI geared toward situational awareness use cases.\nA new ontology collaboration system provides an interactive way to tailor the ontology to a specific labeling effort while maintaining links to the primary SAWlink ontology as a single source of truth across the platform, aiding in data discovery (see Figure 9).\nSAWlink is digested in FuelAI by interpreting the YAML file containing FuelAI configuration elements, including label definitions/descriptions, prefix mappings, predicates, etc.\nFuelAI now uses SAWlink predicates for annotating relationships between labels, adding contextual depth to our training data (see Figure 8).\nThis allows for a dynamic rendering of the ontology and flexibility in handling future/other versions of the ontology.\n4.2.\nArmy Tech Marketplace (ATM) Figure 10: Army Tech Marketplace Web Application Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n21",
        "30": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 Technergetics is the prime contractor for the ATM Phase II SBIR.\nATM is an Innovation Research Intelligence (RI) Platform that offers a unique and engaging experience for Army researchers and innovators.\nATM’s goals are to 1.\nconnect the Army with the innovation economy and 2: facilitate a greater awareness of innovation (e.g., structured knowledge).\nThis R&D focuses on developing the ATM KG to allow the system to describe relationships between innovation entities from various input sources.\nATM has transformed 700,000 entities and 1.4M relationships from open- source data sources to our ATM KG.\n4.3.\nFuelAI: Data Labeling Platform for Training AI/ML Algorithms Video: FuelAI Introduction on YouTube FuelAI is our operational web-based data-annotation tool, built to DoD requirements, and does not entail software licensing costs.\nSince 2020, FuelAI has been used to create training datasets for DAF AI model development, for mission-critical use for Automated Target Recognition (ATR) for military drones/Unmanned Ariel Vehicles (UAV) and Battle Damage Assessment (BDA).\nFuelAI features DoD-procured enhancements to efficiently train computer vision (CV), natural language processing (NLP), and audio models; over 6M data labels are available and are increasing daily.\nFuelAI is now the preferred data-annotation tool for the DAF Chief Data and AI Office (CDAO) to build its inventory of AI data.\nFuelAI has a Certificate to Field (CtF) and Authority to Operate (ATO) and is actively used for DoD missions on the Joint Worldwide Intelligence Communication System (JWICS) and SIPRNET.\nFuelAI has contributed to countless ML model training projects over the last five years.\n4.4.\nWingmanAI: AI Algorithm Marketplace, Evaluation, and Deployment Platform Video: WingmanAI: Introduction on YouTube State-of-the-art (SOTA) moves quickly for AI models, as evident in the recent progress achieved for Large Pre-Trained Models (LPTMs).\nTraditional DoD acquisition cannot respond quickly enough to test, validate, and onboard SOTA models for operational use cases.\nWingmanAI, a license-free web-based AI model marketplace, like HuggingFace.\nAnother application based upon our Modellum framework, WingmanAI, is a web application that addresses this deficiency where model developers can introduce vulnerability-mitigated models to the DoD market in the security domain of their choice.\nIn parallel, operational users define use cases where AI may benefit the platform.\nFrom there, rapid collaboration occurs between model developers and operational users to validate models on representative operational data for the defined operational use cases.\nUltimately, WingmanAI streamlines the rapid acquisition of AI models while remaining accountable to the operational requirements that justify the acquisition, providing transparency for DoD stakeholders.\nWingmanAI is available on JWICS for AI mission support in operational ISR missions.\n4.5.\nThe SAWlink Model The SAWlink Model is a data model designed to organize events, labels, and assets (e.g., videos, images) to support KG-based Situational Awareness (SAW) applications.\nThis model acts as a bridge, integrating disparate ontological domains and heterogeneous data sources under a unified structure.\nSAWlink builds upon many of the foundational concepts first developed for Biolink, adapting them to meet the needs of the situational awareness domain.\nThe Biolink Model [42] is a Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n22",
        "31": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 linked data framework also leverages the Linked Data Modeling Language (LinkML) [43] to harmonize biomedical knowledge.\nThe SAWlink Model is organized into an upper ontological hierarchy composed of defined classes, properties, predicates, and associations (see Table 2 for examples and descriptions of these elements).\nKnowledge aligned with the SAWlink model is represented as a set of associations, analogous to Web Ontology Language (OWL) [44] axioms and Resource Description Framework (RDF) statements.\nEach association captures a predicate relationship (a SAWlink model predicate) between a subject and object (SAWlink model classes), forming a core triple.\nAn example of such an association is shown in Figure 11.\nThe subject and object of each association represent instances of concepts defined explicitly in the SAWlink model, such as events, vehicles, or people.\nTheir Internationalized Resource Identifiers (IRIs) are sourced from widely adopted ontologies (e.g., WikiData, DBpedia, Sapient), ensuring that the model remains both extensible and interoperable with community standards.\nAdditionally, associations include slots for capturing supplementary metadata, such as provenance or evidence supporting the assertion, further enhancing the model’s utility for tracking and validating information.\nTable 2: SAWlink Model elements, definitions, and examples SAWlink Model Element Definition Class Predicate Node Property Edge Property Core Triple Association High-level categories representing core concepts of interest to situational awareness such as events, people, places, things, etc., arranged in a class hierarchy.\nExample sawlink:Event, sawlink:Vehicle, sawlink:Weapon Objects that define the action being carried out by the subject on the object of the core triple and define how these two classes are related to each other.\nsawlink:related_to, sawlink:affects, sawlink:contains A set of attributes that can be regarded as a characteristic or inherent part of an instance of a Named Thing (e.g., sawlink:NamedThing) A set of attributes that can be regarded as a characteristic or inherent part of a statement, association, or edge.\nsawlink:name, sawlink:latitude, sawlink:longitude sawlink:qualifier, sawlink:timepoint, The domain knowledge of an association expressed by the subject and object nodes and the predicate connecting them together.\nsawlink:has_evidence sawlink:Video sawlink:contains sawlink:Event Classes that define a relationship between two domain concepts, constrained and qualified by edge attributes.\nsawlink:VideoToEvent, sawlink:AudioToEvent Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n23",
        "32": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 Type A kind of value that tells what operations can be performed such as strings or integers, but can be extended to custom types like quotient or unit.\nURI, CURIE, string, integer, sawlink:Quotient, sawlink:Unit The SAWlink model addresses several key challenges that currently hinder, or may eventually obstruct, the interoperability of KG solutions designed for situational awareness: 1.\nThe need for expertise to transform data between tabular, RDF, and graphical models.\n2.\nInconsistent application of ontologies or taxonomies at the organizational unit level, along with variations in the identifiers used to store node instances within a KG.\n3.\nThe lack of a standard approach to model the intersection of ontological domains and data labeling tasks, such as relationships between information assets (e.g., videos, images) and the events these assets contain or share.\nFigure 11: (a) Shows the Association architecture of a SAWlink association.\nFirst, a subject class and object class are related to one another via a predicate class forming the “core triple” or statement in the KG.\nThis is further wrapped into an association class with the inclusion of metadata about the core triple such as publication denoting evidence of the assertion or other types of provenance.\n(b) An instantiated example of a situational awareness use- case in which a Video asset contains a certain type of event.\nA key advantage of the SAWlink model is that it builds upon the LinkML framework, allowing it to be distributed in a variety of formats, including YAML, JSON-Schema, Python/Java Data Classes, and RDL.\nThis flexibility makes the model accessible to a broad range of developers and database engineers working in government, academia, and private industry.\nAdditionally, the model can be visually represented through Unified Modeling Language (UML) diagrams as seen integrated with FuelAI in Figure 9.\nBy leveraging LinkML, model elements in SAWlink can be validated using existing toolchains such as JSONSchema validation and SQL constraints, accelerating alignment between tabular data, ontologies, and KGs.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n24",
        "33": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 One common issue in ontology development, particularly within large organizations or even individual units—is the creation of multiple, overlapping ontologies for the same domain.\nFor example, the SAPIENT specification [45], developed by the UK to standardize AI and autonomy in networked multisensory systems, defines a controlled taxonomy with significant overlap with other situational awareness ontologies [46, 47, 48].\nThis creates a dilemma for KG developers: Which ontological concepts should I use?\nThe problem becomes even more challenging when dealing with lower-level ontologies, such as those defining vehicle models or personnel unit callsigns.\nDevelopers must determine which vocabulary is most appropriate while also ensuring that concepts from the chosen ontology are applied correctly to class instances.\nDefining a SAWlink Model class involves directly specifying the class’s id_prefixes construct.\nThis design encourages the reuse of existing ontologies while remaining flexible enough to incorporate new ones on the fly by simply adding an additional prefix.\nIn this way, SAWlink functions as an upper-level ontology, governing the overarching, shared, and abstract concepts within the situational awareness domain that are unlikely to change over time (e.g., sawlink:Event, sawlink:Truck).\nAt the same time, it leaves more specialized, lower-level cocepts to be managed by domain-specific ontologies (e.g., dbr:Ford_F_series from the DBpedia ontology).\nFor example, for a city class, the SAWlink model currently recommends using dbr (the DBpedia Resource ontology) as the preferred vocabulary for city instances.\nAdditionally, each element in the SAWlink model is mapped, where applicable, to equivalent elements from other ontologies or models.\nThese mappings leverage terms from the Simple Knowledge Organization System (SKOS) namespace to describe relationships between SAWlink elements and external concepts, indicating whether the relationship is exact, broad, narrow, close, or related.\nThese mappings enhance computability and interoperability, enabling the automatic harmonization and integration of disparate data sources, which makes the model and its derivative KGs more connected and functional.\n4.6.\nD-SPARK: A Versatile Platform for Knowledge Discovery and Situational Awareness Originally developed as GenNIFER at Dartmouth College by Dr.\nChase Yakaboski, the Discovery- Support Platform for Accelerating Research and Knowledge (D-SPARK) began as a Gene Regulatory Network (GRN) analysis tool in collaboration with the NIH NCATS Translator Program (NIH award OT2TR003436).\nOver time, the platform was expanded to become a flexible tool for broader data science applications.\nD-SPARK provides customizable discovery-to-knowledge pipelines and built upon a federated knowledge graph hosting architecture, allowing multiple KGs to be integrated and managed sim to support knowledge visualization, and analysis.\nIt also supports the design and implementation of LinkML-based data models, like SAWlink, to provide structured, domain-specific knowledge representations that align with a user’s ontological needs.\nThe platform also features a user- friendly interface with Cytoscape-based visualizations and an iterative search API, enabling users to explore data-driven insights and overlay analytical results with KG-informed knowledge.\nIn partnership with Technergetics, D-SPARK has been adapted for the TAK data collection effort, leveraging its federated architecture and flexible data modeling capabilities to integrate TAK data streams within customized situational awareness KGs.\nThis evolution from NIH-inspired origins to situational awareness demonstrates D-SPARK’s scalability and relevance for dynamic, large- Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n25",
        "34": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 scale data environments, supporting complex data alignment and exploration across interconnected KGs.\nFigure 12: Evolution from NIH inspired GenNIFER to conduct GRN analysis to DSPARK a more general framework to translate data into actionable knowledge.\nShown is integration with the SAWlink ontology over a sample situational awareness use case.\n5.0.\nRelationship with Future Research or R&D This R&D relates directly to our potential Army Tech Marketplace (ATM) Phase II-B FY26 R&D effort; however, the potential for future R&D extending this innovation is nearly endless.\nOrganizations face significant challenges in managing, analyzing, and deriving actionable insights from vast, complex datasets as data generation expands across diverse sources- social media, IoT devices, and digital platforms.\nSemantic knowledge graphs offer a robust solution by organizing and structuring data to facilitate advanced search, discovery, and insight extraction.\nTheir structured, interconnected data representation is highly compatible with AI and machine learning advancements, serving as valuable input for model training and improving AI-driven capabilities.\nThe rapid increase in internet traffic further accelerates the demand for semantic knowledge graphing.\nAs more people and devices connect online, data volume grows exponentially, often in unstructured formats that hinder traditional data management and analysis.\nSemantic knowledge graphs address these challenges by organizing data into graph structures representing relationships between disparate data points, enabling more efficient data analysis, insight generation, and informed decision-making.\nThis explosion of online data also heightens the need for personalization and targeted recommendations.\nSemantic knowledge graphs create a unified, multidimensional view of individual users by integrating data from various sources—browsing history, social media Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n26",
        "35": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 interactions, and purchase patterns—enabling precise recommendations, personalized marketing, and tailored user experiences.\nMoreover, the growing adoption of IoT further emphasizes the need for semantic knowledge graphs.\nAs many devices generate real-time data streams, semantic knowledge graphs facilitate integrating and analyzing these IoT data sources, yielding more profound insights and enhancing decision-making capabilities across connected system 6.0.\nCommercialization Strategy Technergetics' strategy for the technology offers opportunities for DoD and non-DoD customers to optimize product revenue.\nA key differentiator between the two customer markets is that DoD customers will receive data rights developed within this effort.\nThis benefit will reduce the barrier of entry for the DoD.\nIn the commercial sector, semantic knowledge graphing technologies are finding applications across multiple sectors—including healthcare, media and entertainment, financial services, e-commerce, and manufacturing—where they enhance operational efficiency, reduce costs, and deliver tailored experiences to end users.\nOur strategy for commercializing this applied R&D involves pursuing transition paths for military and commercial applications; our commercialization strategy addresses the following questions: (1) What is the first product planned to incorporate the proposed technology or R&D?\nFuelAI, the Army Tech Marketplace (ATM), and Team Awareness Kit (TAK) are the first products planned to incorporate the proposed technology.\n(2) Who are the probable customers, and what is the estimated market size for this technology?\nWe envision the Intelligence Community (IC) becoming our early adopters.\nThe global commercial knowledge graph market is experiencing significant growth, driven by the increasing need for efficient data integration and management solutions.\nIn 2022, the market was valued at approximately USD $1.3B and is projected to reach USD $3.6B by 2030, reflecting a compound annual growth rate (CAGR) of 14.2% [49].\nThese projections underscore the growing adoption of knowledge graphs across various industries, including healthcare, finance, and e-commerce, as organizations seek to harness complex data relationships for enhanced decision-making and operational efficiency.\n(3) How much money is needed to bring this technology to market and how will it be raised?\nThis product is anticipated to be ready for a customer introduction campaign by the end of the Phase I feasibility study and follow-on Phase II R&D effort.\nThis campaign will engage DoD customers, and potentially customer customers, for applications of this platform.\nFunds will be raised through venture capital investment if required.\nThis product is anticipated to experience customer market sustainability when funding totals $3-4M.\n(4) Does your firm have the necessary marketing expertise, and if not, how will your firm compensate?\nTechnergetics was established in 2013 and boasts a workforce of over 70 employees.\nOver the past five years, Technergetics has garnered an impressive $39.9M in contract awards and has successfully commercialized SBIR technology.\nThese efforts include two Phase III contract vehicles with a $198M contract ceiling open until 2027, accruing over $10.4M in allocated Task Orders.\nMoreover, Technergetics has two AI-based applications that have been daily fixtures in operational DoD environments, generating recurring annual income for the company for the last five years.\nWith a solid financial track record spanning 11 years, Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n27",
        "36": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 Technergetics is a trusted DoD software partner.\nTechnergetics' success as a small business requires senior-level staff to perform multiple job functions, including product development, advocacy, and business development.\nOur company is structured as an innovative software/hardware company committed to positively transforming our customers operations with technology.\nOur team's diverse experience in the commercial product markets, leading large DoD contracts, and relationship building will prove helpful in jumping-starting the marketing strategy.\nTechnergetics is now fortunate to have Mr.\nKevin Brown leading our business development and customer engagement corporate capability.\nMr.\nBrown is a 25-year retired DAF CMSgt Veteran who held strategic logistics leadership positions in all 9 Major Commands (MAJCOMs) and served as Air Transportation career field MAJCOM functional lead twice.\nHe has experience in military policy at the DAF and DoD levels and is experienced in translating change management and innovation adoption across multiple career fields.\nHe is adept at translating strategic goals into achievable team tasks and milestones and has verified experience developing over 18+ innovation software/hardware solutions for both DoD and commercial markets.\nMs.\nAlisa Ferrara is our Creative Director and oversees product design and company-wide marketing initiatives.\nShe is an experienced visual and concept designer with 15+ years of experience across various industries.\nHer background is heavily in graphic design, video production, and all things marketing.\nTechnergetics’ founder, Mr.\nRobert Harrod, has a diverse background in the defense and commercial sectors.\nMr.\nHarrod has led the development of multiple successful hardware/software platforms, focusing on workflow standardization, tactical situational awareness and sensors, mobile device platform architectures, artificial intelligence/machine learning tools, and edge applications.\nMr.\nHarrod is a subject matter expert in various programming languages, as well as has extensive knowledge in Platform as a Service (PaaS), Infrastructure as a Service (IaaS), and Infrastructure as code (IaC).\nMr.\nHarrod also has qualifications in the transition processes required to meet requirements for the Risk Management Framework (RMF) and to achieve a CtF and ATO.\nMany of the solutions engineered by Mr.\nHarrod and his development teams have enabled analytics, visualization, and advancements in human-machine decision-making to aid in measuring mission effectiveness and future mission planning.\nMr.\nHarrod’s technical and management experience spans nearly two decades of successful client delivery of software/hardware platforms and cutting-edge research and development, supporting many highly important research programs across the DoD, DAF, and AFRL.\n(5) Who are probable competitors, and what price/quality advantage is anticipated by your firm?\nStardog Union, and their Enterprise Knowledge Graph Platform (Stardog) is likely the most formidable small business competitor in this space.\nStardog is built upon a proprietary technology stack on top of the proprietary DataBricks platform, as opposed to our approach, which leverages open-source, SBIR-funded, and Government-off-the-Shelf (GOTS) solutions.\nStardog is an evolution of Extract Transform Load (ETL) and is sufficient for answering basic business analytics questions.\nStardog does not provide functions to predict new relationships or nodes in a KG.\nKnowFlow takes a different approach, focusing on organizational collaboration on knowledge Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n28",
        "37": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 with a completely new paradigm.\nOur paradigm creates federated awareness of knowledge evolution across a community between interested parties.\nAlong with our innovative approach, we anticipate competitive advantages through cost savings, flexibility, and faster innovation.\nSince our codebase is customizable, we can adapt it to specific needs without being locked into a single vendor.\nThe collaborative community behind open-source drives rapid updates and quick bug fixes, while our focus on DoD customers encourages a stronger cyber security posture.\nThis approach attracts skilled developers and offers powerful tools without heavy investment, leveling the playing field in tech innovation.\nAdditionally, Government customers do not incur any licensing costs to sustain the software organically.\nIn addition, Technergetics boasts 18 years of direct engagement with the DoD Intelligence Community and the AFRL.\nOur team also includes in-house intelligence subject matter experts with over 20 years of experience as data analysts within the DAF, ensuring that our solutions are well-informed and contextually relevant for defense operations.\nWe plan to pursue a follow-on Phase II effort with AFRL or AFWERX to develop further capabilities.\nThe following transition paths may unlock the next opportunity for this project: • Follow-on Phase II or D2P2: Continue to collaborate with the initial DAF agency, AFRL or AFWERX • DoD Commercial Solutions Offering (CSO): Pursue CSO Phase II with non-DAF customers, such as the following or other Program Offices with an interest in intelligence analysis: o Navy -- Naval Supply Systems Command (NAVSUP), Office of Naval Research (ONR) o Army--Program Executive Office Command, Control, Communications-Tactical (PEO C3T), PEO Enterprise Information Systems (PEO EIS), PEO–Intelligence, Electronic Warfare & Sensors (PEO IEW&S), Project Manager, Intelligence Systems & Analytics (PM IS&A), Project Manager, Electronic Warfare and Cyber (PM EW&C), and Project Director for Sensors Aerial Intelligence (PD SAI) o Marines -- Marine Corps Systems Command (MCSC) • TAK Product Center: Partner with the TAK product center to define and fund transition opportunities with civilian use cases • SBIR Partnerships: Develop SBIR partnerships for Federal Government transition efforts • Follow-on Task Order on one of Technergetics existing DoD Phase III Contract Vehicles: Extend R&D with Technergetics Phase III contracts for Global Logistics Resources (AMC contract FA7014-22-D-0006) or DoD Enterprise E-Commerce Exchange/Transaction Platform (HAF/A4L contract FA7014-22-D-0005) for similar requirements • New Phase III: Partner with Government customer to extend R&D to a new related Phase III 7.0.\nKey Personnel Mr.\nRobert Harrod - Principal Investigator (US Citizen, TS/SCI cleared) Mr.\nHarrod founded Technergetics, LLC in 2013, a small business focused on maximum impact for its clients.\nAs the President and Chief Architect of Technergetics, Mr.\nHarrod has over 24 years of experience creating products for the defense and commercial technology sectors.\nMr.\nHarrod received a Bachelor’s degree in Computer Science in 2001 from the Rochester Institute Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n29",
        "38": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 of Technology.\nHe has architected solutions for the DoD since 2006 and has led strategic efforts for ACC/A5/2D, AFRL/RI, Army ASA/ALT, and other DoD customers.\nMr.\nHarrod is the Principal Investigator for several SBIR Phase I, Phase II, and Direct-to-Phase II efforts over the last decade.\nHe is published for his research in AI and Computer Vision [50].\nGregory Hyde - Knowledge Graph ML Researcher (US Citizen) Greg Hyde is a PhD candidate in Computer Engineering at the Thayer School of Engineering at Dartmouth College.\nHis research focuses on uncovering hidden abstractions within decision-making processes, particularly within Reinforcement Learning (RL) and Inverse Reinforcement Learning (IRL) frameworks.\nHe has significant experience designing and analyzing knowledge graphs as a member of the NIH Translator Program and designing RL agents to model user behavior and intent for the Office of Naval Research.\nBefore pursuing his PhD at Dartmouth, he earned his Master’s and Bachelor’s degrees in Computer Science from the University of Wisconsin-Whitewater.\nHis research has been published in ML and Knowledge Graphs [51, 52].\nDr.\nChase Yakaboski - Knowledge Graph Research Scientist (US Citizen) Dr.\nYakaboski is an AI/ML PhD research scientist with nearly a decade of experience in AI/ML solutions across diverse domains.\nHe is a Fullbright Scholar and current Harvard Research Fellow.\nDr Yakaboski is also the co- principal investigator on our Improved Data Collection and Knowledge Graphing in the TAK Ecosystem SBIR effort.\nHe recently led the architecture, development, and implementation of GenNIFER for the NIH NCATS Translator program, connecting single-cell RNA-sequencing data to existing biological knowledge extracted from literature and organized into a federated knowledge base.\nBefore pursuing his PhD, he was a lead developer for DAF SEEK EAGLE, where he developed the current version of the Common Advanced Safe Escape Software (CASES) tool integrated into the Joint Mission Planning Software (JMPS).\nCASES currently supports the DAF through aircraft-specific Mission Planning Environments (MPEs) and is utilized by over 20 FMS partner countries.\nHe has published and briefed his AI research in Knowledge Graphs as well as probabilistic graphical models at major international AI/ML conferences.\n[53, 54, 55] Ms.\nAlisa Ferrara - Principal Product Designer (US Citizen) Ms.\nFerrara is an experienced visual and concept designer with 20+ years of experience across various industries.\nHer background is heavily in graphic design, video, and marketing.\nShe is the Technergetics creative director for all customer and company-wide design initiatives.\nShe is also the Product Manager for our Army Tech Marketplace knowledge platform.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n30",
        "39": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 Ms.\nCaitlin Genna - Full-Stack Developer (US Citizen, Secret cleared) Ms.\nGenna is a skilled full-stack developer in an Agile team supporting the DoD operational ML software solutions.\nShe has a Bachelor’s Degree in Computer Science.\nShe has been published for her research on developing and optimizing data mining models involved in identifying and analyzing audio attributes [56].\n8.0.\nForeign Citizens Technergetics does not plan to employ any non-US citizens and/or dual citizens for any Phase I efforts.\n9.0.\nFacilities/Equipment Technergetics primarily intends to perform the R&D for this effort on-site at the company facilities.\nOur facilities meet all existing Environment, Safety, and Occupational Health (ESOH) standards required by applicable environmental laws and regulations of Federal, state, and local Governments.\nOur physical offices provide software and hardware engineering resources for optimal team collaboration.\nConnected to the internet with an enhanced fiber network, our facilities enable on-site and secure remote teamwork maintained for Cybersecurity Maturity Model Certification (CMMC) compliance.\nOur engineers have the proper resources to perform R&D and agile software development.\nTechnergetics employs seventy-eight people; 65% of our staff hold active DoD security clearances ranging from TS/SCI to Secret.\nOur methodology enables a repeatable and logical approach to distributed teams to implement the Software Development Lifecycle (SDLC).\nTechnergetics specifies all software development processes in a Software Development Plan (SDP); all staff are trained semi-annually on coding standards, Integrated Development Environment (IDE) tooling requirements, secure coding requirements/reviews, and adherence to Government Open-Source Software (OSS) requirements.\nIn addition, we maintain guides and require semi-annual reviews of recommended DevSecOps processes and corporate cloud-based Continuous Integration/Continuous Delivery (CI/CD) tooling to support these processes, which applies automated compile-time Software Composition Analysis (SCA), among other best practices.\nOur methodology enables the planning, creation, implementation, validation, and tracking of user stories in a streamlined manner.\nOur corporate, GovCloud-based GitLab environment stores source code/artifacts and provides managed CI/CD pipelines for source code quality.\nTrufflehog (secret detector), SonarQube (code smells/80%+ unit test coverage), Fortify (static code analysis), Docker File verification (docker-lint), Twistlock and Anchore (container scanning), Open Web Application Security Project (OWASP) DC (dependency checking), OWASP ZAP (penetration testing), Cypress (end-to-end testing) and other tooling are used to continuously assess code.\n10.0.\nSubcontractors/Consultants 10.1.\nSimage Autonomy LLC (Simage) Simage is a Dartmouth startup company founded by Chase Yakaboski, a PhD candidate at Dartmouth's Thayer School of Engineering.\nWe specialize in developing cutting-edge tools that accelerate and enhance scientific discovery through explainable and trustworthy AI solutions.\nOur core expertise is crafting solutions for knowledge graph construction, deployment, and efficient Use or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n31",
        "40": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 reasoning, complemented by causal inference techniques to unveil data-driven motifs, primarily in biology and engineering.\nOur central mission is to enhance the understanding and discovery of intricate data-derived and knowledge-supported relationships in data to uncover novel and actionable findings.\nAs a New Hampshire-based small business, we are also deeply committed to advancing innovation and promoting sustainable growth.\n11.0.\nPrior, Current, or Pending Support of Similar Proposals/Awards A proposal for similar or equivalent work has not been submitted to other DoD or government agencies 12.0.\nReferences [1] U.S.\nNational Human Genome Research Institute (NHGRI), \"Cytoscape Graph library for visualisation and analysis,\" [Online].\nAvailable: https://js.cytoscape.org/.\n[2] J.\nW.\nQ.\nL.\nH.\nP.\na.\nX.\nW.\nL.\nZhong, \"A Comprehensive Survey on Automatic Knowledge Graph Construction,\" ACM Comput.\nSurv., vol.\n56, no.\n62, pp.\n1-94, 2023.\n[3] D.\nO.\nA.\nS.\nH.\nK.\na.\nE.\nR.\nM.\nHofer, \"Construction of Knowledge Graphs: Current State and Challenges,\" Information, vol.\n15, no.\n8, 2024.\n[4] N.\nAbdelmageed, \"Towards Transforming Tabular Datasets into Knowledge Graphs,\" in The Semantic Web: ESWC 2020 Satellite Events, 2020.\n[5] M.\nW.\na.\nX.\nWu, \"On big wisdom,\" Knowledge and Information Systems, vol.\n58, no.\n1, pp.\n1-8, 2019.\n[6] N.\nKonstantinou, \"Converting Raw Sensor Data to Semantic Web Triples: A Survey of Implementation Options,\" International Journal of Sensors Wireless Communications and Control, vol.\n2, no.\n1, pp.\n44-52, 2012.\n[7] M.\nR.\nW.\nP.\nI.\nJ.\na.\nJ.\nB.\nK.\nHassanzadeh, \"“T2R: System for Converting Textual Documents into RDF Triples,\" in 2013 IEEE/WIC/ACM International Joint Conferences on Web Intelligence (WI) and Intelligent Agent Technologies (IAT), 2013.\n[8] S.\nP.\nE.\nC.\nP.\nM.\na.\nP.\nS.\nY.\nS.\nJi, \"A Survey on Knowledge Graphs: Representation, Acquisition, and Applications,\" IEEE Transactions on Neural Networks and Learning Systems, vol.\n33, no.\n2, pp.\n494- 514, 2022.\n[9] P.\nC.\na.\nH.\nPaulheim, \"Knowledge graph refinement: A survey of approaches and evaluation methods,\" Semant.\nweb, vol.\n8, no.\n3, pp.\n489-508, 2017.\n[10] D.\nK.\nY.\nS.\na.\nD.\nR.\nH.\nZhang, \"TransOMCS: from linguistic graphs to commonsense knowledge,\" in Proceedings of the Twenty-Ninth International Joint Conference on Artificial Intelligence, 2021.\n[11] H.\nZ.\ne.\nal., \"ASER: Towards large-scale commonsense knowledge acquisition via higher-order selectional preference over eventualities,\" Artificial Intelligence, vol.\n309, p.\n103740, 2022.\n[12] B.\nG.\nI.\nH.\na.\nE.\nK.\nS.\nLiu, \"INDIGO: GNN-Based Inductive Knowledge Graph Completion Using Pair-Wise Encoding,\" in Advances in Neural Information Processing Systems, 2021.\n[13] A.\nF.\nS.\nB.\nD.\nM.\nT.\nD.\nN.\na.\nE.\nD.\nS.\nA.\nC.\nM.\nMancino, \"KGTORe: Tailored Recommendations through Knowledge-aware GNN Models,\" in Proceedings of the 17th ACM Conference on Recommender Systems, New York, NY,, 2023.\n[14] C.\nG.\ne.\nal., \"A Survey of Graph Neural Networks for Recommender Systems: Challenges, Methods, and Directions,\" ACM Trans.\nRecomm.\nSyst, vol.\n1, no.\n1, 2023.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n32",
        "41": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 [15] Z.\nG.\nJ.\nL.\na.\nG.\nL.\nQ.\nChen, \"Knowledge-enhanced Multi-View Graph Neural Networks for Session- based Recommendation,\" in Proceedings of the 46th International ACM SIGIR Conference on Research and Development in Information Retrieval, 2023.\n[16] Q.\nG.\ne.\nal., \"A Survey on Knowledge Graph-Based Recommender Systems,\" IEEE Transactions on Knowledge and Data Engineering, vol.\n34, no.\n8, p.\n3549–3568, 2022.\n[17] Z.\nSun, J.\nYang, J.\nZhang, A.\nBozzon, L.-K.\nHuang and C.\nXu, \"Recurrent Knowledge Graph Embedding for Effective Recommendation,\" in Proceedings of the 12th ACM Conference on Recommender Systems, New York, NY, 2018.\n[18] B.\nH.\nW.\nX.\nZ.\na.\nP.\nS.\nY.\nC.\nShi, \"Heterogeneous Information Network Embedding for Recommendation,\" IEEE Transactions on Knowledge and Data Engineering, vol.\n31, no.\n2, pp.\n357- 370, 2019.\n[19] M.\nZ.\nX.\nX.\nW.\nL.\na.\nM.\nG.\nH.\nWang, \"Knowledge Graph Convolutional Networks for Recommender Systems,\" in The World Wide Web Conference, 2019.\n[20] C.\nT.\na.\nA.\nKrouska, \"Path-Based Recommender System for Learning Activities Using Knowledge Graphs,\" Information, vol.\n14, no.\n1, 2023.\n[21] L.\nL.\nY.\nW.\nC.\nC.\nJ.\nW.\na.\nX.\nW.\nS.\nPan, \"Unifying Large Language Models and Knowledge Graphs: A Roadmap,\" IEEE Transactions on Knowledge and Data Engineering, vol.\n36, no.\n7, p.\n3580–3599, 2024.\n[22] Y.\nW.\nX.\nC.\nJ.\ne.\na.\nZhu, \"LLMs for knowledge graph construction and reasoning: recent capabilities and future opportunities,\" World Wide Web, vol.\n27, no.\n58, August 2024.\n[23] R.\nS.\nS.\na.\nA.\nG.\nBarto, Reinforcement learning: An introduction., MIT press, 2018.\n[24] Q.\nH.\ne.\nal., \"Knowledge Graph Based on Reinforcement Learning: A Survey and New Perspectives,\" IEEE Access, 2024.\n[25] R.\nD.\ne.\nal., \"Go for a Walk and Arrive at the Answer: Reasoning Over Paths in Knowledge Bases using Reinforcement Learning,\" in International Conference on Learning Representations, 2018.\n[26] H.\nZ.\na.\nH.\nM.\nP.\nP.\nTiwari, \"DAPath: Distance-aware knowledge graph reasoning based on deep reinforcement learning,\" Neural Networks, vol.\n135, pp.\n1-12, 2021.\n[27] R.\nL.\na.\nX.\nCheng, \"DIVINE: A Generative Adversarial Imitation Learning Framework for Knowledge Graph Reasoning,\" in Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing.\n[28] T.\nH.\na.\nW.\nY.\nW.\nW.\nXiong, \"DeepPath: A Reinforcement Learning Method for Knowledge Graph Reasoning,\" in arXiv, 2018.\n[29] T.\nC.\na.\nB.\nF.\nM.\nM.\nAfsar, \"Reinforcement Learning based Recommender Systems: A Survey,\" ACM Comput.\nSurv., vol.\n55, no.\n7, pp.\n1-145, 2022.\n[30] A.\nM.\nS.\nS.\nJ.\nL.\na.\nM.\nT.\nÖ.\nS.\nSahu, \"The ubiquity of large graphs and surprising challenges of graph processing: extended survey,\" The VLDB Journal, vol.\n29, no.\n2, p.\n595–618, 2020.\n[31] M.\nM.\ne.\nal., \"The Reactome Pathway Knowledgebase 2024,\" Nucleic Acids Research, vol.\n52, no.\nD1, 2023.\n[32] I.\nR.\ne.\nal., \"Pathway Commons 2019 Update: integration, analysis and exploration of pathway data,\" Nucleic Acids Research, vol.\n48, no.\nD1, 2019.\n[33] P.\nW.\nH.\ne.\nal., \"Ensembl 2024,\" Nucleic Acids Research, vol.\n52, no.\nD1, 2023.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n33",
        "42": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 [34] S.\nH.\na.\nM.\nJ.\n“.\n[1] M.\nBastian, \"Gephi: an open source software for exploring and manipulating networks,\" in Proceedings of the international AAAI conference on web and social media, 2009.\n[35] E.\nR.\nG.\na.\nS.\nC.\nNorth, \"An open graph visualization system and its applications to software engineering,\" Software: Practice and Experience, vol.\n30, no.\n11, p.\n1203–1233, 2000.\n[36] A.\nG.\na.\nJ.\nV.\nP.\nGroth, \"The anatomy of a nanopublication,\" Inf.\nServ.\nUse, vol.\n30, no.\n1-2, pp.\n51- 56, 2010.\n[37] B.\nM.\ne.\nal., \"The value of data,\" Nat.\nGenet., vol.\n43, no.\n4, p.\n281–283, 2011.\n[38] P.\nE.\nB.\nM.\nL.\nN.\na.\nM.\nK.\nT.\nKuhn, \"Broadening the Scope of Nanopublications,\" in The Semantic Web: Semantics and Big Data, 2013.\n[39] J.\ne.\na.\nChen, \"Bias and debias in recommender system: A survey and future directions.,\" ACM [Online].\nAvailable: Information Systems 41.3, 29 Dec 2021.\nTransactions on https://arxiv.org/pdf/2010.03240.pdf.\n[40] H.\nZ.\nC.\nY.\na.\nR.\nX.\nJ.\nGao, Exploring the Feasibility of ChatGPT for Event Extraction, arXiv, 2023.\n[41] M.\nFärber, M.\nCoutinho and S.\nYuan, \"Biases in scholarly recommender systems: impact, prevalence, and mitigation,\" Scientometrics 128, p.\n2703–2736, 2023.\n[42] D.\nR.\ne.\na.\nUnni, \"Biolink Model: A universal schema for knowledge graphs in clinical, biomedical, and translational science,\" Clinical and translational science, vol.\n15.8, pp.\n1848-1855.\n[43] \"LinkML,\" [Online].\nAvailable: https://github.com/linkml/linkml.\n[44] C.\ne.\na.\nBock, \"OWL 2 Web Ontology Language Structural Specification and Functional-Style Syntax (Second Edition),\" W2C, 11 12 2012.\n[Online].\nAvailable: https://www.w3.org/TR/owl2-syntax.\n[Accessed 05 11 2024].\n[45] \"SAPIENT Network of autonomous sensors and effectors –, Interface control document BSI Flex 335,\" British Institute of Standards (BSI), 31 Mar.\n2024.\n[Online].\n[Accessed 29 Oct.\n2024].\n[46] W.\nG.\nS.\nM.\nW.\nR.\na.\nW.\nS.\nN.\nBaumgartner, \"BeAware!—Situation awareness, the ontology-driven way,\" Data Knowl.\nEng., vol.\n69, no.\n11, pp.\n1181-1193, 2010.\n[47] P.\nD.\nC.\na.\nG.\nG.\nJ.\nP.\nA.\nAlmeida, \"Towards an Ontology of Scenes and Situations,\" in IEEE Conference on Cognitive and Computational Aspects of Situation Management (CogSIMA), 2018.\n[48] C.\nJ.\nM.\na.\nK.\nB.\nM.\nM.\nKokar, \"Ontology-based situation awareness,\" Information Fusion, vol.\n10, no.\n1, pp.\n83-98, 2009.\n[49] \"Semantic Knowledge Graphing Market Size, Share & Trends Analysis Report By Data Source, By Knowledge Graph Type, By Task Type, By Application, By Organization Size, By Industry Vertical, By Region, And Segment Forecasts, 2023 - 2030,\" Grand View Research, 2023.\n[Online].\nAvailable: https://www.grandviewresearch.com/industry-analysis/semantic-knowledge-graphing-market- report.\n[Accessed 4 11 2024].\n[50] A.\nFitwi, Y.\nChen, S.\nHan and R.\nHarrod, \"Estimating Interpersonal Distance and Crowd Density with a Single-Edge Camera,\" 29 09 2021.\n[Online].\nAvailable: https://www.mdpi.com/2073- 431X/10/11/143.\n[51] G.\nHyde and E.\nSantos Jr, \"Detecting Hidden Triggers: Mapping Non-Markov Reward Functions to Markov,\" 20 01 2024.\n[Online].\nAvailable: https://arxiv.org/abs/2401.11325.\n[52] E.\ne.\na.\nSantos, \"Validation of Double Transition Model by Analyzing Reward Distributions,\" in IEEE/WIC/ACM International Joint Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT).\n, 2020.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n34",
        "43": "KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment Technergetics, LLC -- SBIR Phase I Technical Volume Topic# DoD SBIR 2024.4/AF244-0001 -- Proposal# F244-0001-0034 [53] C.\nYakaboski, G.\nHyde, C.\nNyanhongo and E.\nSantos, \"AI for Open Science: A Multi-Agent Perspective for Ethically Translating Data to Knowledge.,\" 27 10 2023.\n[Online].\nAvailable: https://openreview.net/forum?id=vhEUYsNrGa.\n[54] C.\n&.\nS.\nJ.\nE.\nYakaboski, \"Learning the Finer Things: Bayesian Structure Learning at the Instantiation Level,\" in Proceedings of the AAAI Conference on Artificial Intelligence, 2023.\n[55] C.\nA.\n&.\nS.\nE.\nYakaboski, \" Efficient Reasoning upon Fusion of Many Data Sources,\" in The International FLAIRS Conference Proceedings , 2021.\n[56] C.\nGenna, \"Mining Modern Music: The Classification of Popular Songs,\" Advances in Data Science and Information Engineering: Transactions on Computational Science and Computational Intelligence, pp.\n609-616, 30 10 2021.\nUse or disclosure of data contained on this sheet is subject to the restriction on the first page of this proposal.\n35",
        "44": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Duns Cage F244-0001-0034 AF244-0001 KnowFlow: An Interactive, Mutable, Federated Knowledge Graph Environment 11/06/2024 10:55:04 AM Technergetics, LLC 114 Genesee Street , Utica, New York, 13502 http://www.techngs.com XWYVA88GZ1F5 078840730 6X4M8 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 18.16%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) $139,555.74 $69,777.87 $69,777.87 $0.00 $0.00 $35,082.76 $0.00 $0.00 $0.00 $0.00 $2,400.00 $6,371.03 $43,853.79 $20,755.35 $20,755.35 -$0.00 $5,168.73 $69,777.87 $0.00 $35,082.76",
        "45": "Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 18.16%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Computer and Information Research Scientist/ Principal Investigator (Evi Jesaitis) Computer Occupations, All Other/ Creative Director Software Developer/ Software Engineer II Computer and Information Research Scientist/ ML Researcher II Subtotal Direct Labor (DL) Labor Overhead (rate 7.43%) x (DL) Total Direct Labor (TDL) Subcontractor Costs Subcontractor- Simage Autonomy LLC Subcontractor/Consultant Budget Information Category / Individual-TR $0.00 $0.00 $0.00 $0.00 $2,400.00 $6,371.03 $43,853.79 $20,755.35 $20,755.35 -$0.00 $5,168.73 $69,777.87 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $99.03 64 38.81 $2459.75 $8,797.67 $75.27 24 38.81 $701.09 $2,507.57 $54.47 195 38.81 $4122.26 $14,743.91 $72.12 66 38.81 $1847.32 $6,607.24 $32,656.39 $2,426.37 $35,082.76 Computer and Information Research Scientist (SME) Subtotal Subcontractor Labor (SL) Other Direct Cost Type | Rate/Hour $77.00 Estimated Hours 269.55 Cost $20,755.35 $20,755.35 Vendor Cost",
        "46": "Total Subcontractor Other Direct Costs 1 Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC1) Other Direct Costs AWS Gov Cloud Total Other Direct Costs (TODC) G&A (rate 18.16%) x Base (TDL+TOH) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Year 2 Direct Labor Costs Category / Individual-TR Computer and Information Research Scientist/ Principal Investigator (Evi Jesaitis) Computer Occupations, All Other/ Creative Director Software Developer/ Software Engineer II Computer and Information Research Scientist/ ML Researcher II Subtotal Direct Labor (DL) Labor Overhead (rate 7.43%) x (DL) Total Direct Labor (TDL) Subcontractor Costs Subcontractor- Simage Autonomy, LLC Subcontractor/Consultant Budget Information Category / Individual-TR $0.00 $20,755.35 $20,755.35 $2,400.00 $2,400.00 $6,371.03 -$0.00 $5,168.73 $69,777.87 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $99.03 64 38.81 $2459.75 $8,797.67 $75.27 24 38.81 $701.09 $2,507.57 $54.47 195 38.81 $4122.26 $14,743.91 $72.12 66 38.81 $1847.32 $6,607.24 $32,656.39 $2,426.37 $35,082.76 Computer and Information Research Scientist (SME) Subtotal Subcontractor Labor (SL) Other Direct Cost Type | Total Subcontractor Other Direct Costs 1 Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC1) Rate/Hour $269.55 Estimated Hours 77 Cost $20,755.35 $20,755.35 Vendor Cost $0.00 $20,755.35 $20,755.35",
        "47": "Other Direct Costs AWS Gov Cloud Total Other Direct Costs (TODC) G&A (rate 18.16%) x Base (TDL+TOH) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Kevin Brown Phone: (419) 344-0070 Phone: kevin.brown@techngs.com Title: Proposal Owner $2,400.00 $2,400.00 $6,371.03 -$0.00 $5,168.73 $69,777.87 $0.00 If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: Yes Audit Agency Name: Defense Contract Audit Agency Audit Agency POC: Tong Sun Address: 5795 Widewaters Parkway 2nd Floor, Dewitt, New York,13214 Phone: (571) 448-9307 Email: xiaotong.sun.civ@mail.mil Select the Type of Payment Desired: Partial payments",
        "48": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Computer and Information Research Scientist Principal Investigator Bachelor's Degree Computer Occupations, All Other Creative Director Associate's Degree Software Developer Software Engineer II Bachelor's Degree Computer and Information Research Scientist ML Researcher II Master's Degree 22 14 3 10 64 24 $99.03 38.81 $8,797.67 $75.27 38.81 $2,507.57 195 $54.47 38.81 $14,743.91 66 $72.12 38.81 $6,607.24 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nThe cost model requires two years of data, but the solicitation is only six months.\nI allocated three months in year one and three in year two to meet DSIP’s percentage completion needs.\nLabor rate Documentation: • 2024_Provisional_Rates.pdf Direct Labor Cost ($): Year2 $32,656.39 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Computer and Information Research Scientist Principal Investigator Bachelor's Degree Computer Occupations, All Other Creative Director Associate's Degree Software Developer Software Engineer II Bachelor's Degree 22 14 3 64 24 $99.03 38.81 $8,797.67 $75.27 38.81 $2,507.57 195 $54.47 38.81 $14,743.91",
        "49": "Computer and Information Research Scientist ML Researcher II Master's Degree 10 66 $72.12 38.81 $6,607.24 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nWe benchmark labor costs to ensure competitive compensation, attract talent, and ensure financial sustainability.\nLabor rate Documentation: • Techngs_2024_Provisional_Rates.pdf Direct Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) Apply Overhead to Direct Other Cost?\nOverhead Comments: Overhead expenses encompass administrative costs linked to government contract management, training, certifications, and IT support.\nOverhead Cost ($): Year2 Labor Cost Overhead Rate (%) Apply Overhead to Direct Other Cost?\nOverhead Comments: Overhead expenses encompass administrative costs linked to government contract management, training, certifications, and IT support.\nOverhead Cost ($): $32,656.39 $65,312.78 7.43 NO $2,426.37 7.43 NO $2,426.37",
        "50": "Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Subcontractor Costs?\nApply G&A Rate to Other Direct Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nGeneral and administrative costs consist of general business expenses for running and executing operations.\nG&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Subcontractor Costs?\nApply G&A Rate to Other Direct Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nGeneral and administrative costs consist of general business expenses for running and executing operations.\nG&A Cost ($): Sum of all G&A Costs is ($): $4,852.74 18.16 YES YES NO NO $6,371.03 18.16 YES YES NO NO $6,371.03 $12,742.06",
        "51": "Subcontractor/Consultants Base Subcontractor/Consultant: Simage Autonomy LLC Budget Contact Name Budget Contact Title Budget Contact Phone Budget Contact Email Dr.\nChase Yakaboski President (850) 218-7437 chase@simage.ai Do you have a letter of commitment from the subcontractor/consultant?\nDocument uploaded for the letter of commitment: • Attach_4_Commitment_Letter.pdf Are you able to provide detailed budget information for this subcontractor/consultant?\nYES YES Total Cost($) : $20,755.35 Detailed Budget Information Labor Category Description Hours Rate Cost Computer and Information Research Scientist SME 269.55 $77.00 $20,755.35 Additional Costs Type Amount Explanation Overhead: G&A: Profit: Year2 Category Description Vendor Cost Other Direct Costs",
        "52": "Subcontractor/Consultant: Simage Autonomy, LLC Budget Contact Name Budget Contact Title Budget Contact Phone Budget Contact Email Dr.\nChase Yakaboski President (850) 218-7437 chase@simage.ai Do you have a letter of commitment from the subcontractor/consultant?\nDocument uploaded for the letter of commitment: • Attach_4_Commitment_Letter.pdf Are you able to provide detailed budget information for this subcontractor/consultant?\nYES YES Total Cost($) : $20,755.35 Detailed Budget Information Labor Category Description Hours Rate Cost Computer and Information Research Scientist SME 77 $269.55 $20,755.35 Additional Costs Type Amount Explanation Overhead: G&A: Profit: Category Description Vendor Cost Other Direct Costs Total Subcontractors/Consultants Cost ($): $41,510.70 ODC-Other",
        "53": "Base Description: AWS Gov Cloud Vendor: AWS Quantity: 3 Total Cost ($): $2,400.00 Competitively Sourced?\nyes Exclusive for this Contract?\nyes Supporting Comments: Supporting Documents: • AWS Cost Estimate.pdf Year2 Description: AWS Gov Cloud Vendor: AWS Quantity: 3 Total Cost ($): $2,400.00 Competitively Sourced?\nyes Exclusive for this Contract?\nyes Supporting Comments: Supporting Documents: • AWS Cost Estimate.pdf ODC-Summary Base Do you have any additional information to provide?\nYear2 Do you have any additional information to provide?\nProfit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Year2 NO NO - 8 $10,337.46",
        "54": "Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Total Proposed Amount ($): - 8 $10,337.46 $139,555.74",
        "55": "SBIR Company Commercialization Report Technergetics, LLC DISCLAIMER: Information provided herein is privileged and confidential, and not subject to disclosure, pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nThis information shall only be used or disclosed for evaluation purposes.\nPrivileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 01/30/2023 Page 1/4",
        "56": "SBIR Company Commercialization Report Total Investments: Total Sales: Total Patents: $5,990,000.00 Company Information Address: $5,990,000.00 0 114 Genesee Street Utica, NY 13502-3526 United States Government Designated Phase III Funding: $5,990,000.00 SBC Control ID: SBC_000700589 Company Url: http://www.techngs.com Company POC Title: President Full Name: Robert Harrod Commercialization POC Title: President Full Name: Robert Harrod Phone: Email: 3152712096 Ext 701 robert.harrod@techngs.com Phone: Email: (315) 271-2096 Ext 701 robert.harrod@techngs.com Additional Company Information % Revenue for last fiscal year from SBIR/STTR funding: 18.0% Year Founded: 2013 Total revenue for last fiscal year: $5,000,000 - $19,999,999 # Employees Currently: 62 Year first Phase I award received: # SBIR/STTR Phase I Awards: 2021 2 Year first Phase II award received: # SBIR/STTR Phase II Awards: 2020 6 # Employees at first Phase II award: Mergers and Acquisition within past 2 years: 30 No Spin-offs resulting from SBIR/STTR: IPO resulting from SBIR/STTR | Year of IPO: No No | N/A Patents resulting from SBIR/STTR | #Patents: List of Patents: No | N/A Woman-Owned: No HUBZone-Certified: No Socially and Economically Disadvantaged: No SBC majority-owned by multiple VCOC, HF, PE firms | By what percent (%): No | N/A Additional Investment From DoD contracts/DoD subcontracts $5,150,346.00 $5,990,000.00 Last Submitted Version (11-21-2022 02:28 PM) Current Version Angel Investors Venture Capital Self Funded Private Sector Other Federal Contracts/Grants Other Sources Additional Investment Total Investment $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $5,150,346.00 $5,990,000.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 01/30/2023 Page 2/4",
        "57": "SBIR Company Commercialization Report Phase III Sales To DoD or DoD prime contractors Private Sector Export Markets Other Federal Agencies Additional commercialization by 3rd Party Revenue Other Customers Additional Sales Total Sales Government Phase III Contracts Last Submitted Version (11-21-2022 02:28 PM) Current Version $5,150,346.00 $5,990,000.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $5,150,346.00 $5,990,000.00 Funding Obligated $5,150,346.00 $5,990,000.00 Last Submitted Version (11-21-2022 02:28 PM) Current Version Commercialization Narrative Technergetics has received two Phase III contracts in FY22.\nOur Phase III contract with Air Force District of Washington (AFDW) and Air Mobility Command (AMC), Contract #FA7014-22-D-0006, valued at $99M, is commercializing technology to modernize the Aerial Port into the Aerial Port of the Future.\nOur second Phase III contract with Air Force District of Washington (AFDW) and HAF/A4L (Tesseract), Contract # FA7014-22-D-0005, valued at $99M, is commercializing Storefront capabilities for Air Mobility.\nThis contract follows a Direct to Phase 2 contract, contract #FA8649-22-P-0844, awarded by AFWERX on 04 May 2022.\nTechnergetics, LLC has received $2,100,346 in awards/sales on this Phase III contract.\nOnce the SBIR.gov site updates with the Phase 2 contract #FA8649-22-P-0844, the Phase III award information will be entered.\nCommercialized Awards Listed below are the sales revenue and investment details resulting from the technology developed under these SBIR/STTR awards.\nURSUS: The Digital Platform for DoD Commerce 1 of 2 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2022 Subsidiaries No | N/A N/A Topic #: AF221-DCSO1 Contract/Grant #: FA8649-22-P-0844 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $2,340,000.00 Dod or DoD prime contractors: $2,340,000.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $2,340,000.00 Sales Total: $2,340,000.00 Government Designated Phase III Contracts Funding Agreement / Agency Project Title Year Awarded Funding Obligated Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 01/30/2023 Page 3/4",
        "58": "SBIR Company Commercialization Report Contract # FA7014-22-D-0005 USAF Strategic Pursuit of Enterprise Advancement & Readiness (SPEAR) 2022 $2,340,000.00 UPgrade: Digital Transformation for Space-Available (S/A) Passenger Experience 2 of 2 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2021 Subsidiaries No | N/A N/A Topic #: AF203-CSO1 Contract/Grant #: FA8649-21-P-1495 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $3,650,000.00 Dod or DoD prime contractors: $3,650,000.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $3,650,000.00 Sales Total: $3,650,000.00 Government Designated Phase III Contracts Funding Agreement / Contract # FA8649-21-P-0287 Agency USAF Project Title Year Awarded Funding Obligated Precision Logistics & Advancement in Transportation Optimization (PLATO) 2022 $3,650,000.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 01/30/2023 Page 4/4",
        "59": "Kevin Brown, Technergetics, LLC Oct 07, 2024 Oct 07, 2025"
    },
    "images": [
        {
            "page": 1,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page1_img1.jpeg",
            "hash": "963c69c169799696",
            "position": "Middle Center"
        },
        {
            "page": 9,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page9_img1.jpeg",
            "hash": "ea9a3a5a5e4a9a52",
            "position": "Middle Center"
        },
        {
            "page": 10,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page10_img1.jpeg",
            "hash": "ea9a3a5a5e4a9a52",
            "position": "Middle Center"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page11_img1.jpeg",
            "hash": "ea9a3a5a5e4a9a52",
            "position": "Middle Center"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page12_img1.jpeg",
            "hash": "ea9a3a5a5e4a9a52",
            "position": "Middle Center"
        },
        {
            "page": 13,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page13_img1.jpeg",
            "hash": "ea9a3a5a5e4a9a52",
            "position": "Middle Center"
        },
        {
            "page": 13,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page13_img2.png",
            "hash": "c31c939ce31c65b9",
            "position": "Middle Center"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page14_img1.jpeg",
            "hash": "ea9a3a5a5e4a9a52",
            "position": "Middle Center"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page15_img1.jpeg",
            "hash": "ea9a3a5a5e4a9a52",
            "position": "Middle Center"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page16_img1.jpeg",
            "hash": "ea9a3a5a5e4a9a52",
            "position": "Middle Center"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page16_img2.jpeg",
            "hash": "93531347cd37253c",
            "position": "Top Center"
        },
        {
            "page": 17,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page17_img1.jpeg",
            "hash": "ea9a3a5a5e4a9a52",
            "position": "Middle Center"
        },
        {
            "page": 18,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page18_img1.png",
            "hash": "8989897676765c63",
            "position": "Middle Right"
        },
        {
            "page": 18,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page18_img3.jpeg",
            "hash": "ea9a3a5a5e4a9a52",
            "position": "Middle Center"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page19_img1.png",
            "hash": "8c7329d6abcc7384",
            "position": "Middle Right"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page19_img3.jpeg",
            "hash": "bc270f70700f4d3d",
            "position": "Top Right"
        },
        {
            "page": 21,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page21_img1.png",
            "hash": "99d0da99246f6366",
            "position": "Middle Right"
        },
        {
            "page": 23,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page23_img2.jpeg",
            "hash": "859a68e01a6f6dcb",
            "position": "Middle Center"
        },
        {
            "page": 28,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page28_img1.jpeg",
            "hash": "91c84e0f8f9dbc49",
            "position": "Middle Center"
        },
        {
            "page": 28,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page28_img2.jpeg",
            "hash": "90cc3f266e3b4167",
            "position": "Bottom Center"
        },
        {
            "page": 28,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page28_img3.png",
            "hash": "e0d42bd62a33932f",
            "position": "Top Center"
        },
        {
            "page": 29,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page29_img1.jpeg",
            "hash": "aa02b179f91db40f",
            "position": "Middle Center"
        },
        {
            "page": 32,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page32_img1.jpeg",
            "hash": "e3b41cf31da11cb4",
            "position": "Middle Center"
        },
        {
            "page": 34,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page34_img1.jpeg",
            "hash": "c5626af51c9d11ea",
            "position": "Top Center"
        },
        {
            "page": 37,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page37_img1.png",
            "hash": "c493137c2fc3381f",
            "position": "Bottom Right"
        },
        {
            "page": 37,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page37_img2.jpeg",
            "hash": "eca77670a6529a85",
            "position": "Bottom Left"
        },
        {
            "page": 38,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page38_img1.jpeg",
            "hash": "91a5535a4a9e7c8d",
            "position": "Top Left"
        },
        {
            "page": 38,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page38_img2.png",
            "hash": "c493137c2fc3381f",
            "position": "Top Right"
        },
        {
            "page": 38,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page38_img3.jpeg",
            "hash": "846c51975ac51fce",
            "position": "Middle Left"
        },
        {
            "page": 38,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page38_img4.png",
            "hash": "afe0960ef88dd11a",
            "position": "Middle Right"
        },
        {
            "page": 38,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page38_img5.jpeg",
            "hash": "a684513b9b391bcd",
            "position": "Bottom Left"
        },
        {
            "page": 38,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page38_img6.png",
            "hash": "c493137c2fc3381f",
            "position": "Top Right"
        },
        {
            "page": 39,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page39_img1.png",
            "hash": "c493137c2fc3381f",
            "position": "Top Right"
        },
        {
            "page": 39,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page39_img2.jpeg",
            "hash": "b9c797cac80968b5",
            "position": "Top Left"
        },
        {
            "page": 44,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page44_img1.png",
            "hash": "834987a6cf38ccb6",
            "position": "Top Left"
        },
        {
            "page": 59,
            "image_file": "docNAC01FB7453538d06cf6f1033635db95c31d784549713e9b42e7981ff9516714eabffef0b56d6_page59_img1.jpeg",
            "hash": "c6cc2b23999bb24d",
            "position": "Middle Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "techngs.com",
        "name": "N/A",
        "phone": "N/A"
    }
}