{
    "filename": "docNAC01FB745353c5b2755dc36ae877335da6757d02b68c12b725496c241c50db072e5817407299.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0114 Proposal Generative AI-Augmented Knowledge Graphs: Streamlining User-Directed Data Title: Structuring and Ontology Updates via LLMs for Rapid Situational Awareness Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: Clara Copilot AI Inc Address: Website: UEI: CAGE: 134 Louisiana Ave, Corpus Christi, TX 78404-1702 https://claracopilot.ai/ NFPHFMA3S2F9 SBA SBC Identification Number: 002659254 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 4 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_002659254 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_002659254.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [X] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Title Business Name Date Alexandria Moffitt Alexandria Moffi Co-Founder & CEO Clara Copilot AI Inc 08/30/2024 tt",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?NO VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: Technical Abstract: Enhancing Knowledge Graphs with Real-Time User Interaction and LLM Augmentation Knowledge graphs (KGs) are valuable for structuring and visualizing complex datasets, aiding decision-making in fields such as defense and national security.\nHowever, existing KG systems often face limitations in user interaction, requiring manual updates and lacking real-time adaptability.\nAnalysts struggle to update KGs, extract insights, and adjust to dynamic contexts, leading to delays and outdated information.\nThis project addresses these challenges by integrating Large Language Models (LLMs) with real-time graph modification and enhanced user interaction tools.\nKey Innovations: 1.\nUser-Directed Graph Modifications: This feature allows users to directly modify the KG in real time—adding/removing nodes, defining relationships, and resolving conflicts.\nLLM-generated suggestions will guide these modifications, improving graph structure and data accuracy.\nThis real-time adaptability ensures KGs remain relevant, enabling rapid, data-driven decision-making.\n2.\nUser-Centric Visualization and Interaction Tools: Intuitive visualization techniques will allow users to efficiently navigate and interact with the KG.\nUsers will be able to modify the graph, request summarized views, and receive LLM-driven recommendations for ontology updates.\nThese features reduce cognitive load and facilitate quick extraction of meaningful insights from large, complex graphs.\nBy enabling real-time, user-driven updates and interactions, this project will improve decision-making across military and commercial applications.\nIt bridges the gap between unstructured data and actionable insights, empowering users to manage and adapt KGs for dynamic situational awareness.\nPhase I Technical Objectives Phase I will focus on two key tasks aimed at developing the LLM-augmented KG platform:",
        "5": "1.\nTask I: User-Directed Graph Modifications (3 months) This task will develop tools for users to modify the KG in real time—adding/removing nodes and relationships—and will incorporate LLM-generated recommendations.\nThe goal is to enable flexible updates to the KG, keeping it accurate and adaptable to changing data.\nDeliverables: • • • Interactive Graph Modification Tool LLM-Enhanced Suggestions for Modifications Real-Time Ontology Update Module 2.\nTask II: User-Centric Graph Interaction and Visualization Tools (3 months) This task will create user-friendly interfaces for navigating and interacting with the KG, including LLM-powered summarization and real-time updates.\nThese tools will streamline the process of graph interaction, allowing users to quickly extract relevant insights.\nDeliverables: • • • Graph Visualization Interface Interactive Graph Editing Tool LLM-Driven Summarization Engine This project will significantly improve the efficiency and accuracy of decision-making by enhancing KG systems with real-time user interaction and dynamic updates, enabling faster and more informed responses in complex environments.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: This research will deliver significant benefits across both government and commercial sectors, improving real-time data analysis, decision-making, and operational efficiency.\nBy integrating generative AI with dynamic, user-driven knowledge graphs (KGs), Clara Copilot aims to revolutionize how organizations manage and act on complex data, particularly in high- stakes environments.\nGovernment and Defense Applications 1.\nEnhanced Decision-Making for DoD and Intelligence Agencies Clara Copilot’s platform will enable the DoD and Intelligence Community to process and analyze open-source and classified data in real-time, improving situational awareness and supporting faster, more accurate decision-making in military operations and crisis management.\n2.\nSupport for Special Operations The platform will help Special Operations Forces (SOF) identify vulnerabilities, assess risks, and improve mission planning and execution.\nBy automating data aggregation and analysis, the system will enhance operational effectiveness in complex, high-risk environments.\n3.\nAgility in Command & Control",
        "6": "Real-time updates and predictive AI will improve command and control by enabling military units to quickly adapt to changing conditions.\nThe system will provide actionable insights, reducing decision delays and improving operational flexibility.\nCommercial Applications 1.\nRisk Management for Private Sector Clara Copilot’s tools will help industries like travel, tourism, and energy improve crisis management and risk assessment.\nThe platform will enable Global Security Operations Centers (GSOCs) to analyze data from both open- source and proprietary sources, enhancing operational security and continuity.\n2.\nEnergy Sector Safety and Compliance The energy industry will benefit from Clara Copilot’s automated data analysis for asset management and regulatory compliance.\nBy providing real-time insights, the platform will help energy companies ensure safety and optimize operations in high-risk environments.\n3.\nCompetitive Intelligence Clara Copilot’s open-source analysis tools will help businesses track industry trends and competitors, providing insights into market shifts and enabling faster, data-driven decisions.\nScalability and Market Potential The platform’s scalability positions it for wide adoption across multiple sectors.\nTarget industries include defense, energy, and travel, which together represent multi-trillion-dollar markets.\nA modest penetration could generate substantial revenue, with $5M ARR from the travel sector alone.\nAs the platform evolves, it will continue to meet the needs of dynamic, data-driven environments.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: User-Directed Data Structuring, Ontology Updates, Situational Awareness",
        "7": "VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 100% 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES 3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES NO 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, YES release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO",
        "8": "16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n50% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES VOL I - Contact Information Principal Investigator Name: Mr.\nTyson Myhres Phone: (360) 453-7981 Email: tyson.myhres@claracopilot.ai Address: 134 Louisiana Ave, Corpus Christi, TX 78404 - 1702 Corporate Official Name: Mrs.\nAlexandria Moffitt Phone: (571) 426-5249 Email: alex.moffitt@claracopilot.ai Address: 522 Michelson Road, Monterey, CA 93940 - 6208 Authorized Contract Negotiator Name: Mrs.\nAlexandria Moffitt Phone: (571) 426-5249 Email: alex.moffitt@claracopilot.ai Address: 522 Michelson Road, Monterey, CA 93940 - 6208 Form Generated on 11/04/2024 07:12:55 PM",
        "9": "Department of Defense (DoD) Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) Program Generative AI-Augmented Knowledge Graphs: Streamlining User-Directed Data Structuring and Ontology Updates via LLMs for Rapid Situational Awareness An investigation of Generative AI, and LLMs in particular, as tools for user-directed data structuring and ontological evolution, expediting analysis and enhancing situational awareness.\n1.\nIdentification and Significance of the Problem or Opportunity.\nVolume 2: Technical Volume Knowledge graphs (KGs) are powerful tools for structuring and visualizing relationships between data points, allowing decision-makers to comprehend large datasets more effectively.\nHowever, current KG systems are not equipped with efficient user interaction mechanisms, which can significantly hinder their effectiveness.\nAnalysts often face challenges when manually updating KG’s or interacting with them to extract meaningful insights, leading to delays in response times and potential gaps in information.\nThe emphasis of this project is to enable efficient user interaction with KGs.\nCurrent KGs often lack dynamic adaptability, requiring manual effort for ontology1 updates, relationship refinement, and error correction.\nAs a result, critical information may remain outdated, limiting the system's ability to respond in real-time to evolving data or changes in operational context.\nMoreover, existing systems suffer from data disorganization and user interaction friction, making it difficult to navigate large graphs and understand their content.\nWe propose to address these challenges by integrating Large Language Models (LLMs) with real-time graph augmentation and dynamic user interaction tools.\nThe key innovations include: User-Directed Graph Modifications: Provide users with tools to directly interact with and modify the KG in real time, allowing them to add or remove nodes, define relationships, and resolve conflicts.\nThese user-driven changes will be supported by LLM-generated suggestions for enhancing the graph's structure and accuracy.\nThis interactive capability ensures that the KG remains adaptable and responsive to real-time data, empowering users to refine the graph according to their operational needs.\nBy enabling flexible and immediate modifications, the system enhances its ability to support rapid, data-driven decision-making.\nUser-Centric Graph Visualization and Interaction Tools: Implement advanced, intuitive visualization techniques that allow users to interact with the graph efficiently.\nUsers will be able to directly modify the graph structure, request summarized views, and receive LLM-generated recommendations for ontology updates.\nThese features will streamline user interaction with the KG, reducing manual effort while improving the accuracy and relevance of the data.\n1 An ontology is a formally defined representation of knowledge that sets out the concepts and relationships within a particular domain",
        "10": "By enhancing user interaction and enabling dynamic, real-time updates to KGs, this project will significantly improve the speed and accuracy of decision-making processes in both military and commercial applications.\nThe proposed solution bridges the gap between unstructured data and structured insights, empowering users with efficient tools to manage and adapt KGs for rapid situational awareness.\n2.\nPhase I Technical Objectives.\nPhase I work will be divided into two (2) major milestones, each contributing toward the overall development of an LLM-augmented KG platform.\nTask I: Implement User-Directed Graph Modifications - Duration 3 Months Description: The first task focuses on developing tools that allow users to directly interact with and modify the KG in real time.\nUsers will have the ability to add or remove nodes and relationships, resolve conflicts, and suggest updates.\nThis interaction will be supported by LLM-generated recommendations to enhance the graph’s structure and data accuracy.\nThe modifications made by users will immediately reflect in the graph and adjust its ontology as needed.\nImportance: User-directed modifications are critical for empowering analysts and decision-makers to tailor the KG according to their specific needs and real-time data inputs.\nBy giving users the ability to make direct changes, the system provides flexibility and adaptability, ensuring that the graph remains relevant and accurate.\nThis feature will significantly reduce dependency on technical personnel for graph maintenance, enabling more responsive and efficient decision-making.\nTask I Deliverables: 1.\nInteractive Graph Modification Tool: A tool integrated into the user interface that allows users to add, remove, and modify nodes and relationships within the KG.\n2.\nLLM-Enhanced Suggestions for Modifications: A back-end engine powered by LLMs that provides intelligent suggestions and conflict resolutions when users make changes to the graph.\n3.\nReal-Time Ontology Update Module: A system that dynamically updates the underlying ontology based on user-directed modifications, ensuring that the graph remains consistent and accurate.",
        "11": "Task II: Create User-Centric Graph Interaction and Visualization Tools - Duration 3 Months Description: The final milestone involves the development of intuitive tools for user interaction and visualization.\nThis task will build user interfaces that allow for efficient navigation of the KG, graph modification, and real-time updates.\nUsers will have the ability to manually interact with and refine the graph, request summarized views generated by the LLM, and receive actionable recommendations on ontology modifications.\nImportance: The ability for users to efficiently interact with the KG is a key component of this project.\nBy providing intuitive and powerful tools for graph manipulation and visualization, users are empowered to make data-driven decisions with greater speed and accuracy.\nThese tools will reduce the cognitive load on users, enabling them to focus on high-value tasks such as situational analysis and decision-making.\nTask II Deliverables: 1.\nGraph Visualization Interface: A user-friendly interface that visually represents the KG, including real-time updates and LLM-generated summaries.\n2.\nInteractive Graph Editing Tool: A tool that allows users to directly modify the graph by adding or removing nodes and relationships, with LLM-assisted suggestions.\n3.\nLLM-Driven Summarization Engine: A backend engine that uses LLMs to generate concise summaries of specific sections of the graph based on user queries.\n3.\nRelated Work.\nThe Co-Founder & CTO of Clara Copilot, and Principal Investigator for this Phase I project, is an experienced technologist with 10+ years of experience at the crossroads of Computer Science, Data Science, Machine Learning, and Cybersecurity.\nPrior successes include time as a Technical Program Manager (TPM) in Amazon’s Inventory Planning and Control (IPC) organization, optimizing Inbound Freight, resulting in a $100MM annualized savings after launching World-wide in 2014.\nMost recently, as the engineering lead for customer onboarding and account management at Zipwhip (a Series C & D, SMS as a Service startup), he",
        "12": "re-architected account/tenancy flows resulting in +6% MoM growth moving into a $850MM acquisition by Twilio Inc in 2021.\nThe Co-Founder & CEO of Clara Copilot leverages over a decade of experience as a Special Operations Veteran.\nDuring a 2022 deployment to East AFrica, she identified critical challenges in real-time data management.\nShe dedicated countless nights to manually scraping open-source information, striving to understand the operational landscape, identify vulnerabilities for missions, and gauge local sentiments.\nThis commitment to thorough data analysis highlighted the importance of effective information management in dynamic environments.\nThe team has conducted over 100 customer discovery interviews with the Department of Defense, Intelligence Community, and Department of State to tailor solutions to their needs and has been invited to prominent events, including JIFX 24-3, JIFX 24-4, JIFX 25-1, Army Applications Laboratory VERTEX, and TIDE 2024, showcasing our engagement with cutting-edge developments.\nThese activities ensure our solutions are aligned with current technological needs and advancements.\nOur founders’ extensive technical background and high-impact solutions, DoD experience, and our ongoing customer interactions directly inform our project’s direction, demonstrating our awareness of state-of-the-art practices and our commitment to addressing real-world challenges in data management.\n4.\nRelationship with Future Research or Research and Development The completion of Phase I will serve as a critical foundation for future research and development aimed at enhancing the capabilities of the Generative AI-Augmented KG system.\nA key area for future exploration is Advanced AI-Assisted Ontology Evolution, where more sophisticated AI techniques will allow the ontology to autonomously adapt to new trends and data types, reducing manual interventions.\nThis will ensure the system remains responsive to rapidly changing data environments, especially in fields like military intelligence and corporate risk assessment.\nAnother focus will be Context-Aware Graph Modifications and Predictions, enabling the system to predict user actions and offer contextually relevant suggestions, reducing the cognitive load on users while enhancing their operational efficiency.\nAdditionally, Automated Feedback Loops and Continuous Learning will be a critical component of future development.\nBy creating mechanisms that allow the system to learn from user interactions and real-world data, the platform will continuously improve its performance.\nThis will empower the system to better tailor its recommendations and predictive capabilities, making it an indispensable tool for dynamic, real-time decision-making.\nThese advancements will ensure that the system not only remains flexible and scalable but also continually evolves to meet the demands of various industries and complex operational environments.\n5.\nCommercialization Strategy Clara Copilot is developing a suite of advanced data management and analysis tools to address critical needs in real-time data processing for both the Public (DoD, DHS, & Federal Civilian) and Private (Commercial & NGO) Sectors.\nThese tools address the urgent need for advanced data analytics in dynamic environments, where timely and accurate information is crucial for military and business decision-makers that focus on security and risk management.\nThe technology includes: 1.\nReal-Time Open-Source Information Analysis Tool: Aggregates and analyzes news and social media data, providing automated recommendations for action.",
        "13": "2.\nHierarchical Open-Source Tool: Analyzes industry, competitor, and firm-specific data for commercial applications.\n3.\nReal-Time Proprietary Tool: Processes sensitive, proprietary data for high-security applications, providing automated recommendations for action.\n4.\nIntegration Tool: Merges open-source data with closed-source environments for cohesive data management, providing automated recommendations for action..\nMarket Size and Segments: Our initial focus is on DoD Special Operations and information operations, which require sophisticated real-time data analysis.\nThe broader DoD market offers opportunities for scaling and additional applications through the intelligence and command & control warfighting functions.\nIn addition to the DoD, Federal Civilian agencies such as the Intelligence Community, Department of Homeland Security, and the Department of State have substantial needs for advanced data management tools because of the increase in information warfare by our adversaries.\nIn the private sector, the travel and tourism industry is increasingly reliant on data analytics to enhance customer experiences, optimize operations, and manage risks.\nThe global travel and tourism market was valued at approximately $9 trillion in 2019 and is projected to reach over $11 trillion by 2026.\nThis sector includes hotels, airlines, travel agencies, and leisure services.\nCompanies like Lyft, Disney, and major hotel chains operate Global Security Operations Centers (GSOCs) to monitor real-time events and security threats.\nHowever, these operations lack robust data analysis, risk assessment, and mitigation strategies.\nThe integration of our analytics tool can transform thes GSOCs by enhancing risk analysis, management of misinformation, and operational efficiency.\nConservatively, a capture of 10% of the travel and tourism analytics market valued at $5 billion would be an Annual Recurring Revenue (ARR) of $5M.\nThe global energy market, which includes oil, gas, renewables, and utilities, is valued at over $8 trillion.\nThe energy sector faces significant challenges related to data, including asset management, regulatory compliance, and environmental concerns as a result of their locations in typically dangerous or high-risk regions.\nData analytics is crucial for optimizing resource allocation and ensuring operational safety.\nEnergy companies establish GSOCs to monitor infrastructure and manage crises.\nThese operations often deal with a large amount of data but are not fully utilizing analytics for crisis management to increase lead time to better responses during",
        "14": "outages, emergencies, and safeguarding operations and public safety.\nConservatively, a capture of 10% of the energy sector analytics market valued at $10 billion would be an Annual Recurring Revenue (ARR) of $1B.\nCommercialization Plan and Schedule: Q4 2025: Complete development of the real-time open-source tool and initiate pilot programs with select DoD units.\nBegin commercial-focused customer pilots and sign initial contracts with commercial clients.\nQ1 2026: Launch the hierarchical open-source tool for commercial clients in the travel & tourism industry and expand pilot programs in the DoD.\nAccelerate participation in key industry and combat evaluation events (e.g.\nJIFX, TIDE, Trident Spectre, CyberFlag, Vigilant Shield, AEWE & Bold Quest) to showcase technology and gather feedback.\nQ1 2027: Deploy the closed-source tool in high-security environments (e.g AWS GovCloud, NIPRNet) and finalize integration tool development towards achieving Initial Operational Capability (IOC).\nScale up marketing efforts and begin expansion into broader federal agencies, travel and tourism, and energy sectors.\nQ1 2028: Achieve commercialization (TRL 9) with deployment of all tools within initial target markets.\nBegin formal market expansion into additional DoD sectors and allied partners upon achieving Full Operational Capability (FOC).\nQuantitative Commercialization Results: ● By End of Q4 2025: Secure 5 pilot contracts within DoD and secure 3 commercial-focused pilot contracts.\n● By End of Q1 2027: Reach $5 million in revenue with 5+ active contracts across DoD, other federal agencies, and commercial sectors.\n● By End of 2029: Expand to 10+ federal agency contracts and capture 10% of the commercial market segment.\nClara Copilot’s strategy ensures a structured approach to product development and market expansion, leveraging initial success in niche areas to scale across broader markets, thereby addressing pressing needs in both government and commercial sectors.\n6.\nKey Personnel Tyson Myhres University of Colorado, Master of Science: Data Science & Engineering Mgmt., Expected 2025 Accepted with 4.0 GPA on Data Structures & Algorithms Pathway University of Arizona, Bachelor of Science: Computer Science, 2012 Relevant Experience: As an engineering leader with over 10 years of experience in the technology industry including Amazon, Microsoft, and one Series-D startup acquisition by",
        "15": "Twilio Inc, Tyson brings an extensive background focused at the crossroads of Computer Science, Data Science, Machine Learning, and Cybersecurity.\nAlexandria Moffitt The Wharton School - University of Pennsylvania, MBA, Expected 2025 United States Military Academy, Bachelor of Science: Political Science, 2013 Relevant Experience: A U.S.\nArmy Special Operations Civil Affairs Veteran with 10 years of military experience, identified critical challenges in real-time data management during a 2022 deployment in East Africa.\n7.\nForeign Citizens None 8.\nFacilities/Equipment We anticipate the following expense allocations as they apply directly to our research efforts: Infrastructure - $18,000: We estimate that our cloud infrastructure shall cost no more than $3000/mo at any point of the 6mo project taking into account our current cloud infrastructure operating costs.\nEquipment - $8,544: Generative AI requires our development team to have latest generation hardware to perform the necessary work on their local machines.\n9.\nSubcontractors/Consultants Clara Copilot AI intends to be the primary contractor for this SBIR Phase 1 project and will be directly subcontracting any/all consultants as a part of our own payroll.\nWe intend for no additional firms to be involved/sourced for the duration of this Phase I.\n10.\nPrior, Current or Pending Support of Similar Proposals or Awards No prior, current, or pending support has been provided for proposed work.\n11.\nTechnical Data Rights None",
        "16": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Cage F244-0001-0114 AF244-0001 Generative AI-Augmented Knowledge Graphs: Streamlining User-Directed Data Structuring and Ontology Updates via LLMs for Rapid Situational Awareness 11/04/2024 07:12:51 PM Clara Copilot AI Inc 134 Louisiana Ave, Corpus Christi, Texas, 78404 https://claracopilot.ai/ NFPHFMA3S2F9 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base (TDL) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) $139,370.32 $139,370.32 $0.00 $0.00 $0.00 $112,826.56 $0.00 $18,000.00 $8,543.76 $0.00 $0.00 $0.00 $139,370.32 $0.00 -$0.00 $0.00 $139,370.32 $0.00 $0.00 $0.00 $0.00",
        "17": "Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Software Developer/ Principal Investigator (Tyson Myhres) Software Developer/ UX/UI Designer Subtotal Direct Labor (DL) Labor Overhead (rate 0%) x (DL) Total Direct Labor (TDL) Direct Supplies Costs Cloud Infrastructure Expenses Total Direct Supplies Costs (TDS) Direct Equipment Costs Software Engineer in AI workstation Total Direct Equipment Costs (DE) G&A (rate 0%) x Base (TDL) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Year 2 Direct Labor Costs $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $78.91 416 $80.00 1000 $32,826.56 $80,000.00 $112,826.56 $0.00 $112,826.56 $18,000.00 $18,000.00 $8,543.76 $8,543.76 $0.00 -$0.00 $0.00 $139,370.32 $0.00 Category / Individual-TR Rate/Hour Estimated Fringe Rate Fringe Cost Cost",
        "18": "Software Developer/ Principal Investigator (Tyson Myhres) $1.00 0 Hours (%) Subtotal Direct Labor (DL) Labor Overhead (rate 0%) x (DL) Total Direct Labor (TDL) Direct Supplies Costs N/A Total Direct Supplies Costs (TDS) Direct Equipment Costs N/A Total Direct Equipment Costs (DE) G&A (rate 0%) x Base () Cost Sharing Profit Rate (0%) Total Estimated Cost TABA $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Alexandria Moffitt Phone: (571) 426-5249 Phone: alex.moffitt@claracopilot.ai Title: Proposal Owner If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: No Select the Type of Payment Desired: Partial payments",
        "19": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Software Developer Software Developer Principal Investigator UX/UI Designer Bachelor's Degree Bachelor's Degree 10 10 416 $78.91 $32,826.56 1000 $80.00 $80,000.00 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\n26 weeks X 40 hours per week X (percent of time dedicated) at a rate of $80.00 for UX/UI and PI is $79.81.\nProvide any additional information and cost support data related to the nature of the direct labor detailed above.\nN/A Labor rate Documentation: • BLSGOVSoftwareDeveloperRate (1).pdf Direct Labor Cost ($): Year2 $112,826.56 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Software Developer Principal Investigator Bachelor's Degree 10 0 $1.00 $0.00 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nI am tracking that this proposal is a 6 month proposal so we are only adding information for the first 6 months.\nIf there is an opportunity to extend we can build that in from there.",
        "20": "Direct Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) Apply Overhead to Direct Supplies Cost?\nApply Overhead to Direct Equipment Cost?\nOverhead Comments: Overhead Cost ($): Year2 Labor Cost Overhead Rate (%) Apply Overhead to Direct Supplies Cost?\nApply Overhead to Direct Equipment Cost?\nOverhead Comments: Overhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to ODC- Supply?\n$0.00 $112,826.56 0 NO NO $0.00 0 NO NO $0.00 $0.00 0 NO YES NO",
        "21": "NO $0.00 0 NO NO NO NO $0.00 $0.00 Apply G&A Rate to ODC- Equipment?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to ODC- Supply?\nApply G&A Rate to ODC- Equipment?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Sum of all G&A Costs is ($): ODC-Supplies Base Description: Cloud Infrastructure Expenses Vendor: Amazon Web Sevices Quantity: 6 Consumable?\nyes Exclusive for this Contract?\nyes Supporting Documents: • 05.\nCloud Infrastructure Explanation.pdf Total Cost($): $18,000.00 Competitively Sourced?\nyes Year2 Description: N/A Vendor: N/A",
        "22": "Total Cost($): $0.00 Competitively Sourced?\nno Quantity: 0 Consumable?\nno Exclusive for this Contract?\nno Supporting Comments: N/A ODC-Equipment Base Description: Software Engineer in AI workstation Vendor: Apple AI Quantity: 1 Total Cost ($): $8,543.76 Competitively Sourced?\nyes Exclusive for this Contract?\nno Supporting Comments: Supporting Documents: • single-developer-workstation.pdf Year2 Description: N/A Quantity: 0 Vendor: N/A Total Cost ($): $0.00 Competitively Sourced?\nno Exclusive for this Contract?\nno Supporting Comments: N/A ODC-Summary Base Do you have any additional information to provide?\nYear2 Do you have any additional information to provide?\nProfit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: N/a Profit Rate (%): NO NO -$0.00 0",
        "23": "Profit Explanation: 0 Total Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: 0 Profit Rate (%): Profit Explanation: 0 Total Profit Cost ($): Total Proposed Amount ($): $0.00 -$0.00 0 $0.00 $139,370.32",
        "24": "Clara Copilot AI Inc.\nModularity of Retrieval Augmented Generation (RAG) Workflows Codification, Refinement, and Evaluation of commonly observed actions in RAG workflows to promote modularity, composability, and advancement of intelligence analysis in the Post-GenAI Information Environment.\nPrincipal Investigator: Tyson Myhres / CTO Key Personnel: Alex Moffitt / CEO A244-P037 Artificial Intelligence/ Machine Learning (AI/ML) Focused Open Topic",
        "25": "BLUF: Bottom Line Up Front BLUF: 1.\nCompany Information and Background: a.\nClara Copilot AI Inc.\nincorporated in April 2024 and is a cutting-edge AI tool that provides live and comprehensive analysis from open & closed source data for military and business leaders i.\nii.\niii.\niv.\nBy processing open & closed source data leveraging Retrieval Augmented Generation (RAG) By generating a vulnerability assessment of the Narratives in the information space By generating recommended courses of action through an AI Narrative Report By assigning a trust index associated with users and sources of the information 2.\nCustomer and Competition: a.\nb.\nTarget Market (Government): Special Operations Forces, DoD, USG (IC, DoS, DoJ, DoT, DHS) Target Market (Commercial): Hotel Industry, Travel & Tourism, Energy Sector 3.\nMarket: a.\nb.\n1 Year: Department of Defense - SOF 1% Market Share (70,000 Personnel), Commercial Sector: Hotel Industry $2M ARR 5 Year: SOF 10% Market Share & 1% DoD, 10% Hotel Sector $13.2B ARR & Energy Sector $106M ARR 4.\n5.\n6.\nIntellectual Property: Codifying proprietary ‘workflows’, Training of ‘expert’ Agentic LLMs, and Curation of Domain-Specific Open-Source data over time Financing / Revenue: Government - Working to get a co-sponsor to support necessary solution & pre-seed venture capital raise Assistance and mentoring:Leveraging regional DoD Procurement Technical Assistance Centers",
        "26": "Company Information and Background 1.\nCore Competencies and areas of specialization.\na.\nb.\nDevelop a cutting-edge AI tool that provides live and comprehensive analysis from open & closed source data for military and business leaders Transforms real-time data: i.\nii.\niii.\niv.\nBy processing open & closed source data leveraging Retrieval Augmented Generation (RAG) By generating a vulnerability assessment of the Narratives in the information space By generating recommended courses of action through an AI Narrative Report By assigning a trust index associated with users and sources of the information 2.\n3.\n4.\n5.\n6.\nProducts with significant sales.\na.\nN/A A concise history of previous Federal and non-Federal funding/investments.\na.\nN/A Regulatory experience.\na.\nN/A Past commercialization successes.\na.\nN/A Past failure and how you overcame.\na.\nN/A",
        "27": "Customer & Competition ● Description of key technology objectives ○ ○ ○ Develop RAG Workflow Techniques; Implement class-based Ai Tooling domain modeling and composability Evaluate RAG Workflow Techniques; Leverage Observability/ Scale RAG Workflow Techniques; Interoperability of Foundational LLM models within privately administered Cloud Infrastructure via Infrastructure as Code.\n● Current competition and/or alternative solutions ○ Meltwater - Social Media listening platform that generates analysis ○ Vannevar Labs - generates Narrative Intelligence of Intelligence Documents ● Advantages of company’s offer compared to competing products or services ○ Generates real-time narrative intelligence of social media & news sources to determine themes and messages ○ ○ Generates vulnerability assessment and courses of action analysis Identifies users & sources of narratives in real-time and assigns trust index ● Hurdles to acceptance of the proposed innovation ○ Need to navigate complex regulatory environments within the Department of Defense for Fedramp and compliance requirements, which can slow down or complicate the adoption for government customers.\n● Description of possible areas where your technology may be utilized or is under utilized ○ ○ ○ Special Operations - Information Operations / Influence Operations Department of Defense - Information Operations, Open-Source Intelligence Public Affairs Intelligence Community, Department of State, Department of Transportation, Department of Homeland Security",
        "28": "Market ● Analysis of market size and 1 and 5 year forecasted market share ○ 1 Year: ■ ■ Department of Defense: Special Operations 1% Market Share (70,000 Personnel) Commercial Sector: Hotel Industry $2M ARR ○ 5 Year: 10% ■ ■ Department of Defense; Special Operations 10% Market Share & 1% DoD Commercial Sector: Hotel Sector $13.2B ARR & Energy Sector $106M ARR ● Explanation of milestones and target dates of plan to obtain that market share ○ ○ ○ End of Q425: Secure 5 pilot contracts within DoD and 3 commercial contracts.\nEnd of Q127: Reach $5 million in revenue with 5+ contracts across DoD, other federal agencies, and commercial sectors.\nEnd of 2029: Expand to 10+ federal agency contracts and capture 10% of the commercial market segment.\n● What experience do you have with marketing to this target market?\n○ Professional connections in the Hotel industry to drive impactful initiatives and ensure success.\n● What commercialization strategy appears to be the best for bringing this product to the target market?\n○ Pilot with professional connections through DoD/SOF over the last 9 months ● What experience do you have with bringing products to market ○ ○ Tyson (CTO): 10+ years of technical experience; Achieved over $100MM annualized savings; Drove +6% Month over month growth at Zipwhip resulting in trigger of Twilio acquisition.\nAlex Moffitt (CEO): 10+ years of military experience securing $1.5M in DoD & DoS funding for deployed operations",
        "29": "Intellectual Property ● ● ● Codifying proprietary ‘workflows’; of which each workflow’s value is determined by experimentation over time.\nThis SBIR Phase 1 project intends to demonstrate the feasibility of composing these workflows modularly; however, composing them well, quickly, and with potential markup is considered Clara Copilot IP.\nTraining of ‘expert’ Agentic LLMs - special training of open-source Foundational Models for specific purposes can be integrated into specific workflows.\nThese models, once trained beyond their ‘Foundational’ open-source state will become Clara Copilot IP.\nCuration of Domain-Specific Open-Source data over time - as a part of building out our ‘publicly available information’ featureset, we intend to establish retention, aggregation, and archival policies to maximize our customers’ needs.\nThis data cannot be considered Clara Copilot IP per sé (as we may not hold the copyright of the data); however, we will leverage this as a competitive advantage baked into the cost of running a data-centric analytics platform.",
        "30": "Financing ● Plan for securing non-SBIR, private, or government funding necessary to enter low rate of production of anticipated technical solution ○ Government Funding: ■ Working to find a co-sponsor to support necessary funding for solution ● ● ● Continued attendance at ‘invite only’ government events (JIFX 24-3, JIFX 24-4, TIDE 2024, SOCOM Technical Experimentations, Thunderstorm, Innovative Solutions Forums) Engagement/support from SOCOM & SOF component stakeholder network - SOFWERX, SOCOM S&T, AFSOC, USASOC, MARSOC Pilot with end-users for feedback and letters of support ■ Venture Capital (Pre-seed raise) ● Describe your revenue stream generation to include but not limited to: ● Diluted funding for speed and scale of product development ○ Forecasted Revenue Stream: ■ ■ ■ Travel & Tourism industry enterprise subscriptions for AI Tool (monthly) Energy enterprise subscriptions for AI Tool (Monthly) Contracts with government stakeholders ● ● Initial with Special Operations Expand within the service branches",
        "31": "Assistance & Mentoring ● Plan for securing needed technical or business assistance through mentoring, partnering, or arrangements with government sponsored (e.g., SBIR funded Discretionary Technical and Business Assistance, etc.) Leveraging regional DoD Procurement Technical Assistance Centers ○ ○ SOFWERX / SOCOM tech tuesdays",
        "32": "Alexandria Moffitt, Clara Copilot AI Inc Oct 21, 2024 Oct 21, 2025"
    },
    "images": [
        {
            "page": 11,
            "image_file": "docNAC01FB745353c5b2755dc36ae877335da6757d02b68c12b725496c241c50db072e5817407299_page11_img1.png",
            "hash": "9f2bc5363580a5b5",
            "position": "Top Center"
        },
        {
            "page": 13,
            "image_file": "docNAC01FB745353c5b2755dc36ae877335da6757d02b68c12b725496c241c50db072e5817407299_page13_img1.png",
            "hash": "95634a9c4b964bce",
            "position": "Middle Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "claracopilot.ai",
        "name": "N/A",
        "phone": "N/A"
    }
}