{
    "filename": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Direct to Phase II Proposal Proposal Number: F2D-15327 Proposal Verification and Validation of software tools for materials and microstructure Title: characterization Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-D004 Firm Information Firm Name: Beacon Industries Inc Address: Website: UEI: DUNS: CAGE: 549 Cedar Street, Newington, CT 06111-1814 http://www.beacongp.com/ CDXXNKM674G5 001150986 32816 SBA SBC Identification Number: 002095183 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 70 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_002095183 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation:",
        "3": "• SBC_002095183.pdf 5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO YES YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [X] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [ ] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [X] Asian [ ] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Title Business Name Date",
        "4": "Yash Mirchandani Yash Mirchanda Engineering Manager Beacon Industries Inc 10/21/2021 ni Audit Information Summary: Has your Firm ever had a DCAA review?NO VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 24 Technical Abstract: Beacon Industries proposes an advanced, automated alloy testing and validation framework tailored to meet the rigorous demands of aerospace and defense applications.\nThis solution integrates cutting-edge machine learning and mutation testing within a real-time, automated workflow, enabling high-precision alloy analysis and predictive fatigue modeling.\nLeveraging our proprietary tools, such as AUnit for automated unit testing, μAlloy for mutation testing, and AlloyFL for fault localization, the proposed technology achieves unprecedented accuracy in evaluating alloy fatigue life, microstructural performance, and fault detection.\nThe framework will utilize high-performance computing resources, including NVIDIA GPUs and Intel Xeon processors, alongside specialized software like ANSYS for detailed material simulations and TensorFlow for model training.\nThrough automated testing protocols, Beacon’s solution performs real-time analysis, reducing evaluation times from days to mere hours.\nThis capability is essential for assessing advanced titanium alloys, such as Ti-6Al-4V, under high-stress conditions, providing reliable data for applications where material failure is not an option.\nIn addition to rigorous testing, the framework incorporates a seamless data integration system, enabling predictive modeling and simulation updates directly within the workflow.\nThe solution’s modular design also allows for scalability, supporting a wide range of alloy types and complex material compositions.\nBy automating the entire alloy testing cycle—from fault detection to real-time data analysis—Beacon’s framework not only enhances testing accuracy but also aligns with defense and aerospace quality standards, setting a new benchmark in alloy performance assessment.\nThis innovation holds potential for transformative improvements in alloy durability and operational reliability in extreme environments.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development:",
        "5": "DoD Application: High-Stress Alloy Testing for Jet Engine Components in Military Aircraft Durability Assessment for Titanium Alloys in Space-Based Defense Satellites Predictive Fatigue Modeling for Armored Vehicle Armor and Hull Materials Fault Localization and Repair Automation in Long-Duration Reconnaissance Satellites Real-Time Structural Health Monitoring for Missile Defense Systems Non-DoD Application: Fatigue Life Testing for Titanium Alloys in Commercial Aircraft Engines Predictive Maintenance of High-Stress Alloys in Civilian Space Missions Advanced Material Testing for Electric Vehicle Battery Enclosures Structural Integrity Testing for Critical Components in Power Generation Turbines Quality Assurance for High-Durability Alloys in High-Speed Rail Components Attention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: aerospace applications, defense applications, machine learning, mutation testing, fatigue modeling, fault detection, titanium alloys, predictive modeling VOL I - Proposal Certification Summary: 1.\nAt a minimum, at least half (50%) of the research and/or analytical work in Phase II will be carried out by your YES small business as defined by 13 C.F.R Section 701-705.\nThe numbers for this certification question are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work requirements are not met, a letter of explanation or written approval from the funding agreement officer must be uploaded.",
        "6": "Firm POW Subcontractor POW 100% 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES 3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES NO 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO 16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n25% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES VOL I - Contact Information Principal Investigator Name: Mr.\nYash Mirchandani Phone: (914) 525-3794",
        "7": "Email: yashm@beacongp.com Address: 549 Cedar Street, Newington, CT 06111 - 1814 Corporate Official Name: Mr.\nSuresh Mirchandani Phone: (914) 525-3797 Email: SureshM@beacongp.com Address: 549 Cedar Street,, Newington, CT 06111 - 1814 Authorized Contract Negotiator Name: Mr.\nSuresh Mirchandani Phone: (914) 525-3797 Email: SureshM@beacongp.com Address: 549 Cedar Street,, Newington, CT 06111 - 1814 Form Generated on 11/06/2024 11:42:47 AM",
        "8": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 (1) Table of Contents: Table of Contents (1) Table of Contents: ...................................................................................................................................\n1 (2) Glossary: ..................................................................................................................................................\n2 (3) Milestone Identification: .........................................................................................................................\n2 (4) Identification and Significance of the Problem or Opportunity: ..........................................................\n2 (5) Phase I Technical Objectives: ................................................................................................................\n7 (6) Work Plan: ..............................................................................................................................................\n7 (7) Deliverables: ..........................................................................................................................................\n15 (8) Related Work: ........................................................................................................................................\n15 (9) Commercialization Potential: ...............................................................................................................\n15 (10) Relationship with Future R/R&D Efforts: .........................................................................................\n18 D.\nKey Personnel: .......................................................................................................................................\n18 E.\nFacilities/Equipment: .............................................................................................................................\n19 F.\nConsultants/Subcontractors: .................................................................................................................\n20 G.\nPrior, Current, or Pending Support of Similar Proposals or Awards: ................................................\n20 1",
        "9": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 (2) Glossary: SDB = Small Diameter Bomb Ga₂O₃ = Gallium Oxide OFP = Operational Flight Program CNT = Carbon Nanotube CMBRE = Common Munitions Built-in-Test (BIT) Reprogramming Equipment EMI = Electromagnetic Interference TAU = Test Adapter Unit (3) Milestone Identification: Task Deliverable 1 M = 1 Month M1 M2 M3 M4 M5 M6 Sr.\nNo 1 2 Kickoff Task 1: Requirements Analysis and Interface Compatibility for CubeSat Integration 3 Task 2: Design and Testing of Ga₂O₃ DC- for Converter DC CMBRE Integration 4 Deliverable in detailed comprehensive A Requirements Analysis Report with CubeSat- specific needs, integration environmental outlining resilience, power, and thermal requirements essential for the effective Ga₂O₃ converter’s CubeSat performance applications.\nA Design Optimization Report detailing design configurations, power stability, thermal management, and EMI mitigation strategies.\nPerformance Testing Results showcasing efficiency, power stability, and EMI shielding under test conditions.\nA Stress confirming Test durability and compliance with CMBRE specifications for long- term military use.\nAnalysis the to adapt (4) Identification and Significance of Problem or Opportunity: Identification of the Problem: The current state-of- the-art CMBRE system operates on a base power supply of 115 VAC and relies on external AC-DC converters testing munitions and airframe systems, such as the BRU- 61B/A bomb rack.\nThis setup, while functional, introduces several the conversion process.\nEach stage of AC-DC conversion creates inherent voltage fluctuations and electrical noise, which not only degrade the quality of the power supplied but also impact the inefficiencies due this power for to Figure 1: The Currently Used CMBRE 2",
        "10": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 in and that adds ensure significant fault Voltage isolation and irregularities Figure 2: CMBRE and Its Accessories testing accuracy of processes.\nand interference are especially detrimental during critical tasks such as loading the Operational Flight Program (OFP) data, where precise and clean power delivery is crucial to maintain data integrity operational configurations are accurately loaded onto the system.\nThe external converters, by design, are susceptible to noise generation, which directly affects the quality and consistency of the diagnostic power supplied, leading to potential diagnostic inaccuracies and inconsistencies.\nFurthermore, the reliance on external AC-DC converters logistical complexity to the CMBRE system.\nThese converters, often bulky and challenging to maneuver, increase the overall weight and footprint of the testing setup.\nIn practical field environments, this bulk creates substantial drawbacks, as the converters are not only cumbersome to transport but also require additional setup time and space, complicating deployment fast-paced or constrained to manage additional settings.\nThe need equipment hinders the system’s adaptability and mobility, making it less suitable for rapid or remote deployments where logistical efficiency is paramount.\nMoreover, these bulky converters are susceptible to physical wear over time, which introduces another layer of maintenance and reliability concerns, especially when deployed in harsh or high-demand environments.\nThe design limitations of the current CMBRE also reflect in its lower efficiency and thermal management capabilities.\nThe AC-DC conversion process typically yields around 85% efficiency, with energy losses that manifest as additional heat generation.\nIn field applications where sustained power output is necessary, this heat build-up can strain the system, affecting its overall stability and risking overheating under prolonged use.\nThe current system’s limited capacity to dissipate this excess heat impacts its reliability and longevity, especially during high-temperature operations where effective thermal regulation is critical.\nAs a result, not only does this lead to increased power consumption, but it also necessitates regular maintenance cycles to address thermal degradation, a factor that impacts operational readiness and the long-term reliability of the system in rigorous military environments.\nSignificance of the Opportunity: Syrnatec introduces a groundbreaking solution with our high-performance Ga₂O₃ DC-DC converter, designed to deliver direct 270 VDC output without the need for traditional AC-DC conversion stages.\nThis converter utilizes Gallium Oxide (Ga₂O₃), a wide-bandgap semiconductor with a bandgap of 4.8 eV, compared to silicon’s 1.1 eV, allowing the system to operate efficiently across extreme voltage Figure 3: Flowchart of Graphene used in CNT 3",
        "11": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 and thermal ranges—up to 650 VDC and between 70°C to 150°C.\nThe unique properties of Ga₂O₃ enable this converter to provide high-density, ripple-free power, which is critical for military applications requiring compact, resilient designs.\nBy operating at a high frequency of 1 MHz, the converter minimizes the size of passive components such as inductors and capacitors, achieving a power density of up to 2 kW/kg, reducing overall size and weight and integrating smoothly into existing CMBRE infrastructure without external converters.\nThis direct high-voltage output meets military specifications for power delivery, providing stable and precise power essential for advanced diagnostics, fault isolation, and Operational Flight Program (OFP) data loading on munitions systems like the BRU-61B/A bomb rack.\nOur innovation delivers a stable, 270 VDC ripple-free output, overcoming the voltage fluctuations and noise commonly introduced by AC- DC conversions in traditional systems.\nThis direct DC configuration allows for 96-99% efficiency, minimizing energy loss and reducing heat output, a substantial improvement over the 85% efficiency typically achieved by legacy systems.\nThe elimination of intermediate conversion stages significantly reduces electrical noise, which can interfere with sensitive diagnostics and data transmission.\nWith stable, high-quality power aligned to onboard conditions, the converter enhances the reliability of pre-flight testing and ensures accurate fault isolation, a key requirement for the performance of munitions systems in critical operations.\nTo complement the converter, Syrnatec employs advanced CNT (carbon nanotube) and ene-infused silicone rubber cables, chosen for their exceptional electrical conductivity and thermal management properties.\nThe conductivity of these cables is up to 1,000 times higher than copper, allowing high current transmission at minimal resistance, crucial for a stable and efficient 270 VDC output.\nThis high-current capacity ensures consistent power over long distances without signal degradation.\nThe thermal conductivity of CNT and graphene is approximately five times greater than conventional materials, providing rapid heat dissipation and supporting the system’s stability in extended operations.\nThis advanced thermal for military is essential management applications, where sustained reliability is a priority.\nBy effectively mitigating heat buildup, the cabling system contributes to a longer operational lifespan for the CMBRE, minimizing maintenance demands and ensuring consistent performance in various operational settings.\nOur cables also enhance the system with exceptional electromagnetic interference (EMI) shielding, a critical requirement in military environments where high-noise conditions can compromise data integrity.\nGraphene’s EMI shielding capability protects against signal interference during crucial OFP data loading and testing procedures, preventing data corruption and ensuring high diagnostic accuracy.\nThis shielding property resolves a primary limitation of traditional systems, where AC-DC conversion-induced noise can affect testing reliability.\nSyrnatec’s EMI-protected cabling assures data integrity, which is essential in high- stakes testing environments, providing an extra layer of protection for mission-critical tasks.\nThe combination of Ga₂O₃ converter technology and CNT and graphene-infused cabling results in an exceptionally durable and resilient system.\nUnlike conventional silicon-based systems, which endure for in harsh approximately environments, is engineered for over nine years of reliable operation under demanding electrical and thermal extended operational lifespan not only reduces the Figure 5: Block Diagram for CMBRE which Include Test Adapter Unit (TAU) three years the Ga₂O₃ converter Figure 4: Our Proposed DC-DC Circuit conditions.\nThis 4",
        "12": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 frequency of replacement and maintenance cycles but also enhances overall system reliability, a crucial factor for continuous military readiness.\nThe durability and thermal resilience of the Ga₂O₃ technology allow the CMBRE to maintain high efficiency and performance without degradation, meeting the USAF’s long-term needs in challenging operational environments.\nSyrnatec’s innovative design introduces a compact, field-ready solution optimized for efficient deployment in diverse settings.\nThe high frequency switching capability allows a lightweight design that integrates directly into the CMBRE Test Adapter Unit (TAU) without requiring modifications or additional equipment.\nThis low-weight, compact form factor simplifies logistical demands, reducing setup time and enhancing portability, especially valuable for field operations where weight and mobility are essential.\nBy enabling direct 270 VDC testing power in a streamlined, plug-and-play design, the Syrnatec solution addresses the operational limitations of the current CMBRE system, offering military personnel a reliable, deployable, and accurate high-voltage testing capability.\nFeature Power Output Voltage Stability Electrical Noise Power Density Efficiency Thermal Management Durability (Operational Lifespan) EMI Shielding Logistics Footprint Field Deployment Proposed Syrnatec Technology Table 1: Current State of Art Vs Syrnatec Proposed Technology Current CMBRE System 115 VAC, requiring external AC-DC converters Direct 270 VDC output (no conversion required) Voltage fluctuations common due to AC- DC conversion High noise from AC- DC conversion ~1 kW/kg (low density due to bulky converters) ~85% efficiency (due to multiple conversion steps) Limited heat dissipation; higher risk of overheating ~3 years in harsh conditions Stable, ripple-free DC output at 270 VDC Minimal noise with direct DC output; high EMI shielding from CNT/graphene cables 2 kW/kg achievable with Ga2O3 (1 MHz switching frequency reduces component size) 96-99% efficiency with direct Ga2O3 conversion 5x thermal conductivity with CNT/graphene cables Up to 9 years (3x improvement) with Ga2O3 materials Limited EMI shielding; high risk of data interference Requires bulky external converters; difficult to transport Heavy and complex setup, not optimized for mobile use Superior EMI shielding with graphene-infused cables Compact, integrated solution fitting directly into CMBRE Lightweight and field-ready design with direct plug-and-play compatibility 5 Improvement Eliminates need for external converters, reducing power conversion steps Provides consistent voltage, improving diagnostic accuracy Enhances data integrity, reduces interference in OFP loading Reduces size, weight, and logistical footprint Improves energy efficiency, reducing heat and energy waste Maintains reliability during prolonged field testing Enhances lifespan, reducing replacement frequency and maintenance needs Protects critical OFP data and sensitive diagnostics from interference Simplifies transport and setup in field environments Increases deployability and usability in remote or austere settings",
        "13": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 Scenario: • F-35 Lightning II Preflight and Armament Validation: The F-35 requires precise, high-voltage testing of mission-critical armament systems like the BRU-61B/A bomb rack to ensure reliability and functionality without additional hardware or power conversion needs.\nOur Solution: Syrnatec’s Ga2O3 DC-DC converter, delivering direct 270 VDC output, integrates seamlessly into the F-35’s CMBRE system, enabling preflight testing of armament without bulky external converters.\nOur high-efficiency Ga2O3 converter, with a bandgap of 4.8 eV, operates efficiently under high temperature (70°C-150°C) and voltage (up to 650 VDC), providing a ripple-free and stable power source.\nThe CNT and graphene-infused cables ensure minimal resistance and I²R losses, maintaining consistent power with superior EMI shielding for reliable data transmission.\nThis solution replicates the F-35’s onboard power conditions precisely, ensuring accurate fault isolation in the BRU-61B/A bomb rack, optimizing preflight testing without increasing the logistics footprint.\n• Small Diameter Bomb (SDB) Deployment Readiness on F-15EX Eagle II: The F-15EX relies on rapid, accurate testing of SDB systems to ensure deployment readiness, especially under field conditions where bulky equipment hinders efficiency.\nOur Solution: By providing direct, 270 VDC output, our Ga2O3 DC-DC converter streamlines testing by eliminating intermediate AC-DC conversions, ensuring a smooth, consistent power source for the SDB’s BRU-61B/A rack.\nThe 1 MHz switching capability of the Ga2O3 converter reduces component size, enabling a lightweight and compact form factor that integrates directly into the CMBRE.\nThe CNT and graphene-enhanced cables support efficient, high-current transmission with reduced heat generation, thanks to their high thermal conductivity, allowing consistent testing across extended periods.\nThis high-density, low-loss power setup optimizes SDB readiness by ensuring high diagnostic accuracy and minimizing setup time, essential for rapid F-15EX deployment.\n• B-21 Raider Long-Range Strike Testing and Maintenance: The B-21 requires a stealth-compatible, compact testing solution to validate long-range munitions systems under precise power conditions, without compromising its low observability profile.\nOur Solution: Syrnatec’s Ga2O3 DC-DC converter, capable of delivering direct 270 VDC, integrates within the CMBRE for the B-21 Raider, matching onboard power conditions without additional power conversion.\nGa2O3’s wide bandgap enables operation in extreme environments, preserving efficiency and durability over years of high-stress use.\nThe 1 MHz frequency of the converter minimizes passive components like capacitors and inductors, ensuring a compact, low-weight form that avoids interfering with the Raider’s stealth profile.\nThe CNT and graphene-infused cables enhance EMI shielding, protecting munitions data from interference and enabling stealth-aligned diagnostic accuracy.\nThis provides the B-21 with reliable, field-ready testing that upholds stealth capabilities while meeting high- performance standards for long-range mission equipment.\n• MQ-9 Reaper UAS Remote Armament Testing: The MQ-9 Reaper needs a lightweight, field- compatible high-voltage testing solution for armament diagnostics in remote deployments with limited logistics support.\nOur Solution: Syrnatec’s Ga2O3 DC-DC converter delivers direct 270 VDC without requiring intermediate AC-DC conversion, providing consistent power for MQ-9 Reaper munitions testing in remote environments.\nThe high thermal resilience and energy efficiency of the Ga2O3 converter allow it to handle extreme temperature and voltage ranges, ensuring reliable performance even under field conditions.\nOur lightweight design integrates easily with CMBRE, reducing setup time and logistical complexity.\nThe CNT and graphene-infused cables maintain high-current capacity while minimizing heat and EMI, ensuring stable power for critical diagnostics in isolated areas.\nThis compact solution enables rapid, effective testing with minimal footprint, supporting the MQ-9’s flexibility and readiness in austere environments.\n• AC-130J Ghostrider Close Air Support (CAS) Pre-Mission Armament Verification: The AC-130J requires fast, accurate pre-mission verification of munitions under operational voltage conditions to ensure rapid deployment readiness in high-stakes CAS missions.\n6",
        "14": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 Our Solution: Our Ga2O3 DC-DC converter, integrated into the AC-130J’s CMBRE, provides a direct 270 VDC output that matches in-flight power conditions for pre-mission armament testing without external converters.\nThe high switching frequency of 1 MHz allows smaller passive components, maintaining a compact footprint that supports the AC-130J’s mobility.\nThe CNT and graphene-infused cables ensure high electrical conductivity and superior EMI shielding, preventing interference in critical data transfers.\nThis setup provides the AC-130J with rapid, field-compatible diagnostics, enabling CAS operations with reliable armament readiness and minimizing logistical drag, ensuring swift mission deployment when speed and accuracy are paramount.\n(5) Phase I Technical Objectives: Technical Objective 1: Deliver Direct, High-Voltage 270 VDC Output with Enhanced Stability: Provide a stable, ripple-free 270 VDC power source to the CMBRE, eliminating intermediate AC-DC conversion stages to ensure consistent diagnostic accuracy and reliable fault isolation for munitions systems.\nRisk: Potential Incompatibility with Existing CMBRE Interface Mitigation: Conduct thorough compatibility testing with the CMBRE’s Test Adapter Unit (TAU) to confirm seamless integration.\nDevelop adapter modules if necessary to ensure that the direct 270 VDC output aligns with current interface requirements without modification.\nTechnical Objective 2: Achieve High-Efficiency and High-Density Power Conversion with Ga₂O₃ Technology: Utilize Ga₂O₃’s wide bandgap properties to achieve 96-99% power conversion efficiency and up to 2 kW/kg power density at 1 MHz, reducing the overall system size and heat generation, suitable for compact and efficient field operations.\nRisk: Efficiency Degradation Under High Operational Stress Mitigation: Utilize Ga₂O₃’s high thermal and electrical tolerance and establish efficiency benchmarks across a range of environmental conditions.\nImplement monitoring systems to automatically adjust power output in real-time to sustain efficiency.\nTechnical Objective 3: Integrate Advanced Thermal and EMI Management with CNT and Graphene Cables: Employ CNT and graphene-infused cables to enhance thermal dissipation and provide high EMI shielding, ensuring system stability under prolonged use, preventing data interference, and maintaining data integrity during OFP loading in high-noise environments.\nRisk: Heat Accumulation from High Current in Conductive Cables Mitigation: Optimize cable length and layout to distribute current effectively, minimizing I²R losses.\nConduct temperature cycle testing to verify thermal resilience and integrate cooling mechanisms, if necessary, in high-power scenarios.\n(6) Work Plan: Scope: The major requirements and specifications for this Phase I effort include a comprehensive analysis of CubeSat integration needs for a Ga₂O₃ DC-DC converter, focusing on power, thermal, and environmental constraints.\nThis will involve evaluating interface requirements, conducting design optimization for CMBRE compatibility, and ensuring durability through thermal management and radiation hardening strategies.\nThe effort will also extend to the design and testing phase, with emphasis on achieving high power conversion efficiency, stable power output, and EMI shielding.\nTask 1: Requirements Analysis and Interface Compatibility for CubeSat Integration Objective: Define CubeSat power, thermal, and environmental requirements to ensure compatibility with the Ga₂O₃ DC-DC converter.\nAssess integration constraints and necessary design adjustments to meet CubeSat’s operational standards.\nEstablish foundational parameters for effective design and testing phases.\nSubtask 1.1: Power and Environmental Constraints Definition for CubeSat: In this subtask, the focus will be on a comprehensive analysis of the CubeSat’s operational power needs and the environmental conditions it faces in space.\nThis analysis will ensure that the Ga₂O₃ DC-DC converter is tailored to meet these stringent requirements while maintaining high efficiency and power 7",
        "15": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 low Earth orbit Figure 6: The Proposed DC-DC Circuit density.\nThe first step involves gathering and studying data from existing space-qualified power systems and CubeSat mission specifications.\nThis data will provide insight into the typical power loads, voltage ranges, and current demands that CubeSats encounter in (LEO) and other space environments.\nUsing advanced circuit simulation tools such as LTspice and PSIM, detailed models of the Ga₂O₃ DC-DC converter will be developed to simulate its behavior under varying power conditions.\nThese simulations will help analyze the converter's response to load fluctuations, power surges, and steady-state operations, providing a comprehensive understanding of its performance under real-world CubeSat scenarios.\nAdditionally, the analysis will include an evaluation of the power density, with a target of achieving up to 2 kW/kg, ensuring the system delivers sufficient power within the CubeSat’s limited space and weight constraints.\nThe subtask will also integrate insights from isolated power converter topologies, such as forward and flyback DC-DC converters, which are known for their ability to handle high-voltage and high-current operations while offering built-in isolation.\nThis aspect is critical for CubeSats that operate in environments prone to Single Event Effects (SEE), where high-energy particles can induce transient disturbances in electronic systems.\nBy simulating the Ga₂O₃ DC-DC converter using these topologies, the study will determine its capability to maintain stable operations during such events, thereby protecting the CubeSat's payloads and mission-critical electronics from potential disruptions.\nEnvironmental constraints such as temperature extremes and radiation exposure will be assessed using COMSOL Multiphysics and ANSYS Fluent to simulate the thermal behavior and radiation resilience of the Ga₂O₃ converter.\nSpace environments often expose CubeSats to temperature fluctuations that can range from -150°C in the shadow of the Earth to over 150°C when exposed to direct sunlight.\nThe simulations will help identify potential thermal hotspots and ensure that the converter can efficiently manage heat dissipation using integrated materials like CNT and graphene for enhanced thermal conductivity.\nAdditionally, Ga₂O₃’s inherent wide bandgap properties will be analyzed for their capability to withstand high-voltage conditions (up to 650 VDC) and maintain operational stability at elevated temperatures (up to 150°C).\nRadiation tolerance is another critical aspect of this analysis.\nCubeSats in LEO and beyond encounter high levels of ionizing radiation that can lead to Single Event Burnout (SEB) or gate rupture in semiconductor devices.\nThe subtask will include simulations using SPEOS by ANSYS to assess the Ga₂O₃ converter’s resilience to these effects, leveraging its molecular structure that provides inherent resistance to radiation- induced damage.\nThe results will be used to ensure the converter's components are robust enough to maintain consistent operation without degradation during long-duration space missions.\nBy the end of Subtask, the analysis will yield a thorough understanding of the CubeSat’s power and environmental requirements, confirm the Ga₂O₃ DC-DC converter’s ability to meet these demands, and establish key design parameters.\nThese results will inform subsequent tasks focused on interface design and integration, thermal management, and radiation hardening.\nThis subtask will lay the foundation for optimizing the converter for CubeSat applications, ensuring reliable performance in the harsh conditions of space.\nSuccess Criteria: Achieving a comprehensive analysis that verifies the Ga₂O₃ DC-DC converter’s ability to meet CubeSat power demands and endure operational temperature and radiation conditions without performance issues.\nSubtask 1.2: Interface Requirements and Ga₂O₃ Integration Alignment: This Subtask focuses on defining the electrical and mechanical interface requirements for integrating the Ga₂O₃ DC-DC converter into CubeSat platforms.\nThis subtask will ensure that the design is compatible with the unique constraints of CubeSats, including limited physical space, onboard power distribution 8",
        "16": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 placement framework.\nspecifications, and the need for high resilience under space conditions.\nThe goal is to align the Ga₂O₃ converter’s architecture with CubeSat standards while maintaining high-voltage and temperature tolerance (up to 650 VDC and 150°C).\nElectrical Interface Analysis: The first step in this subtask involves a detailed analysis of the CubeSat’s existing power delivery architecture, including input and output voltage requirements, current loads, and power bus configurations.\nThis analysis will be conducted using Altium Designer to create detailed circuit schematics and ensure that the Ga₂O₃ converter’s electrical configuration aligns with CubeSat standards.\nSpecial attention will be paid to the matching of voltage levels, current limits, and connection types to facilitate seamless integration.\nThe electrical interface design will also involve optimizing the control circuitry to support the high-frequency (1 MHz) capabilities of the Ga₂O₃ converter, which is essential for maintaining efficiency and reducing the size of passive components.\nPhysical and Mechanical Integration: CubeSats are highly compact, with strict limits on size and weight, typically following the standard CubeSat form factors (e.g., 1U, 3U, 6U).\nTo address these constraints, SolidWorks or Autodesk Fusion 360 will be employed to create 3D models of the Ga₂O₃ DC-DC converter and simulate its placement within the The CubeSat mechanical design will ensure that the converter fits within the available without space interfering with other critical components.\nThis modeling process will involve assessing component for optimal heat distribution and structural support, ensuring that the converter’s integration does not compromise the CubeSat’s mechanical integrity or interfere with payload functions.\nEMI Considerations: High frequency switching in power converters can generate electromagnetic interference (EMI), which poses a significant challenge in small satellite applications where sensitive communication and control systems coexist in a compact space.\nCOMSOL Multiphysics and ANSYS Electronics Desktop will be used to model and simulate the electromagnetic behavior of the Ga₂O₃ converter.\nThe objective is to identify potential sources of EMI and implement shielding techniques to mitigate these effects.\nThe integration plan will specify the use of CNT and graphene composites, known for their superior EMI shielding properties, to encase critical sections of the converter.\nThis shielding will prevent high-frequency noise from affecting CubeSat communication and sensor systems, ensuring reliable operation across the entire satellite.\nThermal Interface Specifications: Due to the high-power density of the Ga₂O₃ converter, effective thermal management is crucial.\nThe subtask will include defining thermal interface materials and configurations that align with CubeSat’s cooling capabilities.\nThermal simulations conducted in ANSYS Workbench will help identify the best placement for heat sinks or conductive paths within the CubeSat structure.\nCNT and graphene-infused silicone rubber will be assessed for use as thermal interface materials due to their excellent heat transfer properties.\nThese materials will aid in spreading and dissipating heat efficiently, preventing localized hotspots and maintaining the converter’s performance across varying operational loads.\nMechanical and Electrical Adjustments: If the Ga₂O₃ converter’s original design requires modifications to fit CubeSat constraints, this subtask will outline specific changes to be made.\nThese adjustments may include miniaturizing certain components or redesigning the layout to optimize space utilization.\nFor electrical adjustments, the control logic may be Figure 7: Fully Zero Voltage Switching.\n9",
        "17": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 refined to accommodate the CubeSat’s onboard power management system, ensuring seamless integration without overloading or undersupplying other subsystems.\nSuccess Criteria: Developing detailed electrical and mechanical interface specifications that ensure seamless integration of the Ga₂O₃ converter within CubeSat systems while maintaining EMI compliance and proper physical fit.\nwhere efficient is vital Figure 8: Modeling and simulation approach.\nSubtask 1.3: Initial Specification of Thermal Management and Radiation Hardening: This Subtask focuses on developing initial specifications for managing the thermal profile and enhancing the radiation tolerance of the Ga₂O₃ DC-DC converter to ensure its sustained performance in CubeSat operations.\nThis task is essential as in extreme CubeSats are often deployed thermal environments management and radiation resilience are critical for long-term functionality.\nThe specifications will guide the selection and integration of advanced materials and design features to bolster the converter's reliability under space conditions.\nThermal Management Strategy: Given the high-power density and efficiency goals (up to 2 kW/kg) of the Ga₂O₃ DC-DC converter, effective thermal management to prevent overheating and maintain consistent operation.\nThe subtask will involve using COMSOL Multiphysics and ANSYS Workbench for detailed thermal simulations.\nThese tools will model the heat distribution across the converter and predict temperature gradients under various operational loads.\nThe simulations will help identify potential hotspots and determine the most effective thermal paths for heat dissipation.\nThe thermal management plan will integrate materials known for their superior thermal conductivity, specifically CNT (carbon nanotube) and graphene-based composites, which exhibit thermal conductivities up to five times higher than conventional materials.\nThese materials will be considered for use in thermal interface layers and as additives in silicone rubber for flexible, high-efficiency heat transfer solutions.\nBy incorporating CNT and graphene, the converter will benefit from improved heat spread and dissipation, allowing it to maintain optimal temperatures during continuous high-power operation.\nThese materials will also be evaluated using ANSYS Electronics Desktop to confirm their behavior in conjunction with the Ga₂O₃ semiconductor.\nThe specification will outline the use of thermal interface materials (TIMs) strategically placed between the converter and the CubeSat’s structural elements to maximize heat transfer.\nIt will also propose configurations for potential passive cooling solutions, such as heat sinks or thermal straps, made with CNT- infused composites to enhance conduction while maintaining a lightweight profile essential for CubeSats.\nRadiation Hardening Approach: The space environment presents significant radiation challenges, including exposure to high-energy particles that can lead to Single Event Effects (SEE) such as Single Event Burnout (SEB) and Single Event Gate Rupture (SEGR).\nTo address this, the subtask will develop specifications for radiation-hardening techniques to ensure the Ga₂O₃ DC-DC converter maintains integrity during missions in Low Earth Orbit (LEO) and higher radiation exposure zones.\nThe Ga₂O₃ material itself provides inherent advantages due to its wide bandgap properties, which contribute to higher breakdown voltage and superior resistance to radiation-induced damage compared to traditional silicon-based semiconductors.\nThis subtask will involve simulations using SPEOS by ANSYS and RadHard software to model the effects of space radiation on the Ga₂O₃ converter and validate its tolerance under ionizing conditions.\nRadiation-hardening strategies will include specifying the use of redundant Ga₂O₃ MOSFETs in critical circuit paths to provide fail-safe operation in case of transient radiation-induced failures.\nShielding techniques using graphene-based materials will be explored, as graphene’s atomic structure offers 10",
        "18": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 significant protection against radiation penetration while being lightweight and structurally adaptable.\nThe combination of inherent material resilience and added shielding will help mitigate risks of SEB and SEGR, ensuring the converter’s long-term operational stability.\nComprehensive Specifications Development: The subtask will also produce initial specifications for the integration of CNT and graphene as part of the converter’s radiation shielding.\nThese specifications will define how these materials can be coatings, applied—either embedded structural layers, or components—to enhance overall radiation hardness without adding significant weight or volume.\nThe use of MATLAB for algorithmic modeling will provide additional analysis on heat transfer and degradation rates under simulated space radiation conditions, further refining the thermal and radiation specifications.\nSuccess Criteria: Producing robust thermal and radiation management specifications utilizing CNT and graphene composites that ensure converter stability in space conditions and resistance to SEB and SEGR.\nDeliverable: Figure 9: Simulation results of the proposed module as • A detailed Requirements Analysis Report with CubeSat-specific integration needs, outlining environmental resilience, power, and thermal requirements essential for the Ga₂O₃ converter’s effective performance in CubeSat applications.\nTask 2: Design and Testing of Ga₂O₃ DC-DC Converter for CMBRE Integration Objective: To design and conduct rigorous testing on the Ga₂O₃ DC-DC converter using CNT- and graphene-infused silicone rubber cables.\nThis phase emphasizes validating critical metrics, including power stability, efficiency, thermal dissipation, and electromagnetic interference (EMI) shielding.\nSubtask 2.1: Design Optimization of Ga₂O₃ Converter for Power and Thermal Performance Subtask 2.1 aims to refine the design of the Ga₂O₃ DC-DC converter to achieve maximum power conversion efficiency, stable voltage output, and optimized thermal performance, aligning with the stringent requirements of CMBRE (Common Munitions Built-In Test/Reprogramming Equipment) integration.\nThis task involves a multi-faceted approach that utilizes advanced simulation tools, material integration, and design optimization techniques to ensure the converter meets or exceeds the performance targets of 96-99% efficiency and a stable 270 VDC output.\nHigh-Efficiency Design Focus: The primary objective of this subtask is to fine-tune the Ga₂O₃ DC-DC converter's architecture to ensure it operates at peak efficiency.\nThis will involve using SPICE-based simulators such as LTspice and PSIM to conduct detailed circuit simulations under various load conditions, assessing how the converter performs across different voltage and current ranges.\nThese simulations will help identify areas where component configurations can be improved to minimize power losses and maximize energy transfer.\nTo achieve the high switching frequency required (1 MHz), the design will leverage Ga₂O₃’s wide bandgap properties, which enable efficient operation at high voltages and temperatures while maintaining minimal heat generation.\nThis characteristic is essential for reducing the size of passive components like inductors and capacitors, thereby achieving a compact design with high power density (targeting up to 2 kW/kg).\nThe circuit layout will be optimized using Altium Designer to ensure the minimal parasitic inductance and capacitance that can impact switching performance.\nThermal Performance Optimization: Thermal management is a critical consideration due to the high power density of the Ga₂O₃ converter.\nAdvanced thermal simulation tools like COMSOL Multiphysics 11",
        "19": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 Figure 10: Sensor for monitoring on a rubber seal and ANSYS Workbench will be employed to model the converter’s thermal profile and predict temperature distributions under continuous operation and peak loads.\nThese simulations will help pinpoint potential thermal hotspots and inform the placement of heat-dissipating elements to ensure even temperature distribution.\nIntegration of CNT and Graphene-Infused Cables: A significant aspect of this optimization subtask is the integration of CNT (carbon nanotube) and graphene-infused silicone rubber cables, which provide superior thermal conductivity and minimal resistive losses.\nThese cables will be modeled using ANSYS Electronics Desktop to evaluate their thermal behavior and electrical conductivity when used in conjunction with the Ga₂O₃ converter.\nThe incorporation of these materials is designed to enhance heat dissipation and maintain power transmission efficiency, which is particularly important for sustained high-power operations.\nThe use of CNT and graphene ensures that the converter remains within temperatures and does not experience safe operating performance degradation due to thermal buildup.\nComponent Configuration and Control Circuitry Refinement: To maintain stable power output at 270 VDC, the Ga₂O₃ DC-DC converter’s control circuitry will be refined to support precise regulation and minimal output fluctuations.\nThis refinement will involve designing feedback and control loops using MATLAB/Simulink, allowing for advanced control algorithms that ensure fast response times and stable performance even under fluctuating load conditions.\nThe high-frequency operation of the converter will necessitate careful selection of Ga₂O₃ MOSFETs and diodes, optimized for rapid switching and low on- resistance, to maintain high efficiency while minimizing switching losses.\nIterative Testing and Design Adjustments: The optimization process will be iterative, with continuous testing and validation to refine the converter’s performance.\nPrototyping tools and LabVIEW-integrated test benches will be used to conduct preliminary bench tests, simulating the operating conditions that the converter will face in CMBRE applications.\nThese tests will focus on evaluating power efficiency, thermal stability, and voltage consistency.\nData collected during these tests will guide design adjustments, such as reconfiguring component layouts or modifying cooling paths, to further enhance the converter’s performance.\nSuccess Criteria: Finalizing the converter design to achieve 96-99% efficiency, stable 270 VDC output, and effective thermal management as validated through simulation results.\nSubtask 2.2: Laboratory Testing for Power Stability, Efficiency, and Thermal Dissipation This Subtask involves a series of comprehensive laboratory tests designed to validate the Ga₂O₃ DC-DC converter’s performance in terms of power stability, efficiency, and thermal dissipation.\nThis phase is critical to ensuring that the optimized converter design meets the stringent operational requirements for CMBRE integration.\nThe objective is to verify that the converter delivers reliable power output, maintains high efficiency under varying load conditions, and effectively dissipates heat to prevent performance degradation during prolonged use.\nPower Stability Testing: To confirm power stability, the converter will be subjected to a range of operational voltage and current loads using high-power electronic load testers and precision power supplies.\nThe aim is to ensure that the converter can maintain a consistent 270 VDC output without significant voltage ripple or fluctuation, even under transient and dynamic load changes.\nTesting will be controlled and monitored using NI LabVIEW to automate the process, collect data, and log power performance metrics in real-time.\nThe test setup will include oscilloscopes and high-precision multimeters for voltage and current measurements, ensuring that output stability meets the targeted specifications.\nThis is particularly important for CMBRE applications where precise, stable power is necessary for accurate diagnostic and testing operations.\n12",
        "20": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 Efficiency Testing Under High-Load Conditions: The converter’s efficiency will be tested by running it under various load conditions that simulate actual field operations.\nThe testing will involve gradually increasing the load from low to high power levels to evaluate the converter’s ability to sustain its targeted efficiency range of 96-99%.\nPower analyzers equipped with advanced measurement capabilities will be used to calculate the efficiency by comparing input and output power.\nThese tests will help identify any inefficiencies or power losses that may arise under maximum load and will provide insights into potential areas for further refinement.\nEfficiency testing will also incorporate data acquisition systems (DAQ) synchronized with LabVIEW to capture real-time performance data, allowing for precise adjustments and validation of the converter’s power regulation mechanisms.\nThe results will confirm whether the Ga₂O₃ converter can maintain high efficiency during extended operations, an essential characteristic for minimizing heat generation and ensuring the converter’s long-term reliability in the field.\nThermal Dissipation Evaluation: Thermal management is a crucial part of the converter’s performance validation, especially given the high-power density required for military applications.\nThe thermal dissipation evaluation will be conducted using infrared (IR) thermal cameras and thermal sensors to monitor the temperature distribution across the converter during continuous high-power operation.\nThe integration of CNT and graphene-infused silicone rubber cables will be tested to assess their effectiveness in conducting and dissipating heat.\nCOMSOL Multiphysics will be used to simulate the thermal behavior of the converter in parallel with real-time testing to compare modeled data with observed temperature profiles.\nThis will ensure that the thermal management strategies developed during the design phase are effective in practice.\nThe converter will be placed in an environmental chamber capable of simulating various ambient conditions to test its performance under temperature extremes, as it would experience in field operations.\nLoad Cycling and Sustained Operation Testing: To simulate real-world usage, the converter will be subjected to load cycling, where it switches between different power levels to test how well it handles changes in load over time.\nSustained operation testing will involve running the converter at high load continuously for an extended period to evaluate thermal buildup and verify that the integrated thermal management components, including the CNT and graphene-enhanced cables, function as intended.\nData Analysis and Iterative Improvements: Data gathered during these tests will be analyzed using MATLAB to create detailed plots of power stability, efficiency trends, and temperature changes.\nAny anomalies or deviations from expected performance metrics will be investigated, and the findings will inform iterative design adjustments.\nThese adjustments may include minor modifications to the control circuitry, thermal interface materials, or component placement to further optimize the converter’s performance.\nSuccess Criteria: Demonstrating that the Ga₂O₃ converter maintains consistent power stability, achieves efficiency targets under various load conditions, and operates within safe temperature ranges during sustained testing.\nSubtask 2.3: Electromagnetic Interference (EMI) and Stress Testing In this Subtask it is designed to ensure that the Ga₂O₃ DC-DC converter meets stringent military standards for electromagnetic compatibility and long-term durability under simulated field conditions.\nThis subtask involves executing a series of detailed EMI tests and mechanical stress evaluations to verify that the converter can operate without interference and withstand the mechanical and thermal stresses typical of military and space applications.\nThe objective is to validate the converter’s shielding effectiveness, structural integrity, and reliability under high-frequency switching and environmental challenges.\nElectromagnetic Interference (EMI) Testing: EMI testing is critical to confirm that the Ga₂O₃ DC-DC converter does not emit or suffer from interference that could disrupt other sensitive equipment, particularly in the high-noise environments typical of CMBRE operations.\nThis testing will be conducted using specialized EMI/EMC test chambers equipped with advanced spectrum analyzers, such as those provided by Keysight Technologies.\nThese analyzers will measure both conducted and radiated emissions from the converter to ensure compliance with military EMI standards (e.g., MIL-STD-461).\n13",
        "21": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 for and their model chosen strategies integration of CNT Figure 11: Mechanism of electromagnetic wave propagation from the specimen investigated (carbon The nanotube) graphene-infused silicone rubber cables will be a focal point of these tests, as these materials superior are electromagnetic shielding properties.\nSimulations using ANSYS HFSS Structure (High-Frequency the will Simulator) electromagnetic field behavior and predict areas of potential interference.\nThe results will guide adjustments to if necessary, shielding ensuring that the converter's design prevents emissions from affecting surrounding systems and remains immune to external EMI.\nEMI Shielding Effectiveness Evaluation: Testing will involve placing the converter in high-noise environments to assess how well the CNT and graphene-based shielding performs in preventing signal interference during high-frequency switching operations.\nThe shielding effectiveness will be measured in decibels (dB) to confirm that it meets the required attenuation levels for military applications.\nAdditional EMI suppression techniques, such as the use of ferrite beads and grounding strategies, will be tested and optimized as part of the process.\nStress Testing for Mechanical and Environmental Durability: Stress testing will assess the mechanical resilience of the Ga₂O₃ DC-DC converter to simulate the physical and environmental challenges encountered during launch, operation, and prolonged use in military settings.\nEnvironmental chambers capable of simulating temperature extremes and rapid thermal cycling will be used to replicate the high- heat and rapid temperature changes experienced during field deployment.\nThis ensures that the thermal management strategies, including the CNT and graphene-enhanced cables, maintain their efficacy under variable thermal loads.\nVibration and Shock Testing: The converter will be subjected to vibration and shock testing using electrodynamic shakers to simulate the mechanical stresses of launch and deployment.\nThis testing ensures that all components of the converter, including the power module and integrated materials, maintain structural integrity and continue functioning as designed.\nThe converter’s ability to withstand vibration at frequencies that match those encountered during flight and transport will be assessed.\nData from accelerometers placed on the converter will be captured and analyzed using LabVIEW or similar data acquisition software to ensure that all performance metrics remain within acceptable ranges.\nThermal Cycling and Electrical Stress Testing: Thermal cycling tests will involve subjecting the converter to repeated cycles of heating and cooling, reflecting real-world conditions such as rapid temperature transitions during orbital transitions or field use.\nElectrical stress testing will push the converter to operate at and beyond its rated voltage and current limits to verify that Ga₂O₃’s inherent properties effectively prevent breakdowns, such as Single Event Burnout (SEB) and Single Event Gate Rupture (SEGR).\nSPEOS by ANSYS and MATLAB will be used to simulate the effects of these stresses on the converter's electrical components, verifying their durability and ensuring that the design meets the targeted lifespan of at least nine years under operational conditions.\nIterative Refinement and Analysis: Based on the findings from the EMI and stress tests, any observed deficiencies will be documented, and iterative design improvements will be proposed.\nIf required, adjustments to the shielding, mechanical reinforcements, or thermal strategies will be made to optimize the converter for better performance.\nThe test data will be analyzed to confirm compliance with military-grade durability standards, ensuring that the converter can reliably perform under extreme conditions without degradation.\n14",
        "22": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 Success Criteria: Ensuring the converter passes EMI compliance tests and endures stress simulations, maintaining operational integrity and supporting a projected nine-year lifespan under simulated field conditions.\nDeliverables: • Design Optimization Report documenting finalized design configurations, power stability parameters, thermal management strategies, and EMI mitigation techniques.\n• Performance Testing Results detailing efficiency metrics, power stability, and EMI shielding effectiveness across tested conditions.\n• Stress Test Analysis to validate durability and reliability, supporting the converter’s resilience in military testing environments and its long-term operability under CMBRE specifications.\n(7) Deliverables: Task Requirements Analysis and Compatibility Interface Requirements Definition Thermal and Radiation Suitability Assessment Initial Design Adaptation Deliverable Requirements Analysis Report Interface Compatibility Specifications Thermal and Radiation Management Plan Preliminary Design Outline Integration Description A comprehensive report detailing CubeSat’s power, thermal, and environmental requirements to ensure compatibility with the Ga₂O₃ DC-DC converter.\nA document outlining necessary electrical and mechanical interface adjustments for integration within CubeSat’s limited space and power systems.\nSpecifications for thermal dissipation and radiation hardening techniques, utilizing CNT and graphene materials to meet CubeSat’s high-radiation, space- constrained environment.\nAn outline of the initial design adaptations for the Ga₂O₃ converter, addressing size, power stability, and resilience requirements for CubeSat integration.\n(8) Related Work: Syrnatec, Inc., a women-owned, ITAR- compliant small business with expertise in satellite power systems, has developed a novel, low-SWaP, high-efficiency Electrical Power System (EPS) for deep space missions.\nOur EPS features a radiation-hardened Ga₂O₃- based DC-DC converter, tailored to meet the demanding power requirements of LEO and GEO satellite missions.\nTo maximize solar energy capture, we integrate high-efficiency (3AP)PbI₄ perovskite solar cells with a 24.8% power conversion rate alongside high-density Li-metal batteries, enhancing energy storage and system resilience.\nOur EPS also includes a Maximum Power Point Tracking (MPPT) algorithm using Fuzzy Logic Control (FLC) for real-time voltage adjustments, which maintains optimal power output despite fluctuations in solar irradiance and temperature.\nThis intelligent MPPT approach ensures robust, stable power tracking and increased efficiency, positioning Syrnatec’s EPS as a durable and high-performing solution for long- duration satellite power applications.\nFigure 12: Syrnatec EPS System (9) Commercialization Potential: 9.1 Commercial Potential Quantitative Market Analysis Major electrical power telecommunication systems and next generation vehicles will need efficient power conversion system for their various loads operating on field.\nProposed 15",
        "23": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 for various DC-DC converter will meet this requirement.\nSyrnatec will also approach DLA users, Prime contractors with this product.\nSystem with modified cooling mechanism (air-cooled) will also be developed to reduce product cost and meet commercial market demand (identified applications include Uninterrupted power supply for Data centers, telecom infrastructure, Electric, hybrid and autonomous vehicles are few of the examples.\nWBG based automotive Power converter markets was estimated at US$ 4.9 billion in 2022 and may expand to US$ 6.4 billion by 2027 growing at 5.1 % CAGR.\nMarket is majorly driven by E-Vehicles and Autonomous vehicles.\nThere is significant interest in exploring WBG based power converters for Defense applications as well.\nPresent Manufacturers of of SiC and GaN components include Vicor Corp, Wolfspeed, Infineon, ST Microelectronics, GeneSiC.\nHi reliability SiC/ GaN based Power converters are supported by vendors like SynGE Aviation, Raytheon, etc.\nThese are majorly custom designed system.\nHaving a standard COTS model for the product will add leverage to Syrnatec offerings.\n9.2 Description of Product(s) and/or System Application(s) Syrnatec proposes to develop a 10 kW wide- bandgap converter, (WBG) DC-DC employing a parallel-cascaded 10 kW design.\nThe system will be scalable to allow adjustments in power ratings, making it adaptable operational requirements.\nDoD Applications: The 10 kW WBG DC-DC converter will be highly relevant for U.S.\nDepartment of Defense (DoD) initiatives, particularly those involving advanced power systems for military operations.\nSpecific U.S.\nAir Force platforms that could benefit include tactical aircraft and UAVs, where efficient power conversion is crucial for avionics and propulsion systems.\nFor example, the converter could support the F-35 Lightning II by delivering reliable power for onboard radar and electronic warfare systems, optimizing the power-to-weight ratio for better performance.\nSimilarly, it could enhance the B-21 Raider's advanced electrical systems for long-range missions.\nThis converter also suits ground-based military applications, such as mobile command centers and deployable communication units, providing scalable, high-efficiency power essential for field operations and radar installations.\nNon-DoD Applications: In commercial and industrial sectors, the 10 kW WBG DC-DC converter can serve multiple purposes where robust, high-power systems are needed.\nFor example, it can be integrated into the power management systems of off-highway and mining vehicles, allowing for reliable and efficient operation in harsh conditions.\nConstruction vehicles that rely on heavy-duty electrical systems could benefit from the the converter’s power efficiency, enabling better performance and telecommunications industry, the converter could be utilized to provide consistent power to remote infrastructure sites, ensuring reliable data transmission and operation.\nIt is also suitable for EV charging stations, where high-power, efficient energy conversion is needed to reduce charging times and enhance the overall energy management system.\nRenewable energy conversion, such as integrating solar panels into grid systems, can use this converter to improve power throughput and storage efficiency.\nAdditionally, in the aviation industry, electrified propulsion systems on commercial aircraft could implement the 10 kW WBG converter to support sustainable flight technology, reducing fuel consumption and emissions.\n(9.3) Business Model(s)/Procurement Mechanism(s) Syrnatec will develop, prototype, demonstrate and commercialize these converters in the US and International customers.\nSyrnatec’s relationship with suppliers of WBG raw materials supplier Novel Crystal ensures availability of the components for long term contracts and mass production is performed in house in Connecticut.\nIntegration of the PCB will be done by Syrnatec.\nFunctional, electrical and lot qualification tests will be carried out at Syrnatec’s facility or at DLA certified laboratories.\nSyrnatec’s business model includes business certifications such as AS9100 and product certifications such as MIL- Figure 13: CAGR for DC-DC reduced downtime.\nIn 16",
        "24": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 STD-883; Syrnatec’s team has extensive experience, and have obtained all the necessary manufacturing certifications.\n(9.4) Marketing Expertise: Syrnatec Inc.\nis an ITAR-compliant, HUBZone, minority woman-owned small business.\nThe management has 30+ years of experience in Semiconductor domain servicing global defense, avionics and Space customer globally.\nSyrnatec has strong marketing team familiar with commercialization process of hi-end electronics, mechanical and optical products.\nMarketing teams are in strategic locations in Asia, EU and the US to efficiently carry out Commercialization activity.\nSyrnatec also has design team with more than 100,000 manhours of experience in design and fabrication of hi-reliability Semiconductor, Microwave, and optical products.\nWe have already formed key strategic alliances to accelerate commercialization efforts, working closely with partners like TechSolutions Consulting and Dawnbreaker Inc.\nto identify and engage potential customers within the U.S.\nand European markets.\n(9.5) Competition and Advantages of Syrnatec’s Technique Competition: Current solutions in the market for high-power DC-DC converters primarily come from companies leveraging silicon (Si) or silicon carbide (SiC) technology.\nKey players include large power electronics manufacturers such as Infineon Technologies, Texas Instruments, and Vicor Corporation.\nWhile these solutions provide reliable power conversion, they often come with limitations in efficiency and power density when subjected to high-voltage and high-temperature operations.\nSilicon-based converters generally suffer from lower thermal tolerance and reduced efficiency in demanding conditions, while SiC- based converters offer improvements but still face limitations in power density and long-term thermal management.\nWhy Our Solution is Better: Syrnatec’s approach using wide-bandgap (WBG) Ga₂O₃ (Gallium Oxide) technology offers significant advantages over existing Si and SiC-based converters.\nHere’s why our technique outperforms current solutions: • Higher Power Density: Ga₂O₃ technology supports power densities up to 2 kW/kg, surpassing the limits of silicon and even SiC converters.\nThis allows for compact, lightweight designs, which are particularly beneficial for applications in both DoD platforms like UAVs and tactical aircraft, and non- DoD sectors such as construction and mining vehicles where space and weight are critical.\n• Superior Thermal Performance: The wide bandgap (4.8 eV) of Ga₂O₃ provides excellent thermal stability, enabling operation at higher temperatures (up to 150°C) without efficiency losses.\nThis is a key advantage for military applications like the F-35 and B-21 Raider, where sustained performance under extreme conditions is necessary.\nCompetitors using SiC technology still face challenges when 17",
        "25": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 exposed to continuous high thermal loads, whereas Ga₂O₃’s properties inherently support better heat dissipation.\n• Enhanced Efficiency: Our Ga₂O₃ DC-DC converter achieves 96-99% efficiency, surpassing the typical performance metrics of silicon-based systems and even many SiC implementations.\nThis high efficiency translates into lower energy losses and reduced operational costs, which is valuable for applications requiring constant high power, such as telecom infrastructure and renewable energy systems.\n• • Scalability and Adaptability: The modular design of Syrnatec’s 10 kW converter, which can be cascaded in parallel to scale power ratings, offers greater flexibility than many current market solutions.\nThis makes it an ideal fit for applications ranging from high-power military systems to commercial aviation and renewable energy sectors that need adaptable power solutions.\nInnovative Material Integration: The incorporation of CNT and graphene-infused silicone rubber cables in our converter design enhances both electrical conductivity and thermal management.\nThese materials outperform traditional copper in conductivity and provide superior heat dissipation, giving our converters an edge over conventional designs.\nThis innovation ensures that our converters maintain efficiency and reliability even during prolonged, high-power operation—critical for the DoD’s mobile command centers and non-DoD applications like electric vehicle (EV) charging stations and heavy- duty industrial vehicles.\n(10) Relationship with Future R/R&D Efforts: The successful completion of Phase I will provide a comprehensive analysis and preliminary design that confirms the feasibility of integrating a Ga₂O₃ DC-DC converter within the CMBRE system.\nThis phase will yield detailed specifications and interface requirements addressing critical aspects such as power stability, thermal management, and EMI shielding.\nThese results will serve as the foundation for Phase II, transitioning from analysis to practical development and testing of the integrated solution.\nThe anticipated outcome is a reliable, high-efficiency power system capable of meeting stringent USAF operational standards, setting the stage for broader application across other military platforms.\nPhase II will build upon the findings of Phase I by refining the design, developing prototypes, and conducting rigorous testing to validate system performance under real-world conditions.\nThis phase may involve the delivery of a CMBRE system for modification as GFE or access to one for developmental testing and design validation.\nFor instance, Phase II will illustrate how the Ga₂O₃ DC-DC converter can maintain high power efficiency and compactness, facilitating quick and efficient diagnostics for advanced airframes, such as the F-35, and reducing logistical burdens in field operations.\nAdditionally, testing will showcase its adaptability and resilience, essential for diverse mission scenarios.\nBeyond munitions testing, Phase II holds broader significance for future research and Air Force applications.\nFor example, the Ga₂O₃ DC-DC converter’s high-power density and thermal management capabilities can be leveraged for use in airborne radar systems, which require stable and high-quality power for continuous operation and precise detection capabilities.\nImplementing this technology in radar systems could enhance their reliability and performance during extended missions, ensuring consistent data flow and operational accuracy.\nFurther research stemming from Phase II could explore integrating this advanced power technology into UAVs, where low weight and high-power density are critical for maximizing mission range and endurance.\nFor example, employing the Ga₂O₃-based system in UAVs could support extended flight durations and power-intensive payloads like advanced sensor arrays and communication equipment.\nThis approach could also be applied to mobile ground units that require reliable power for sensor platforms and real-time data analysis.\nThe successful implementation in these platforms would demonstrate the versatility and strategic value of Ga₂O₃-based power systems, positioning them as key enablers for advanced Air Force operations across multiple mission profiles.\nD.\nKey Personnel: 1.\nMr.\nYash Mirchandani (Principal Investigator): 18",
        "26": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 Mr.\nYash Mirchandani brings over a decade of experience in operations, product development, and technical sales, particularly in leading the development and manufacturing of aerospace and defense technologies.\nHis expertise includes working with governmental agencies across the US, Europe, and Asia, with significant contributions to flight safety hardware and space-grade microelectronics.\nMr.\nMirchandani has extensive knowledge in managing projects that integrate novel technologies with critical military systems.\nThis background is highly relevant for overseeing the adaptation of the Ga₂O₃ DC-DC converter for CMBRE (Common Munitions Built-In Test/Reprogramming Equipment), where precise power control and reliability are paramount.\nHis strong network within the defense and aerospace markets, including partnerships with major OEMs like GE Aviation, will be instrumental in aligning the project with current military standards and operational needs.\nAcademic Background: Holds a B.S.\nin Mechanical Engineering, an M.S.\nin Space Systems Engineering, and is a certified Quality Representative trained in AS13001 and AS9100.\n2.\nDr.\nDavid Barnhart (Aerospace and Systems Integration Expert): Dr.\nDavid Barnhart is a seasoned professional in space system integration and engineering, holding roles as a Research Professor at USC and Director/Co-Founder of the USC Space Engineering Research Center (SERC).\nHis extensive experience with advanced aerospace projects, including his tenure as a senior project manager at DARPA, has involved pioneering cellular spacecraft morphologies and modular system architectures.\nThis expertise will be critical for the system-level integration of the Ga₂O₃ DC-DC converter within the CMBRE framework, ensuring that the converter’s design supports military-grade operational standards for munitions testing and diagnostics.\nDr.\nBarnhart’s background includes enhancing NASA’s SPHERES program and working on defense-focused projects such as Phoenix and SeeMe, underscoring his ability to translate complex technology into reliable field applications.\nHis contributions will guide the integration, testing, and refinement phases of the CMBRE-compatible power system, leveraging his deep knowledge of both traditional aerospace engineering and innovative, modular power solutions.\nAcademic Background: Holds a B.S.\nin Aerospace Engineering from Boston University and an M.Eng.\nfrom Virginia Tech, with over 60 research publications and numerous keynote presentations at global aerospace and defense conferences.\n3.\nDr.\nPedram Chavoshipour Heris (Simulation and Modeling Expert): Dr.\nChavoshipour Heris specializes in power electronic converters, having earned his B.S.\ndegree in power electronic engineering and an M.S.\nfrom the University of Tehran.\nHis research covers the analysis, modeling, design, and control of power electronic systems, with expertise in coupled-inductor-based and modular converters, as well as photovoltaic systems.\nHis deep understanding of power conversion modeling will support the optimization of the Ga₂O₃ DC-DC converter for both DoD applications, such as military aircraft power systems, and non-DoD uses, including telecom infrastructure and EV charging stations.\nAcademic Background: Ph.D.\nin Power Electronics from University of Arkansas at Fayetteville, AR 4.\nDr.\nUttam Singisetti (Wide Bandgap Power Electronics Expert): Dr.\nSingisetti is an Associate Professor in Electrical Engineering at the University at Buffalo, SUNY, with extensive experience in developing wide-bandgap semiconductor devices.\nHis career includes roles at UCSB, where he worked on high-frequency GaN devices, and at Intel’s Component Research Lab, where he modeled advanced transistor technologies.\nHe has coauthored over 100 publications and his research interests include III-N electronic devices and next-generation wide bandgap power devices, positioning him to drive the technical development of the Ga₂O₃-based DC-DC converter.\nHis expertise will ensure the converter’s high efficiency and thermal performance, making it ideal for U.S.\nAir Force platforms and beyond.\nAcademic Background: Holds an M.S.\nfrom Arizona State University, and a Ph.D.\nin Electrical Engineering from UCSB.\nE.\nFacilities/Equipment: Syrnatec has equipped its facility with state-of-the-art tools, equipment, and software aligned specifically for the development, testing, and validation of advanced power systems.\nThe facility includes advanced circuit simulation software, such as SPICE-based simulators, for in-depth circuit analysis to model the 19",
        "27": "Topic Number: AF244-0007 Company: Syrnatec Inc Proposal Number: F244-0007-0317 Ga₂O₃ DC-DC converter's performance under varying loads and conditions.\nThermal analysis is conducted using tools like COMSOL Multiphysics, which allows for the simulation and optimization of thermal profiles, especially crucial when integrated with CNT and graphene-infused cables for superior heat dissipation.\nEMI analysis software is also employed to model and mitigate electromagnetic interference during high-frequency switching, ensuring stringent shielding requirements are met.The facility features high-power test benches for comprehensive power stability and efficiency testing, capable of delivering outputs up to 270 VDC at high load conditions and validating adherence to efficiency targets of 96-99%.\nEnvironmental simulation chambers replicate space-like conditions, including temperature extremes and radiation exposure, essential for assessing the resilience and performance of the Ga₂O₃ converter in simulated CubeSat and CMBRE operational scenarios.\nAdditionally, EMI/EMC test chambers provide detailed evaluations of the shielding capabilities of CNT and graphene-enhanced cables to prevent interference during operation.\nFor thermal and structural testing, thermal cycling chambers ensure that the Ga₂O₃ converter and cables maintain performance under rapid temperature variations, while thermal imaging systems provide real-time monitoring of heat distribution and identification of thermal hotspots during high-power tests.\nReliability and durability testing infrastructure includes vibration test equipment to simulate mechanical stresses encountered during CubeSat launches and operations, ensuring structural integrity.\nElectrical stress testing machines assess the durability of Ga₂O₃ MOSFETs and related components, targeting an operational lifespan of at least nine years.\nThe integration of advanced materials is supported by precision soldering and assembly equipment, essential for combining CNT and graphene- infused silicone rubber cables with the Ga₂O₃ DC-DC converter to achieve low resistive losses and optimal thermal performance.\nMaterial characterization tools analyze the conductivity and thermal properties of these nanomaterials to confirm their suitability for high-power applications.\nThe facility is also equipped with sophisticated software for data collection and analysis, including data acquisition systems (DAQ) for monitoring voltage, current, temperature, and power efficiency throughout testing.\nCustom control software automates test sequences, supports metric collection, and facilitates iterative design improvements.\nSoftware tools such as LabVIEW are used for data acquisition and management, while SPICE-based simulators, COMSOL Multiphysics, ANSYS for system modeling, and custom embedded firmware for CMBRE control functions ensure comprehensive and accurate analysis.\nF.\nConsultants/Subcontractors: N/A G.\nPrior, Current, or Pending Support of Similar Proposals or Awards: Syrnatec Inc.\nhas been awarded the following awards: • DARPA Topic-: Extreme Photon Imaging Capability – Hard X-ray (EPIC-HXR) SBIR 2022 Contract no.\nW912CG22P0003 (Phase 1) • NASA Topic-: Radiation Tolerant High-Voltage, High-Power Electronics (Phase 1) SBIR 2021 Contract no.\n80NSSC21C0335 (Phase 1) • NASA Topic-: Radiation Hardened High Power “GBID” Ga2O3 Based Isolated DC-DC Converter SBIR 2022 Contract no.\n80NSSC22PB209 (Phase 1) • NASA Topic-: Radiation Hardened High Power “GBID” Ga2O3 Based Isolated DC-DC Converter SBIR 2022 Contract no.\n80NSSC23CA156 (Phase 2) • NASA Topic-: Z8.13 (Z8.13-2523) (80NSSC23PB601)- Autonomous Space Traffic Management Technologies for Small Spacecraft Swarms and Constellations - Contract no.\nSBIR 2023 - 80NSSC23PB601 (phase 1) • US Space Force Topic-: SF233-0003 - Revolutionary SmallSat Power Enhancement – SBIR 2023 Contract No.\nFA24012490035 – (Phase 1) 20",
        "28": "SBIR Direct to Phase II Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Duns Cage F2D-15327 AF244-D004 Verification and Validation of software tools for materials and microstructure characterization 11/06/2024 11:42:44 AM Beacon Industries Inc 549 Cedar Street, Newington, Connecticut, 06111 http://www.beacongp.com/ CDXXNKM674G5 001150986 32816 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 10%) x Base (TDL+TDM+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) $1,398,866.67 $839,686.95 $559,179.72 $0.00 $0.00 $522,007.20 $184,800.00 $0.00 $0.00 $0.00 $0.00 $70,680.72 $777,487.92 $0.00 -$0.00 $62,199.03 $839,686.95 $0.00 $347,490.00 $123,200.00",
        "29": "Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 10%) x Base (TDL+TDM+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Base Year Direct Labor Costs $0.00 $0.00 $0.00 $0.00 $47,069.00 $517,759.00 $0.00 -$0.00 $41,420.72 $559,179.72 $0.00 Category / Individual-TR Mechanical Engineer/ Principal Investigator (Yash Mirchandani) Materials Engineer/ Material Expert (Dr.\nAlex Usenko) Mechanical Engineer/ AI/ML Expert (Dr.\nImani Farhad) Electronics Engineer/ Programming Expert (Dr.\nLingjia Liu) Computer Programmer/ Simulation Expert (Dr.\nSoummya Kar) Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $110.00 570 $100.00 595 $90.00 660 $80.00 725 $80.00 723 30 30 30 30 30 $18810.00 $81,510.00 $17850.00 $77,350.00 $17820.00 $77,220.00 $17400.00 $75,400.00 $17352.00 $75,192.00 Subtotal Direct Labor (DL) Labor Overhead (rate 35%) x (DL) Total Direct Labor (TDL) Direct Material Costs NVIDIA GPU Subtotal Direct Material Costs (DM) Material Overhead (rate 10%) x DM Total Direct Material Costs (TDM) G&A (rate 10%) x Base (TDL+TDM+TOH) Cost Sharing Profit Rate (8%) Total Estimated Cost $386,672.00 $135,335.20 $522,007.20 $168,000.00 $168,000.00 $16,800.00 $184,800.00 $70,680.72 -$0.00 $62,199.03 $839,686.95",
        "30": "TABA Year 2 Direct Labor Costs $0.00 Category / Individual-TR Mechanical Engineer/ Principal Investigator (Yash Mirchandani) Materials Engineer/ Material Expert (Dr.\nAlex Usenko) Mechanical Engineer/ AI/ML Expert (Dr.\nImani Farhad) Computer Programmer/ Programming Expert (Dr.\nLingjia Liu) Electronics Engineer/ Simulation Expert (Dr.\nSoummya Kar) Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $110.00 380 $100.00 400 $90.00 420 $80.00 490 $80.00 490 30 30 30 30 30 $12540.00 $54,340.00 $12000.00 $52,000.00 $11340.00 $49,140.00 $11760.00 $50,960.00 $11760.00 $50,960.00 Subtotal Direct Labor (DL) Labor Overhead (rate 35%) x (DL) Total Direct Labor (TDL) Direct Material Costs Software & Related Accessories Subtotal Direct Material Costs (DM) Material Overhead (rate 10%) x DM Total Direct Material Costs (TDM) G&A (rate 10%) x Base (TDL+TDM+TOH) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA $257,400.00 $90,090.00 $347,490.00 $112,000.00 $112,000.00 $11,200.00 $123,200.00 $47,069.00 -$0.00 $41,420.72 $559,179.72 $0.00 Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Yash Mirchandani Phone: (914) 525-3794 Phone: yashm@beacongp.com Title: Proposal Owner If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: No Select the Type of Payment Desired: Partial payments",
        "31": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Mechanical Engineer Principal Investigator Master's Degree Materials Engineer Material Expert Mechanical Engineer AI/ML Expert Electronics Engineer Programming Expert PhD PhD PhD Computer Programmer Simulation Expert PhD 10 15 10 10 10 570 $110.00 30 $81,510.00 595 $100.00 30 $77,350.00 660 $90.00 30 $77,220.00 725 $80.00 30 $75,400.00 723 $80.00 30 $75,192.00 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\nFringe Benefits includes Federal Unemployment Tax Allowance, State Unemployment Tax, Workmen's Compensation Insurance, Employee Benefits such as Health and welfare including life, accident and health Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nPrincipal Investigators, and Other Engineers will be compensated at Industry-standard rates.\nhttps://www.bls.gov/oes/current/oes_ct.htm#19-0000 Direct Labor Cost ($): Year2 $386,672.00 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Mechanical Engineer Principal Investigator Master's Degree Materials Engineer Material Expert Mechanical Engineer AI/ML Expert PhD PhD 10 15 10 380 $110.00 30 $54,340.00 400 $100.00 30 $52,000.00 420 $90.00 30 $49,140.00",
        "32": "Computer Programmer Programming Expert PhD Electronics Engineer Simulation Expert PhD 10 10 490 $80.00 30 $50,960.00 490 $80.00 30 $50,960.00 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\nFringe Benefits includes Federal Unemployment Tax Allowance, State Unemployment Tax, Workmen's Compensation Insurance, Employee Benefits such as Health and welfare including life, accident and health Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nPrincipal Investigators, and Other Engineers will be compensated at Industry-standard rates.\nhttps://www.bls.gov/oes/current/oes_ct.htm#19-0000 Direct Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) Apply Overhead to Direct Materials Cost?\nMaterial Cost Overhead Rate (%) Overhead Comments: Overhead Cost ($): Year2 Labor Cost Overhead Rate (%) Apply Overhead to Direct Materials Cost?\nMaterial Cost Overhead Rate (%) Overhead Comments: $257,400.00 $644,072.00 35 YES 10 $152,135.20 35 YES 10",
        "33": "Overhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Direct Material Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Direct Material Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Sum of all G&A Costs is ($): ODC-Materials Base Description: NVIDIA GPU Vendor: NVIDIA Quantity: 1 Total Cost($): $168,000.00 $101,290.00 $253,425.20 10 YES YES YES $70,680.72 10 YES YES YES $47,069.00 $117,749.72",
        "34": "Consumable?\nno Competitively Sourced?\nyes Exclusive for this Contract?\nyes Supporting Comments: ROM quote, actual price may vary at the time of the award.\nYear2 Description: Software & Related Accessories Vendor: Intel , Microsoft Azure Total Cost($): $112,000.00 Competitively Sourced?\nyes Quantity: 1 Consumable?\nno Exclusive for this Contract?\nyes Supporting Comments: ROM quote, actual price may vary at the time of the award ODC-Summary Base Do you have any additional information to provide?\nYear2 Do you have any additional information to provide?\nProfit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): NO NO - 8 $103,619.75 - 8",
        "35": "Profit Explanation: Total Profit Cost ($): Total Proposed Amount ($): $103,619.75 $1,398,866.67",
        "36": "Yash Mirchandani, Beacon Industries Inc Nov 06, 2024 Nov 06, 2025"
    },
    "images": [
        {
            "page": 1,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page1_img1.jpeg",
            "hash": "963c69c169799696",
            "position": "Middle Center"
        },
        {
            "page": 9,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page9_img1.jpeg",
            "hash": "be94c3019c12e76f",
            "position": "Bottom Right"
        },
        {
            "page": 10,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page10_img1.jpeg",
            "hash": "cef1ad0cd02de14e",
            "position": "Bottom Right"
        },
        {
            "page": 10,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page10_img2.jpeg",
            "hash": "eae09558ca97ad52",
            "position": "Top Right"
        },
        {
            "page": 10,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page10_img3.jpeg",
            "hash": "e34bdc9c8133b689",
            "position": "Middle Right"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page11_img1.jpeg",
            "hash": "a509a96caf39a077",
            "position": "Middle Right"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page11_img2.png",
            "hash": "beb482cad6dde003",
            "position": "Bottom Right"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page15_img1.png",
            "hash": "8f69d037e136291b",
            "position": "Top Right"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page16_img1.jpeg",
            "hash": "eaa39d82b49697c2",
            "position": "Middle Center"
        },
        {
            "page": 17,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page17_img1.jpeg",
            "hash": "ab62f09c99c1857e",
            "position": "Top Right"
        },
        {
            "page": 18,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page18_img1.jpeg",
            "hash": "e8cc24528f7ad56c",
            "position": "Top Center"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page19_img1.jpeg",
            "hash": "afc0d035497aec4b",
            "position": "Top Right"
        },
        {
            "page": 21,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page21_img1.jpeg",
            "hash": "ae30cbcbf068cbc8",
            "position": "Top Center"
        },
        {
            "page": 22,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page22_img1.jpeg",
            "hash": "8fccf170d433f403",
            "position": "Middle Right"
        },
        {
            "page": 23,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page23_img1.jpeg",
            "hash": "8b1dfc52c6e4c4e2",
            "position": "Middle Center"
        },
        {
            "page": 24,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page24_img1.jpeg",
            "hash": "91aeee31ee01b951",
            "position": "Top Center"
        },
        {
            "page": 24,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page24_img2.jpeg",
            "hash": "ffa82f70c080f07e",
            "position": "Middle Center"
        },
        {
            "page": 27,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page27_img1.jpeg",
            "hash": "8ca090ddf7706d2b",
            "position": "Middle Right"
        },
        {
            "page": 28,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page28_img1.png",
            "hash": "834987a6cf38ccb6",
            "position": "Top Left"
        },
        {
            "page": 36,
            "image_file": "docNAC01FB7453539a8f94c77b631f7df9f75cf42daf7bb59b46b8d3117b1a7309f022623fb1cb44_page36_img1.jpeg",
            "hash": "c6cc2b23999bb24d",
            "position": "Middle Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "beacongp.com",
        "name": "N/A",
        "phone": "N/A"
    }
}