{
    "filename": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0095 Proposal Title: INSIGHT Blue Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: Compass Blue Address: Website: UEI: CAGE: 3934 Number Nine Road, Cazenovia, NY 13035-9475 DOD6fMSEUMee 9Q4M0 SBA SBC Identification Number: 002478959 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 1 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_002478959 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • CB SBIR Registration.pdf 5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or NO",
        "3": "private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO N/A NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [X] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [ ] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [X] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Emil Filkorn Signature Emil J Filkorn Title CEO Business Name Date Compass Blue 11/19/2023",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?NO VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: INSIGHT Blue, a state-of-the-art NLP-powered Knowledge Graph (KG), provides a robust solution for the complexities of Gray Zone or other military operations, particularly in the contested South China Sea.\nLeveraging dynamic KG technology, INSIGHT Blue enhances contextual understanding by dynamically linking semantic insights across data domains, thus facilitating comprehensive cross-domain analysis that binds disparate data sources, from OSINT and maritime sensor data to unstructured text.\nIts real-time adaptability allows for seamless integration with evolving data streams, ensuring that the generated insights are both current and operationally relevant.\nThis dynamic capability supports rapid response to shifting geopolitical events by uncovering underlying patterns and emergent risks.\nImportantly, INSIGHT Blue's design prioritizes explainability, as its traceable relationships offer transparency in decision-making and situational awareness.\nEach connection and inference within the graph is meticulously linked, allowing analysts to backtrack and validate the derived insights, which is crucial in intelligence and defense contexts.\nTogether, these attributes make INSIGHT Blue an indispensable tool for managing the volatile dynamics of Gray Zone or other conflicts, empowering decision-makers with timely, actionable, and transparent intelligence across domains.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: INSIGHT Blue offers transformative benefits to Department of Defense (DoD) warfighters, especially in contested regions like the South China Sea.\nBy harnessing the power of a dynamic knowledge graph (KG) fed by real-time data, INSIGHT Blue provides critical situational awareness and decision support.\nFor warfighters, its ability to integrate and interpret cross-domain data sources—from OSINT to sensor data—enables a comprehensive view of operational environments, revealing hidden patterns and potential threats in Gray Zone operations.\nEnhanced contextual understanding allows for rapid identification of emerging risks, while traceable, explainable relationships within the KG ensure that insights can be verified, a crucial factor in high-stakes military decisions.\nAdditionally, INSIGHT Blue's real-time adaptability means that it can quickly adjust to evolving mission demands, providing actionable intelligence at the pace required by today’s dynamic military operations.",
        "5": "Beyond defense, INSIGHT Blue’s dynamic KG technology holds promising potential for commercial applications.\nIndustries such as finance, healthcare, and supply chain management can leverage INSIGHT Blue to enhance data-driven decision- making.\nBy uniting disparate data sources and delivering insights with clear traceability, businesses can improve operational efficiency, risk assessment, and strategic planning, benefiting from the same robust, real-time, and explainable insights essential for military use.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: 1 2 3 4 5 6 7 8 9 10 11 12 13 14 16 17 18 19 20 21 22 23 24 List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: Trusted AI, Autonomy, Joint and Combined Operations, Decision-Making, Human-Machine Teaming, Transformational Model, Dynamic Knowledge Graphs, Compass Blue VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 100% 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES",
        "6": "3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES NO 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO 16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n25% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES VOL I - Contact Information Principal Investigator Name: Dr.\nMichael Wheeler Phone: (315) 254-0905 Email: michael.wheeler@compassblue.ai Address: 3934 Number Nine Road, Cazenovia, NY 13035 - 9475",
        "7": "Corporate Official Name: Emil Filkorn Phone: (315) 254-0162 Email: emil.filkorn@compassblue.ai Address: 3934 Number Nine Road, Cazenovia, NY 13035 - 9475 Authorized Contract Negotiator Name: Emil Filkorn Phone: (315) 254-0162 Email: emil.filkorn@compassblue.ai Address: 3934 Number Nine Road, Cazenovia, NY 13035 - 9475 Form Generated on 11/06/2024 10:33:20 AM",
        "8": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness Dynamic Knowledge of Maritime Aggression: Knowledge Graphs and the South China Sea, Research Intelligent Network System Integrating Graphs and Hyperlinked Trends (INSIGHT) Blue Volume 2: Technical Volume This proposal includes data that must not be disclosed outside the Government and must not be duplicated, used, or disclosed – in whole or in part – for any purpose other than to evaluate this proposal.\nIf, however, a contract is awarded to this offeror as a result of – or in connection with – the submission of this data, the Government has the right to duplicate, use, or disclose the data to the extent provided in the resulting contract.\nThis restriction does not limit the Government's right to use information contained in this data if it is obtained from another source without restriction.\nThe data subject to this restriction are contained in pages 1-14 and 16-24.\n1.\nIdentification and Significance of the Problem or Opportunity Problem.\nChinese aggression and expansion in the South China Sea (SCS) represent perhaps the biggest Joint US challenge in the Indo-PACOM theater.\nThe East China Sea and China’s maturing strategy to repatriate Taiwan is largely framed by the Great Power Competition (GPC) approach from the U.S.\nand its allies defending Taiwan against Chinese aggression.\nAs a subset of the GPC target, the South China Sea is a murkier battlespace of fisheries and potential natural gas deposits, in which regional powers, like Vietnam, the Philippines, and Indonesia try to resist Chinese expansion but without undermining important, bilateral trading relationships with the Mainland.\nThe development of good semantic reasoning through a dynamic knowledge graph (KG) and applying it to relevant problem sets in GPC is a pressing and important need.\nThe Economist on 17 June 2020 suggested that China could soon declare an Air Defense Identification Zone (ADIZ) over the SCS.1 USN Lieutenant (now Commander) Stevie Greenway in 2010 said: Maritime domain awareness (MDA) is a crucial U.S.\nNavy operational function, with significant long-term strategic overtones, especially in the SCS region.\nSocio- economic issues plague the SCS, including overfishing, piracy, and energy usage, and have forced many countries to disregard borders, laws, and economic exclusionary zones (EEZ).2 The primary transgressor of borders and laws is the Chinese People’s Liberation Army Navy (PLAN) and the disdain for international law is compounded by a lack of published maritime doctrine.\nPeter Dutton and Ryan Martinson of the Naval War College suggested that although China “has not promulgated a formal maritime strategy…These [maritime] tasks have been placed within a framework of “four coordinations”: between national and international maritime law; among China’s many agencies concerned with the management of maritime 1 “China’s Next Move in the South China Sea,” The Economist, 17 June 2020.\nThe Chinese declared an ADIZ over the East China Sea in 2013.\n(As of 6 Nov 2024, China has not yet declared an ADIZ over the SCS).\n2 Stevie R.\nGreenway and Coey J.\nSipes, “Maritime Domain Awareness in the South China Sea: An Operational Picture Design.” (Master’s Thesis, Naval Postgraduate School, 2018).\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 1 of 24",
        "9": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness issues; between traditional and nontraditional maritime security issues; and between national priorities and international paradigms.” 3 The threat of an aggressive China attempting to assert control over the SCS compounded by shifting international law, shifting Chinese policy, and ever-changing resource expectations, especially in energy and fishing regions, make this region a critical, complex system use-case for improved situational awareness (SA) through automated natural language processing (NLP) and Intelligence handling.\nImproved contextual understanding; cross-domain analysis binding disparate sources of data; insight flexibility from real-time data sources; and explainability through their traceable relationships make dynamic KGs an ideal tool for these Gray Zone operations.\nIntelligent Network System Integrating Graphs and Hyperlinked Trends (INSIGHT) Blue is our entry into the dynamic KG capability space.\nThis is as much an Air Force problem as a Navy one.\nLike the Navy, the Air Force is tasked with operating across the wide expanse of the Pacific Ocean.\nOne Washington, D.C.-based think tank called for a better-equipped Air Force Uncrewed Aerial System scanning fleet to support the 2022 Indo-Pacific Partnership for Maritime Domain Awareness (IPMDA) (also called “the Quad” made up of the U.S., Australia, Japan, and India).4 The Air Force Research Lab (AFRL) pursuit of an effective dynamic KG that can process both OSINT/PAI [hereafter, just “PAI”] and maritime sensor data can greatly assist the Air Force’s understanding about those regions of highest priority and how they may affect competing legal and territorial claims.\nOf the many challenging problems in the SCS, “gray zone operations” are perhaps the most difficult to follow as individual events or activities may signal the next evolution in China’s strategy.\nThe changing geography and legal status; competing territorial claims; quasi-military actors, such as militarized fishing fleets and maritime rights patrols; and complex diplomatic relationships make SA and pattern of life analysis particularly difficult.\nAs shown in more technical detail below, these confounding factors can confuse a word association / language model approach and require the improved semantic reasoning and currency from INSIGHT Blue.\nThe technical requirements to detect threats and identify potential targets in a timely manner require not just NLP, but semantic reasoning and KGs to decipher the uncertainty in the English (and translated) text (our use of Southeast Asian Languages In One Network LMs, described later, helps us stay more mission-relevant while we develop KG technology because our data sources will be closer to a relevant regional focus, and to original native language text meanings than articles that are originated from english language western media reports and journals 5).\nKGs are widely used in scenarios, such as “question answering systems, recommendation systems, and web 3 Dutton, Peter A.\nand Ryan D.\nMartinson, \"China’s Evolving Surface Fleet.” China Maritime Studies Institute (CMSI) Red Books, 7-2017 (2017).\n4 Travis Sharp, Thomas Mahnken, Tim Sadov, “Extending Deterrence by Detection: the Case for Integrating Unmanned Aircraft Systems into the Indo-Pacific Partnership for Maritime Domain Awareness.” Center for Strategic and Budgetary Assessments (CSBA), 2023, 3-4.\n5 AI Singapore’s explanation of their SEA-LION LM states, “Existing LLMs display strong bias in terms of cultural values, political beliefs and social attitudes.\nThis is due to the training data, especially those scraped from the Internet, which often has disproportionately large influences from western, industrialized, rich, educated, and democratic (WIRED) societies.\nPeople from non-WIRED societies are less likely to be literate, to use the Internet, and to have their output easily accessed.” Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 2 of 24",
        "10": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness search,” but “there are a usually a large number of absent links in existing KGs.” 6 Our INSIGHT Blue processor offers improvements to an initial, static KG.\nOur incorporation of both PAI and sensor data can suggest potentially missing links.\nFurthermore, by streaming events to INSIGHT Blue and updating the graph in place, additional links can be suggested as new information arrives.\nFinally, our inclusion of the competing territorial claims and boundaries can add further geospatial context to a text-only generated KG.\nFor this Phase I SBIR, we will deliver a plan to the Air Force proposing a Phase II prototype that combines: 1.\na Southeast Asian-generated Large Language Model (LLM) that better aligns with textual feeds for a KG of the SCS, 2.\ndynamic KG reasoning algorithms (induction) to update that graph as new information arrives, 3.\nVisualization toolkit for rendering and interacting with those new links 4.\nthe analysis of UNCLASSIFIED sensor data that augments the edges and nodes from mere textual reports, and 5.\nreasoning over geospatial entities to add richer semantic context to the reasoning, and 6.\nexploring the relevance of prototype solutioning guided by the most recent publications of DAF ABMS CFT Transformational Model concepts and developments 2.\nPhase I Technical Objectives.\n2.1 Collect Text, Sensor Data, and Geography for Nine (9) Test Cases INSIGHT Blue will concentrate on the nine (9) test cases outlined in the Naval War College “Red Books” (described below), covering the years 2006-2022.\nThis provides us multiple KG training and evaluation text corpora, during which maritime legal status changed, Chinese strategy evolved to include an aggressive “maritime rights” element, and potentially new natural gas deposits added new, potential flashpoints to the region’s hot spots.\nWe will divide them into training and test cases for developing our KG.\n2.1.1 Naval War College CMSI “Red Books” The Naval War College China Maritime Studies Institute (CMSI) publishes UNCLASSIFIED, periodic reports on the PLAN.\nThese are divided into translations, notes, news, China Maritime Reports, and Maritime Studies Red Books.\nAlthough there is much of interest across the entire collection, we will concentrate on a few Red Books (only) to keep the Phase I SBIR feasibility study tractable.\nFor the Phase II KG prototype effort, we will process more of the text.\nOur primary temporal organization will be based on Andrew Chubb’s “Chinese Nationalism and the Gray Zone” Red Book,7 which identifies nine incidents or conflicts where the Chinese claims in the SCS came into conflict with the Philippines, Indonesia, Malaysia, and Vietnam, among others.\n6 Li Duantengchuan, et.\nAl.\n“SDFormer: A shallow-to-deep feature interaction for knowledge graph embedding,” Knowledge-Based Systems (284, 25 January 2024).\nhttps://www.sciencedirect.com/science/article/abs/pii/S095070512301002X 7 Chubb, Andrew, \"Chinese Nationalism and the ‘Gray Zone’: Case Analyses of Public Opinion and PRC Maritime Policy.” China Maritime Studies Institute (CMSI) Red Books, (2021).\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 3 of 24",
        "11": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness Mr.\nChubb’s primary research focus is whether Chinese public opinion drove the government to be more aggressive and assertive in the SCS and concluded that it did not.\nInstead, the Chinese Communist Party pursued an aggressive maritime expansion and fomented public opinion after events occurred.\nTable 1 outlines the 9 case studies, the years of conflict, and the opposing countries.\nTable 1: Nine Case Studies of Chinese “Gray Zone” Operations Year(s) Name Opposing Countries Case Study 1 2 3 4 5 6 7 8 9 2006-8 White Hulls and Vietnam \"special operations\" 2009 The Impeccable Incident 2010-16 Sino-Indonesian Fishing Clashes USA Indonesia 2010 2011 2012 2012 Diaoyu Fishing Clash Japan Reed Bank and the Sino-Vietnamese Cable Cuttings Vietnam, Philippines Scarborough Shoal Philippines The Diaoyu Nationalization Japan 2013-4 Second Thomas Shoal Philippines 2014 HYSY 981 Incident Vietnam The Gray Zone operations are particularly interesting material for a KG study – during this time, the Chinese created a Coast Guard and used civilian fishing fleets as aggressive policy instruments; Chinese public outcry makes PAI an important data source; and the availability of transponder and satellite data provides vessel sensor tracks that can update our KG.\nAs this product matures and moves to the High Side after Phase II, we can replace these UNCLASSIFIED sensor feeds with better military intelligence feeds.\nWe plotted the “Red Book” cases on a map (Figure 1).\nFor the Phase I SBIR, we will be studying three or four of those incidents, but concentrate on Red Book Case Study #6 (Scarborough Shoal) for the rest of this solicitation.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 4 of 24",
        "12": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness 2.1.2 “Blue OSINT” – Global Fishing Watch (South China Sea) Figure 1: SCS and the Nine Case Studies The Atlantic Council published a good article on the importance of “Blue OSINT” to augment traditional Intelligence, Surveillance, and Reconnaissance (ISR) collections over the wide expanse of the Indo-PACOM theater.8 The Defense Innovation Unit (DIU) specifically calls out the need for better AI solutions to improve the processing of “Blue OSINT.”9 Of particular interest for INSIGHT Blue, the Atlantic Council publication specifically highlighted Global Fishing Watch (GFW),10 which is especially relevant for the SCS: illegal fishing is rampant and often government-encouraged; piracy is a major problem, especially for Singapore around the Straits of Malacca; and fishing fleets and ports are often “dual use” where the fishing vessel calls in the Chinese Coast Guard for assistance.\nOf particular interest for this KG project, GFW provides readily-accessible datasets, including fishing activity, transshipment (with AIS transponders), anchorages (from European Space Agency SAR), and vessel imagery and identification.\nAs part of the Phase I feasibility study, we will outline our Phase II SBIR plan to take account of this 8 Guido L.\nTorres and Austin Gray, “Sailing through the spyglass: The strategic advantages of blue OSINT, ubiquitous sensor networks, and deception,” Atlantic Council (8 August 2024).\n9 Blinde, Loren.\n“DIU seeks solutions for Blue OSINT.” Intelligence Community News.\n(January 9, 2023).\nhttps://intelligencecommunitynews.com/diu-seeks-solutions-for-blue-osint/ 10 https://globalfishingwatch.org/ Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 5 of 24",
        "13": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness sensor data into the dynamic KG.\nAs mentioned earlier, these UNCLASSIFIED feeds can serve as good proxies for CLASSIFIED data feeds on the High Side.\n2.1.3 Supplementary Sources There are numerous other sources which can serve as textual corpora for the NLP and KG training and testing phases of our AI workflow.\nWe already mentioned the Center for Strategic and Budgetary Assessments (CSBA) study advocating for better surveillance to support the Quad in the SCS.\nTo cite an Air Force University example, Captain Sukjoon Yoon (ROKN) published a 2023 paper in the Journal of Indo-Pacific Affairs (republished in AFU) called “The Import of Hybrid Activities in the South China Sea,” which states: China deftly employs a strategic hybrid warfare approach, adroitly harnessing nonmilitary forces such as coast guards to execute coercive actions, thereby propelling its territorial and economic objectives.\nThe intricacies of this approach intersect with the complexities of applying the UN Convention on the Law of the Sea.\nThese intricacies are compounded by maritime security disagreements, prevailing power imbalances, and the persistent rivalry between the United States and China.11 These ancillary sources are what we have identified for best value in improving the KG against widely different textual sources.\n2.2 Train South China Sea Language Model (LM) in spaCY Compass Blue uses spaCy for developing language models (LM) which then are used to create the KG.12 Figure 2 shows one paragraph of the “Red Book” case study #1, run through spaCy using the generic english LM (en_core_web_lg).\n11 CAPT Sukjoon Yoon, Republic of Korea Navy, Retired; and Dr.\nKim Wonhee.\nThe Import of Hybrid Activities in the South China Sea.\n(21 September 2023).\nQuoted from: https://www.airuniversity.af.edu/JIPA/Display/Article/3532882/the-import-of-hybrid-activities-in-the-south-china- sea/ 12 https://github.com/explosion/spaCy Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 6 of 24",
        "14": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness Figure 2: spaCy NLP against a “Red Book” Case Study snippet As shown in the colored boxes, the generic English model mislabels “White Hulls”, the “South and East China Seas,” and the Triton 626 incident among others, and completely fails to recognize other Named Entity Recognition (NERs) objects, such as “gray-zone operations” and “regular rights-defense patrols.” We have learned already that building a KG from this poorly aligned LM will make the resulting graph less useful to Air Force relevant scenarios.\nSo, we won’t.\nOn this SBIR, Compass Blue will first improve the LM through the adoption of the AI Singapore Sea Lion model.13 From a ComputerWeekly article: Unlike most other LLMs in the market developed by western tech companies and trained primarily on the corpus of internet content, which is primarily in English, Sea Lion, built by AI Singapore, is trained on content produced in Southeast Asian languages like Thai, Vietnamese and Bahasa Indonesia.” 14 The adoption of this Southeast Asian corpus will help with the locations (LOC), events (EVENT), and people (PERSON), but it still will lack those specific NERs, such as gray zone operations and regular rights patrols, for which we will still need to train a new LM.\nWe will augment the base Sea Lion model by training from the Red Book Use Case.\nIn technical spaCy terms, this involves using the prodigy ner.teach recipe (Figure 3)15.\n13 https://aisingapore.org/aiproducts/sea-lion/ 14 Computer Weekly https://www.computerweekly.com/feature/Sea-Lion-explained-Southeast-Asias-first-large- language-model 15 https://prodi.gy/docs; https://prodi.gy/docs/recipes#ner-teach Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 7 of 24",
        "15": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness Figure 3: spaCy Prodigy ner.teach recipe to augment LM For the examples below, our PI Dr Wheeler, trained a generic en_core_web_lg model with some initial text clips from the Red Books.\n2.3 Create Knowledge Graph from Red Book #2 Using prodigy, the data scientist can move beyond mere word association to start adding semantic meaning to words and phrases.\nFigure 4 shows an example of building on the token identification aspects of the NLP (the black boxes, like GGP, and Reg+) to code semantic themes and causes for drugs and genetic targets, using the BioNLP Shared Task of 2011.\nFigure 4: Dependencies and relations (biomedical example) For the SCS case, Compass Blue developed a preliminary set of NLP labels and a simple semantic layer above that, describing Chinese aggression and the non-Chinese reaction.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 8 of 24",
        "16": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness Figure 5: Very Early Semantics from Red Books, Case Study #6 The trained language model (LM) correctly identifies the ARMED_FORCES, CIVIL FORCES, and locations (LOC), shown as black boxes.\nIt can also start to recognize that Chinese fishing boats moving onto the Scarborough Shoal was the impetus of the crisis and the Philippines government responded by dispatching armed soldiers in boats to seize the illegal fishing catch.\nThe event escalated through social media and public outcry on all sides and became an international incident.\nOf note in this example, the semantic reasoning did not identify the Scarborough Shoal as Philippine-claimed waters.\nIn our earlier discussion of the benefits of a dynamic KG to the SCS, we specifically mentioned the need to incorporate geospatial claims and boundaries so that Scarborough Shoal, for instance, is recognized as Philippine maritime territory into which the Chinese are encroaching.\nOur Compass Blue PI for this effort has a PhD in geospatial visualization and has done numerous projects in fusing geospatial analytics with NLP.\nThe use of ontologies and KGs to “make better maps” is an active research area of cartographers.16 Our Phase II prototype will involve multiple KGs for the SCS as shown Figure 6.\nWe will have civil and military graphs for each of the concerned counties and a “gamemaster” ontology about the shifting legal frameworks like the United Nations Convention on the Law of the Sea (UNCLOS) and the competing EEZs.\n16 For instance, see Dr.\nUjwala Bharambe at the University of Mumbai.\nSample articles:“Ontology and knowledge graphs for semantic analysis in NLP.” (2012), “Spatio-Temporal Data Harmalization using KG for Soil Health Management.” (2023) “https://scholar.google.com/citations?user=Gc4LhAkAAAAJ&hl=en Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 9 of 24",
        "17": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness Figure 6: Multiple Knowledge Graphs to Model SCS Situational Awareness (SA) 2.4 Plan Phase II SBIR prototype The primary contract deliverable for this Phase I SBIR will be a feasibility study with a technical roadmap to produce a Phase II prototype.\nThis prototype will include the improvements to KG reasoning mentioned earlier (and described in more detail below) and will add an operational, streaming service that we can demonstrate to prospective Air Force customers.\n2.4.1 Train LM and KG on Sea Lion As shown in Figure 6, we are building multiple KGs (in English) targeting a number of different countries (where the text may have originated in a native language), which is why we’re excited to explore the AI Singapore Sea Lion LLM.\nTo requote footnote 13: “Sea Lion … is trained on content produced in Southeast Asian languages like Thai, Vietnamese and Bahasa Indonesia.” Although we will be working in English, the placenames, personalities, and language constructs will all be based on SE Asia languages.\nUsing the prodigy ner.teach (Figure 3) logic, we will augment the Sea Lion model with our CIVIL_FORCES, ARMED_FORCES, and AGGRESSION labels from the Red Books as a training corpus.\n2.4.2 Dynamic KG – Inferring the Unseen links Inductive learning in KGs involves training on one graph and then performing inference on a new graph with unseen entities, as opposed to transductive learning, where all entities are present during training.\nIn the SCS example, it might involve a completely novel location and composition Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 10 of 24",
        "18": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness of forces for Chinese aggression.\nAnother KG tool Compass Blue uses, pykeen has good support for inductive link prediction (Figure 7).17 Figure 7: pykeen: Inductive Link Prediction 2.4.3 Develop User Interface Tools to Interact with the Dynamic KG (2.4.2) For a complex space like the SCS with multiple KGs (Figure 6), it is critically important that users can visualize the resulting graph(s) especially as new graphs are generated.\nFor the Phase II SBIR prototype, we will use the open-source Gephi graph visualization toolkit (Figure 8).\n18 As open source, there is no software license and it supports exploratory data analysis (EDA) and link analysis.\nIt also has a plugin architecture, so we can develop a Compass Blue plugin specifically to highlight the generated links across multiple KGs (e.g.\nupdating a Chinese and Philippine model simultaneously).\nThat CB-generated plugin will also allow the Air Force user to modify the topology and correct any auto-link errors.\n17 https://pykeen.readthedocs.io/en/stable/ 18 https://gephi.org/ Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 11 of 24",
        "19": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness Figure 8: Gephi Graph Visualization Toolkit 2.4.4 Inclusion of Global Fishing Watch as UNCLASSIFIED Sensor Data The Global Fishing Watch (GFW) data includes the following datasets (Table 2): Table 2: Global Fishing Watch Data for INSIGHT Blue19 Data Type General Usage (from the GFW web site) Application to USAF Dynamic KGs Apparent fishing effort from AIS transponder • Determine whether transponder is turned off (suspicious) Transfer of catch to remain at sea monitoring of fishing ports is important to combat illegal, unreported, and unregulated (IUU) fishing • Identify “fishers” vs.\n“squatters” • Possible overlap between CIVIL fishing fleet and ARMED (Navy, Coast Guard, maritime patrols) • If the vessel type NOT EQUAL to target fishery, suspicious (squatting) Vessel Identify Understanding vessel type can help with fishing monitoring Fishing effort Transshipment Anchorages Compass Blue will collect space and time-delimited sensor data that correspond to the Case Studies for Phase I.\nFor the Scarborough Shoal incident (#6), we will pull AIS data for the fishing 19 https://globalfishingwatch.org/datasets-and-code/ Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 12 of 24",
        "20": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness fleets and see whether they turned off transponders as they entered Philippine maritime space, for instance.\n2.4.5 Reasoning over geospatial entities (e.g., Where is Scarborough Shoal?) Every geographic feature in the SCS has names in different languages.\nScarborough Shoal (eng.) is “Huangyan Island” in Mandarin (so Mr.\nChubb uses that term for the Baidu search).\nThe English/Philippine/Chinese KGs need to link to that entity and also understand the cross-graph linkages (that the names represent the same feature).\nIn addition, these features have changed over the 17-year period covered by the nine Red Book case studies.\nFigure 9 shows Scarborough Shoal in 2024 imagery, but with many reefs, shoals, and artificial islands, the Chinese Navy has literally built them up from mere rocks in the surf.\nFigure 9: Scarborough Shoal, 2024.\nMaxar Imagery 2.4.6 Operational Use of Dynamic KG for South China Sea (Phase II prototype) Compass Blue will develop a working prototype under the succeeding Phase II SBIR.\nThe initial architecture for that software is shown in Figure 10.\nThe Compass Blue INSIGHT Blue engine will ingest both streaming PAI (e.g.\nnews sources) as well as UNCLASSIFIED AIS sensor data from Global Fishing Watch.\nBoth the textual sources and the sensor inputs will feed into a series of dynamic KGs as shown in the diagram.\nWe will train with some subset of the Red Book case studies (say 6 out of 9) then test the dynamism behavior using the remaining case studies (3 out of 9).\nThe processor will infer the new links even though the geography, competing actors, civil/military mix of forces, and legal frameworks might be novel.\nThe output of this KG-based prototype will be indications & warnings (I&W) that would be of use to an operational INDO- PACOM commander.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 13 of 24",
        "21": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness Figure 10: INSIGHT Blue Dynamic KGs for Indications & Warnings 3.\nPhase I Statement of Work.\n3.1 Scope / Project Plan Compass Blue has developed a project plan for this Phase I SBIR that will lead to a plan for the Phase II software prototype.\nOur plan is to curate good working data to create a static KG and develop sufficient software exemplars for that static KG that we can plan the Phase II prototype.\nOf biggest interest to the Phase II prototype will be how we plan to handle inductive reasoning / new links, visualizing / editing those links with Gephi, incorporating geospatial entities, and including sensor data (from GFW) into the KG generation phase.\nFigure 11: High-Level Project Plan for Six Month, Phase I SBIR We keep the following expectations front and center in our thinking about this opportunity: • We will research state of the art techniques for enabling a user to interact with a dynamic knowledge graph, and Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 14 of 24",
        "22": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness • We will suggest additional necessary changes to the graph in support of faster, more effective: o situational awareness, o pattern of life analysis, o threat detection, and o targeting operations in time-constrained environments 3.2 Detailed Statement of Work (SOW) DATE Prior to contract start MILE- STONE Ongoing pre-SBIR IR&D Kickoff (~15 Mar 25) Kickoff +1 month Kickoff +2 months Kickoff +3 months Kickoff +4 months Kickoff +6 months Formal SBIR kickoff Cleaned Red Book case studies SCS LM RDF triplestore for SCS Static KG Phase II plan Table 3: Detailed Statement of Work (SOW) DESCRIPTION DELIVERABLE • CB continued collection of OSINT data • Existing AI/ML and sources • Continued IR&D for another AFRL solicitation, we will be collecting airborne and space Indo-PACOM sensor sets Transformational Model IR&D advances preparation for SBR AF244-0001 • CB meeting w/ AFRL leadership to agree • Kickoff +3d, agreed schedule on data, technical approach, and final deliverables • Clean data (punctuation, footnotes, etc.) for better NLP • Teach Sea Lion LM additional NLP terms using prodigy ner.teach and technical approach • Red Book case study text, ready to train language model (LM) • SCS Gray Zone applicable LM • Create Resource Description Framework • RDF datastore for building KG (RDF) triples from SCS LM and Red Books • Use pykeen to build static KG • KG available for user • Design prototype S/W • KG should include: 1) dynamism (induction of new links), 2) plan for sensor data (AIS from GFW), 3) modelling of geospatial entities interaction (question / response) • Phase I Feasibility Study / draft Phase II plan 4.\nRelated Work.\nThe use of KGs are a natural addition to the DAF efforts that are underway and are exploring the DAF Transformational Model (TM) relationships across 52 discrete decision sub-functions that partially constitute the building blocks of Joint and Combined Operations 20.\nCompass Blue was recently involved in developing decision-making tools (through our own IR&D) that were intended to provide decision support / decision advantage capabilities to C2 warfighters at an ABMS CFT unclassified sprint week for Generating Battle COAs (Sep 2024) at the ShOC-N in 20 Distro A documents shared by Maj Luke Cepil, lucas.cepil.1@us.af.mil, ABMS CFT Dep Chief, Modeling & Technical Integration Division, AF/A57DJ from the Transformational Model Industry Day, 23 Oct 2024 Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 15 of 24",
        "23": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness Las Vegas (we received a gov’t invite to the Sep sprint week).\nOur COA generation development efforts leading up to sprint week quickly highlighted the importance of a tool like dynamic KGs to provide warfighters with reasoning and explainability behind the TM-based model we have been leveraging (due to other obligations we self-eliminated ourselves from attending prior to sprint week21 and did not participate in the actual sprint week itself).\nWith the DAF’s publication of another 27 discrete decision functions (15 Battle Command, 12 Battle Analysis [formerly ISR]) from the TM in September bringing the total published number to 52, we will continue IR&D efforts with KGs in the Battle Analysis [formerly ISR] portion of the model.\nThe figure below presents a summary of the 52 discrete decision functions, some we believe will be aided by the use of dynamic KGs.\nThe DAF ABMS CFT gov’t team utilizes the concept of nodes, edges and vertices in the application of the TM to better understand the composition of decision functions behind Joint and Combined Operations.\nThese are the same nodes and edges concepts KGs provide insights to.\nThe newly added 27 discrete decision functions are not fully developed by the ABMS CFT gov’t team.\nCompass Blue is currently focusing on more fully developing the 12 Battle Analysis decision functions through our own IR&D where we believe we can make headway with our team of warfighter and technical SMEs.\nBattle Analysis was formerly entitled ISR.\nIts domain remains primarily in ISR activities.\nOur maritime domain awareness in the SCS use case for this SBIR solicitation may very well find benefit from the ISR discrete decision function IR&D we are doing.\nIt is too soon to say if there will be a direct benefit to our dynamic KG Phase I by us better understanding the decision functions associated with Battle Analysis.\nFigure 12: DAF Transformational Model 21 Compass Blue self-eliminated ourselves to avoid potential OCI perceptions based on a DARPA contract one of our employees is supporting.\nThe OCI issue is referenced in the Vol 5 section of this proposal package.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 16 of 24",
        "24": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness Before self-eliminating from the sprint week invitation, Compass Blue was developing a Generate Battle COA solution for the given problem.\nWhile not the critical piece for COA Generation, dynamic KGs are believed to be essential components that will help accelerate Human Machine Team (HMT) activities by supplying Warfighters more robust insights into the data sets that are being presented to them, and the AI-generated decision recommendations being created for them.\nIn a related effort, Compass Blue and the MIT-LL Human Health and Performance Systems Group have partnered on a HMT proposal submission [FX24E-TPCSO1-0698 - Able Yardstick] to the Small Business Technology Transfer (STTR) Commercial Solutions Opening (CSO) STTR X24.E Phase I.\nThe proposal seeks to accomplish a feasibility study on practical human performance metrics that can inform the HMT that more support from AI (or the machine) is necessary during an operational event to counter task saturation effects leading to degradation in the human component of the HMT’s performance.\nWe believe that the power of KGs in teasing out inferences across complex data sets may contribute to improved understanding of the subcomponents of HMT performance, along with greater explainability of AI contributions to HMT activities.\nOn a different R&D effort, Compass Blue has been working w/ Mr.\nMark Zappavigna of AFRL to use an Air Force-specific Language Model (LM) to process Air Force Tactics, Techniques, and Procedures (AFTTPs) in collaboration with the 174 ATKW in Syracuse, NY.\nThe Attack Wing flies MQ-9 (Reapers) out of Hancock Field, so we have been processing the 3-3 manual: “Combat Fundamentals MQ-9” AFTTP.22 We uses spaCy and prodigy as the technical stack to augment English NLP models for the Air Force-specific terms.\nPreviously, Dr.\nWheeler has used NLP techniques (the AFRL ATEA product) to parse intelligence traffic in support of the Syracuse Information Reconnaissance Intelligence Systems (SIRIS).\nSIRIS was an operational Intelligence system in support of Remotely Piloted Aircraft (RPA) missions.\nThe NLP work automated the Intelligence handling in support of the operational MQ-9 missions.\nBeing a new veteran-owned small business in the warfighter technology development space, we do not yet have completed contract work to present as an example of “previous work”.\nWe have submitted several proposals for work (SBIRs, STTRs and others) on our own, as well as with formally-documented subcontractor partners to include the likes of MIT-LL, Rensselaer Polytechnic Institute, Altamira Technologies Corp., Omni Federal and Big Bear.ai.\n5.\nRelationship with Future Research or Research and Development.\nAnticipated results.\nThe intent of INSIGHT Blue is to utilize a warfighting mission relevant use case (Great Power Competition and countering Gray Zone Operations with China) for research and development advancements in dynamic KG tools that are informed by doctrinal warfighter processes and operations, so that: 22 Secretary of the Air Force, “Combat Fundamentals MQ-9” [Reaper], Air Force Tactics, Techniques, and Procedures (AFTTP).\n14 April 2023.\nhttps://www.nellis.af.mil/News/Features/Article/665461/561st-jts-enhances- warfighter-ttps/ Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 17 of 24",
        "25": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness • Advancements originate from the context of warfighter need (can INSIGHT Blue address the right warfighter questions?) • Functionality improvements are toward relevant warfighter application development (can INSIGHT Blue deliver the “right answers” effectively to the warfighter?) tailored Significance of the Phase I effort providing the foundation for Phase II prototyping.\nCompass Blue’s recent IR&D efforts have successfully demonstrated our ability to gain supporting interest from warfighter (e.g., 174 ATKW) and technology partner (e.g., MIT-LL, BigBear.ai) contributors within the unclassified space as this SBIR solicitation prescribes.\nThe desired outcomes for this interactive KG SBIR fit well into our ability to develop solutions and advancements that are tailored to the warfighters’ needs from the start.\nOur Phase I approach will extend our recent work preparing for the DAF ABMS CFT Generate Battle COAs sprint week that occurred in Sep 2024.\nWe developed an underlying COA generation tool based on the Indo-Pacific fight that provided insights into warfighting processes and procedures that the tool would need to support.\nInteractive KGs are a natural addition to this sort of a tool.\nThrough Phase I, INSIGHT Blue will begin with a focus on dynamic KG development in the context of the Indo-Pacific fight that is then informed by our sprint week IR&D insights so that the Phase II prototype has immediate relevance to an operator it would be demonstrated to.\nRequired certifications for Phase II.\nAF244-0001 calls for both Phase I and II to be completed in unclassified environments.\nCompass Blue effectively has the tools, environment and contributing support from IR&D “partners” to complete our work.\nWe have a commitment for data sets from the 174 ATKW (MQ-9 based) and others when we have need for the Phase II.\nThese will extend from the existing Red Book data sources published by the Naval War College (NWC) for Phase I.\nWe have established contact with some of the NWC authors behind the Red Books to include the NWC Director, China Maritime Studies Institute (CMSI) who has offered us the ability to discuss Red Book content with him, if needed23.\n6.\nCommercialization Strategy.\nCompass Blue’s strategy in the DoD warfighter technology development space includes focusing on improved solutioning for HMT capabilities.\nWhile our first proposal-based foray in that direction pursues a practical human performance measurement tool (called ABLE YARDSTICK) that acts as a HMT Performance Rheostat enabling dynamic rebalancing of the human and machine (AI) components of a HMT, follow-on HMT efforts will extend to tools that understand the real- time demands of the battlespace to help AI provide informed recommendations to their human masters as to what activities AI should take over or augment to help the human maintain focus on their main decision-making responsibilities.\nCommercialization across the rest of DoD.\nDynamic KG technology could be an extension to nearly every one of the 52 discrete decision functions that have been defined so far in the DAF TM and describe four of the eight decision domains that comprise Joint and Combined Operations.\nKnowledge discussions and gaps come up in 20 instances in the latest TM publication.\nFor one 23 Christopher H.\nSharman, CAPT USN (Ret.), Director - China Maritime Studies Institute (CMSI), 中国海事研究 所 , Office: 401-856-6019, MLH Room 316 christopher.sharman@usnwc.edu Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 18 of 24",
        "26": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness discrete decision function (Battle Analysis’ Assess Nodal Interactions decision function) “Knowledge Graph” is called out as the specific tool solution in its description: TM-BA.2.ANI Assess Nodal Interactions (ANI) builds, updates, and refines a knowledge graph with all combinations of explanations of objects in an Operational Environment.\nANI explanations (EntityHypotheses) form compositions, how they provide or consume resources from each other, how they support or threaten each other, in what activities they are often found together, and how all of those relationships depend on other relationships and on time and context24.\ncharacterizes how those At this pre-Phase I stage, our commercialization strategy within DoD is to assess the scope and scale of dynamic KG utility across warfighter activities in Joint and Combined Operations.\nWith the knowledge gathered from our Phase I feasibility study we will narrow the KG commercialization focus to the top three operational environments best served by this technology.\nCommercialization in other Federal Agencies.\nOur strategy will be informed by our DoD strategy and customer need.\nCommercialization in private sector markets.\nWe are currently finalizing a technology licensing arrangement with MIT-LL based on their desire for a company to commercialize a Utility Infrastructure decision support technology that provides real-time understanding of residential and commercial customer power outages (https://www.ll.mit.edu/sites/default/files/other/doc/2023- 02/TVO_Technology_Highlight_29_Cyber_Sensing_Power_Outages.pdf).\nIt has the potential to accurately map outages across the entire United States.\nOur insights from the Phase I feasibility study for Air Force purposes will quickly inform us of the practical utility dynamic KGs could serve in improving the Utility Infrastructure decision support technology we intend to mature and fund through wall street investors and utility industry customers.\nMarket need and size.\nDynamic KG technology has applicability in any area experiencing a transition to greater automation and use of AI in support of real-time recommendation systems, trend analysis, anomaly detection, fraud detection, personalized search, question answering systems that require context-aware responses, event tracking, and complex relationship mapping across different data sources where the relationships might change over time.\nThis is a very broad market and requires refinement based on specific sector(s) being served.\nTwo specific opportunities Compass Blue will pursue are the use of dynamic KGs in conjunction with the insights into Joint and Combined Operations for the Air Force, and separately, their use in maturing the private sector application of the licensed MIT-LL Utility Infrastructure decision support tool.\nAssuming 1Q CY2025 starts for both this SBIR Phase I, and for our licensing arrangement with MIT-LL we don’t expect to see returns (results) specific to dynamic KGs until: • USAF use case: CY2026 assuming our Phase I successfully transitions to a Phase II SBIR • Private sector use case: could be late CY2025 assuming we are successful in our plan to gain wall street interest and initial funding for maturing the MIT-LL licensed tool 24 Distro A ABMS CFT documents shared by Maj Luke Cepil, 23 Oct 2024, page 4 Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 19 of 24",
        "27": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness Key Personnel.\nCitizenship Education Michael Wheeler | Principal Investigator U.S.\nCitizen PhD-Geography (Syracuse University, 2009), MBA-Technical Innovation Management (SUNY-Oswego, 2017), MA-IR/Strategic Studies (Johns Hopkins, 1992), AB-Computer Science (Brown University, 1988) Experience Technology Expertise Agile Software Development: Certified Scrum Product Owner (CSPO), scrum master Analysis packages: Matlab, RapidMiner, Open Computer Vision (OpenCV), various stochastic and multi-dimensional Java libraries AI / Big data analysis: Tensorflow, Pytorch, Stanford Core NLP framework, Stanford Network Analysis Project (SNAP), Amazon Web Services (AWS), Hadoop, ELK (Elasticsearch, Logstash, Kibana), Business process tools: Deltek Customer Relations Management (CRM), Salesforce, Gartner Research, SRC internal cost estimating, SRC internal staffing, SRC internal lead tracking system Cloud / virtualization environments: Amazon Web Services (AWS), VMWare, VirtualBox, Pivotal Cloud Foundry Containerization: Docker, Kubernetes (k8s) Foreign languages: German, Japanese, Spanish, French Gaming Engines: Unreal Engine 5 Geographical Information Systems (GIS): ESRI (ArcMap, ArcScene, ArcGIS, ArcInfo), Google Earth, AGI (Satellite Toolkit, Cesium), Orthobase (Imagine), ENVI, Open Geospatial Consortium (OGC) [CSW, WFS, WMS, WCS] AI / Machine Learning, NLP: tensorflow, pytesseract, Stanford CoreNLP, scikit-learn / pandas, pytorch, TritonInferenceServer Programming languages: Java, Python, C, C++, C#, Go, Pascal, Visual Basic, Perl, Tcl, et.\nal.\nDatabases: Relational: Sybase, Microsoft, Oracle, Postgres, MySQL; Other: MongoDB, Elasticsearch (ELK), AWS Redshift Security clearance: Top Secret/SCI (active) Employment History Northrop Grumman Corp (NGC) – Rome, N.Y.\n[11/2023 – 6/2024] • Business Development Lead - Coordinate BD activities across NGC in support of AFRL/RI • Senior Principal Engineer, Systems - Deployed Data Infrastructure (DDI) consortium, subproject of USAF Advanced Battle Management System (ABMS) Nine Hill Tech – New Hartford, N.Y.\n[04/2023 – 08/2023] • Business Development Director, Intelligence Integrated FMV algorithms into Nvidia’s Triton Inference Server Investigated integration of FMV with AFRL’s IMPACT intelligence architecture o o o Business development (BD) lead for a Fiscal Year 2024 start in AI + targeting Rebellion Defense, Inc.\n– Washington, D.C.\n(remote) [10/2021– 04/2023] • Solutions Architect o Developed streamlined AI/ML pipeline for multi-INT fusion o Developed modeling & simulation tools for simulating Synthetic Aperture Radar (SAR) using Unreal Engine 5 and Cesium Ion to improve AI/ML models o Manager for cooperative research and development agreement (CRADA) with AFRL/RI SRC, Inc.\n– North Syracuse, NY Lead Software Engineer, Research Engineer, Manager Commercial Cyber Products [11/2006 – 12/2020] Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 20 of 24",
        "28": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness • Business Development (US Gov) o Developed new business areas in Activity Based Intelligence (ABI), Full Motion Video (FMV) fusion, Internet of Things (IoT), and critical infrastructure (CI) modelling o Customers included US Air Force, US Army, Intelligence Community (IC).\nPartnerships with DoE labs and other military contractors; Wrote 50 whitepapers / 7 proposals (6 led to funding) o Collaborated with other parts of the company (SRCTec, Radars & Sensors) for BD pursuits • Software Lead o Served as company-wide geovisualization expert with Google Earth Server, AGI’s Satellite Toolkit, Cesium, etc.\no Managed (PM) Air Force projects in Internet of Things (IoT) development and critical infrastructure modelling, including development of electrical grid analysis using Voronoi diagrams in ESRI ArcMap, QGis o Led technical team and business development efforts in Unmanned Aerial Vehicle (UAV) intelligence o Principal Investigator (PI) for research and development (R&D) efforts in geolocation of RF location (for an IED trigger), 3d geometry generation from mobile devices, and underground structure detection Integrated 3rd party software (from MIT Lincoln Labs) into AFRL’s Open Architecture Distributed Common Ground Station (OA-DCGS) fusion baseline Integrated Product Team (IPT) lead for EW algorithms for ASPIRE (Electronic models from Intercepts) o o o Led IR&D effort to create Electronic Warfare (EW) editing tools in Google Blockly o Senior S/W engineer on NASIC effort to modernize SIGINT tools in Flexible Flyer o Senior S/W engineer on Open Architecture (OA) effort combining radars and full motion video for border security • Business Development (Commercial) o Business manager for DNSentinelTM product using Big Data Analytics to provide cyber intelligence to Wall Street sell-side banks and hedge funds o Discussions about partnerships and resale, including C-suite level discussions with large, Wall Street firm o Business development lead for cyber security product for electrical utilities, including joint venture w/ Canadian company for Natural Resources Canada (NRCan) [ITAR requirements] Penn State University Geography, GeoVISTA Studio – State College, PA [01/2000 – 05/2001] • Project Manager, Lead Developer o Served as PM for Studio – a visual programming environment which integrated maps, viz tools, machine learning, and analysis o Developed dynamic Parallel Coordinate Plot (PCP) and Visual Classified for large, multivariate data sets (e.g., US census) D.\nE.\nShaw Securities, Japan - Tokyo, Japan (www.deshaw.com) [10/1995 - 12/1998] • IT Manager, Business Development Manager, Vice President o Developed preliminary Japanese, Internet-based securities trading business  Technical liaison with company’s Boston office to internationalize US product  Collaborated with Hitachi as domestic partner for this Japanese business o Developed strategy and pursued plan for Tokyo Stock Exchange (TSE) membership o Managed and developed all aspects of securities business for Tokyo office  Lead developer for proprietary Japanese stock trading strategy  Technically led Japanese stock basket-trading customer business  Developed back-office database / settlement software for reconciling and clearing trades  Managed department personnel Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 21 of 24",
        "29": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness  Coordinated relationships with technical prime brokers and back office clearing partners   Remote project manager & trainer for software development campus in Hyderabad IT Infrastructure initiative for re-engineering firm’s core trading software Interactive Television Corporation (ITC) - Rosslyn, VA [03/1995 - 09/1995] • Computer Engineering - Developed version 2 of intelligence analysis system (Generic Messaging System (GMS)) that combined natural language processing (NLP) and inference engine to highlight threats to US interests Perspective Technology Corporation - Alexandria, VA [01/1994 - 02/1995] • Senior Consultant to Mobil Oil Corporation, Fairfax, VA o Served on Architecture Team for $45 million GENESYS project to develop an integrated trading, hedging, supply and distribution, and risk management system for Mobil Oil’s global operations o Designed common business architecture, database schema and user interface tools to support complex user roles and interactions o Worked with database team for world-wide, replicated architecture Typesetting Solutions Inc.\n(TSI) - Alexandria, VA NCR, Engineering and Manufacturing - San Diego, CA [02/1993 - 12/1993] • Vice President - Developed page layout and workflow automation system for Olan Mills Portrait Studios [06/1988 - 08/1990] Team Lead / Systems Programmer - Large-scale port (250K lines) of NCR's legacy Mainframe architecture to Open Systems (UNIX) • o Wrote automated scripting environment for large-scale code translation (300% time savings) o Developed customed interprocess communication device drivers to handle prioritized requests o Wrote device driver and kernel modifications for a transparent, multi-process debugger Relevant Awards or Patents or Experiences ACADEMIC HONORS • National Science Foundation (NSF) Graduate Research Fellowship (PhD) • Merrill Foundation Fellowship (MA) • Olin Foundation Fellowship (MA) [08/2001-08/2004] [09/1991-05/1992] [09/1991-05/1992] TEACHING • D.\nE.\nShaw Software Laboratory – Hyderabad, Andhra Pradesh, India [01/1997-12/1998] o Corporate Trainer , Remote Project Manager - Taught quarterly training course on financial products, securities business, and Java software development • Syracuse University, University College – Syracuse, NY [09/2004-12/2005] Publications Wheeler, Michael Terence, \"Visualizing the transportation effects of urban mercantilism: Eastern New York, 1822-1860\" (2009).\nGeography - Dissertations Gahegan, M., M.\nTakatsuka, M.\nWheeler, and F.Hardisty, 2000.\nGeoVISTA Studio: A geocomputational workbench.\nIn: Proceedings, GeoComputation 2000, Greenwich, U.K.\nCitizenship: Education: EMIL FILKORN, KEY PERSONNEL – WARFIGHTER SUBJECT MATTER EXPERT U.S.\nCitizen Bachelor of Science, Aeronautical Engineering; Rensselaer Polytechnic Institute, 1990 EMPLOYMENT HISTORY Vice President, Strategy Development – Systematic C2 Aug 2024 to Present Develops and implements strategies to support the company's mission of providing operational validation and assessment of emerging technologies, tactics, and tools in support of command and control modernization initiatives within the Department of Defense; provides SETA services to DARPA (see Vol 5 for more info) • Oversees the management of a team of operational/technical experts to validate/assess potential C2 capabilities to meet DARPA requirements, ensuring compliance with all regulations and contractual requirements Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 22 of 24",
        "30": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness • Leads the development, execution, and analysis of operational assessment activities in support of DARPA identified future capabilities; maintains relationships with gov’t clients, subcontractors, and other stakeholders May 2022 to Present Owner, CEO Compass Blue LLC Senior military executive with over 31 years of command, leader, manager and follower experience across Department of Defense Acquisition, operations, command and control and Joint/Inter-Agency communities.\nExperienced collaborator of teams and individuals convinced solutions start with the application and empowerment of trusted and diverse human talent at every level of skill and maturity.\nAcquired PMP certification • Helped author Omni Federal’s win of $1.25M DoD SBIR 22.2 AF222-D017 Phase II SBIR with 711 HPW • Led or supported 23 SBIR/STTR submissions winning 3 ($2.8M); selected/not funded status for 11 others • Principle contributor to Omni Federal Air Force strategies, engagements and warfighter understanding Senior Professional Staff II - Operational Systems Engineer – JHU APL Supported Cruise Missile Defense of the Homeland (CMD-H), Agile Combat Employment (ACE) and Air Base Air Defense (ABAD) efforts, as well as expanding APL/Air Missile Defense Sector activity within the DAF.\n• Gained SAF/AQI interest for APL CMD-H work w/n first 30 days; added to APL PEO C3BM leader team • Supported Multi-Domain Killchain Analysis, improved Over The Horizon Radar, Automated Battle Jan 2023 to Jun 2023 Management Decision Aid development, Counter-Unmanned Aerial System Decision Aid development • Completed 12-week APL Digital Engineering Introduction and 7-week APL Artificial Intelligence Introduction Oct 2019 to Aug 2022 Chief, Architecture Force Integration - Chief Architect Office – SAF/AQ First operationally-qualified military member assigned to the DAF CAO; instrumental in stand-up of initial team responsible for the Air Force’s #1 priority contribution to Joint All Domain Command and Control (JADC2) • Collaborated on JADC2 technology maturation across five Combatant Commands and three Services; supported Service Chief Onramp engagements leading ABMS to its Program Element Office transition • Supported transition of FY21 $203M ABMS program to the Air Force Rapid Capabilities Office within 1 year • Established the organizational framework and brokered the selection of one-half of our manpower hires • Leading team’s development/fielding of a commercial infrastructure & enterprise architecture enabled deployable comm capability: Integrated Warfighting Network – Edge Connect; vastly improved bandwidth, smart-resilient-prioritized routing, multi-classification access for data and Mobile Solutions Dec 2016 to Dec 2019 Chair, ANG Battle Control Center (BCC) Weapons System Council Led Homeland Defense tactical C2 commanders and functional weapons systems teams across geographic command (IndoPACOM, NORAD NORTHCOM) and political (US, Canada) borders; gained BCC equity Precursor stakeholder creating BCC voice with influence on ABMS, force providers, PEOs, CCMD/Components Commander, Eastern Air Defense Sector – NORAD/NORTHCOM Jun 2016 to May 2020 Responsible to the 3-star commander of First Air Force for the EADS 24/7 mission defending 180M Americans east of the Mississippi river and the financial (NYC) and political (D.C.) capitals of the world from air attack.\n• Defined and maintained the combat crews and necessary conditions supporting the 24/7/365 success of air defense operations by over three hundred warfighters responsible for the safe and effective employment of twenty-one alert fighter aircraft, and the only airspace defended by Army surface to air missiles in the United States; required motivated, trained, and engaged airmen operating command, control, and communications • Mission owner for Homeland Defense advanced program Military Utility Assessment; Pathfinder concept • Tactical C2 leader for Counter-small Unmanned Aerial Systems development for the National Capital Region • Maintained operational qualifications at 601st Air Operations Center & EADS Battle Control Center systems Publications Brower, W.\nB., Jr., Eisler, E., Filkorn, E.\nJ., Gonenc, J., Plati, C., and Stagnitti, J.\n(December 1, 1993).\n\"On the Compressible Flow Through an Orifice.\" ASME.\nJ.\nFluids Eng.\nDecember 1993; 115(4): 660–664.\nhttps://doi.org/10.1115/1.2910195 7.\nForeign Citizens.\nNone.\n8.\nFacilities/Equipment.\nNo additional facilities or equipment will be needed for this effort.\n9.\nSubcontractors/Consultants.\nCompass Blue will not be partnering on this SBIR effort at proposal submission deadline.\nWe continue to work a partnership agreement with MIT-LL Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 23 of 24",
        "31": "Proposal Number F244-0001-0095-INSIGHT-Blue Topic Number AF244-0001 Interactive Knowledge Graphs for Situational Awareness for drone swarm library access, and technical support within SBIR BAA guidelines not to exceed 1/3rd allowable subcontracted work.\n10.\nPrior, Current or Pending Support of Similar Proposals or Awards.\nNo prior, current, or pending support has been provided for proposed work.\n11.\nTechnical Data Rights.\nNone.\n12.\nIdentification and Assertion of Restrictions on the Government's Use, Release, or Disclosure of Technical Data or Computer Software.\nNone.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 24 of 24",
        "32": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Cage F244-0001-0095 AF244-0001 INSIGHT Blue 11/06/2024 10:33:17 AM Compass Blue 3934 Number Nine Road, Cazenovia, New York, 13035 DOD6fMSEUMee 9Q4M0 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 15%) x Base (TDL) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (6%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) $139,997.98 $139,997.98 $0.00 $0.00 $0.00 $116,834.31 $0.00 $0.00 $0.00 $0.00 $0.00 $15,239.26 $132,073.57 $0.00 -$0.00 $7,924.41 $139,997.98 $0.00 $0.00 $0.00 $0.00 $0.00",
        "33": "Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Computer and Information Research Scientist/ Principal Investigator Chief Executive/ Operational SME (Emil Filkorn) Subtotal Direct Labor (DL) Labor Overhead (rate 15%) x (DL) Total Direct Labor (TDL) G&A (rate 0%) x Base (TDL) Cost Sharing Profit Rate (6%) Total Estimated Cost TABA Year 2 Direct Labor Costs Category / Individual-TR Not Specified/ Principal Investigator Subtotal Direct Labor (DL) Labor Overhead (rate 0%) x (DL) Total Direct Labor (TDL) $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $106.84 702.1 12 $9001.48 $84,013.85 $175.00 89.7 12 $1883.70 $17,581.20 $101,595.05 $15,239.26 $116,834.31 $15,239.26 -$0.00 $7,924.41 $139,997.98 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $106.00 0 12 $0.00 $0.00 $0.00 $0.00 $0.00",
        "34": "G&A (rate 0%) x Base () Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Emil Filkorn Phone: (315) 254-0162 Phone: emil.filkorn@compassblue.ai Title: Proposal Owner $0.00 -$0.00 $0.00 $0.00 $0.00 If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: No Select the Type of Payment Desired: Partial payments",
        "35": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Computer and Information Research Scientist Principal Investigator PhD Chief Executive Operational SME Bachelor's Degree 28 35 702.1 $106.84 12 $84,013.85 89.7 $175.00 12 $17,581.20 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nDL compares favorably to state averages Direct Labor Cost ($): Year2 $101,595.05 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Not Specified Principal Investigator PhD 0 0 $106.00 12 $0.00 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nNA - per BAA direction - topic has a shorter duration than 2 years - entering placeholder values, such as zeros or N/A, for any fields for which I do not have data to enter.\nDirect Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) $0.00 $101,595.05 15",
        "36": "Overhead Comments: Office Space Overhead Cost ($): Year2 Labor Cost Overhead Rate (%) Overhead Comments: NA - less than two years Overhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nHome Office for hybrid work; utilities, insurance, legal fees, HR-IT-Purchasing contractor expense, Business Development, finance and accounting, purchasing, contracts and compliance G&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nNA - less than two years $15,239.26 0 $0.00 $15,239.26 15 NO YES $15,239.26 0 NO NO",
        "37": "G&A Cost ($): Sum of all G&A Costs is ($): Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: NA - less than two years Profit Rate (%): Profit Explanation: NA - less than two years Total Profit Cost ($): Total Proposed Amount ($): $0.00 $15,239.26 -$0.00 6 $7,924.41 -$0.00 0 $7,924.41 $139,997.98",
        "38": "Emil Filkorn, Compass Blue Nov 05, 2024 Nov 05, 2025"
    },
    "images": [
        {
            "page": 1,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page1_img1.jpeg",
            "hash": "963c69c169799696",
            "position": "Middle Center"
        },
        {
            "page": 8,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page8_img1.jpeg",
            "hash": "8b80957e788fbc70",
            "position": "Top Right"
        },
        {
            "page": 9,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page9_img1.jpeg",
            "hash": "8b80957e788fbc70",
            "position": "Top Right"
        },
        {
            "page": 10,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page10_img1.jpeg",
            "hash": "8b80957e788fbc70",
            "position": "Top Right"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page11_img1.jpeg",
            "hash": "8b80957e788fbc70",
            "position": "Top Right"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page12_img1.jpeg",
            "hash": "8b80957e788fbc70",
            "position": "Top Right"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page12_img2.jpeg",
            "hash": "d01eff1523e4a0b6",
            "position": "Top Center"
        },
        {
            "page": 13,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page13_img1.jpeg",
            "hash": "8b80957e788fbc70",
            "position": "Top Right"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page14_img1.jpeg",
            "hash": "8b80957e788fbc70",
            "position": "Top Right"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page14_img2.jpeg",
            "hash": "be629b8fc61cc185",
            "position": "Top Center"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page15_img1.jpeg",
            "hash": "8b80957e788fbc70",
            "position": "Top Right"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page15_img2.png",
            "hash": "cebb3bee91908621",
            "position": "Top Center"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page15_img3.png",
            "hash": "fe71746cf087848a",
            "position": "Middle Center"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page16_img1.jpeg",
            "hash": "8b80957e788fbc70",
            "position": "Top Right"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page16_img2.jpeg",
            "hash": "ec607270796d7171",
            "position": "Top Center"
        },
        {
            "page": 17,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page17_img1.jpeg",
            "hash": "eb1efce20153e494",
            "position": "Top Center"
        },
        {
            "page": 17,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page17_img2.jpeg",
            "hash": "8b80957e788fbc70",
            "position": "Top Right"
        },
        {
            "page": 18,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page18_img1.png",
            "hash": "ef3c902fa5d290d2",
            "position": "Top Center"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page19_img1.jpeg",
            "hash": "a89fd78296609769",
            "position": "Top Center"
        },
        {
            "page": 20,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page20_img1.jpeg",
            "hash": "9c4a65b27299cba5",
            "position": "Middle Center"
        },
        {
            "page": 21,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page21_img1.jpeg",
            "hash": "839cfc72d82536c9",
            "position": "Top Center"
        },
        {
            "page": 21,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page21_img2.jpeg",
            "hash": "fe9ccb63b44b8034",
            "position": "Middle Center"
        },
        {
            "page": 23,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page23_img1.png",
            "hash": "fe0909b1919d95dc",
            "position": "Middle Center"
        },
        {
            "page": 32,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page32_img1.png",
            "hash": "834987a6cf38ccb6",
            "position": "Top Left"
        },
        {
            "page": 38,
            "image_file": "docNAC01FB7453533a7d6aa8e5c26a8b8e890d6a748b94bc2cf73811f3dc0e6659cf4b3bdd8950f1_page38_img1.jpeg",
            "hash": "c6cc2b23999bb24d",
            "position": "Middle Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "sbir.gov",
        "name": "N/A",
        "phone": "N/A"
    }
}