{
    "filename": "docNAC01FB745353a69b0fb7e1fe5d3a7ae37e8d0770c82aaac576ed3567d3f831f5b3e762211509.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0066 Proposal Accelerating Knowledge Representation and Situational Awareness using Title: Knowledge Graphs Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: Peircy inc.\nAddress: Website: UEI: CAGE: 2625 Ocean Beach HWY, Longiew, WA 98632-3507 www.peircy.com WFATZJHNKFQ5 SBA SBC Identification Number: 002659516 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 2 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_002659516 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_002659516.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO N/A NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [X] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Title Business Name Date Megan Trinneer Megan Trinneer CEO Peircy inc.\n09/05/2024",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?NO VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: For the Phase I proposal, we seek to improve the interactive qualities of a human engaging with a knowledge graph with an applied research plan intended to assess the feasibility of engineering (1) a new method of generating synthetic data (machine inferences about humans) and (2) a human-agent data validation and verification protocol.\nShould such methods prove viable, we plan to pursue a broader system design and engineering program in Phase II that will better equip the Air Force to improve the design, engineering, and operation of current and planned knowledge graph systems, and ultimately accelerate the performance of humans and teams who engage with such knowledge graph systems in multi-domain and contested environments.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: We seek to contribute to the Air Force’s efforts to develop methods for fusion, analysis and reasoning of multi-source data contributing to human machine situational awareness and combat performance.\nPeircy’s individual domain knowledge graphs for situational awareness have relevance to the BIOTECH solutions currently in development by the Air Force Research Laboratory (AFRL).\nIn order for these systems to positively impact explainability, trust, and interdependence in evolving human-machine relations and workflows they will be required to generate valid, and verified synthetic data for machine understanding of users.\nSimilar to the Air Force, healthcare services are increasingly dealing with exponential growth of data and looking for ways to organize and understand data being ingested into knowledge systems from a huge array of multimodal inputs.\nAs an industry, healthcare is seeking ways to integrate the person into knowledge systems in order to address a growing, ‘...gap between how well a system could perform if it tailors results to the individual, and how well it performs by returning results designed to satisfy everyone.’ (Teevan et al., 2010).\nThis opportunity is referred to as the potential for personalization and Peircy’s personal domain knowledge graph is positioned to close this gap in important ways.",
        "5": "Attention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: 1,2,3 List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: Knowledge graphs for situational awareness, Knowledge graph management for new data, corrections and gaps, knowledge graph user experience, team specific non-verbal communication, data fusion that integrates shared information from pre and post flight ground operations, flight device readings and alerts.\nVOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\n3.\nDuring the performance of the contract, the research/research and development will be performed in the United States.\n68.77% 31.23% YES YES 4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\nNO YES",
        "6": "7.\nThere will be ITAR/EAR data in this work and/or deliverables.\n8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO NO NO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\n15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\n16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nNO NO 38% NO NO VOL I - Contact Information Principal Investigator Name: Mr.\nJames O'Kane Phone: (973) 615-1621 Email: jb@peircy.com Address: 2625 Ocean Beach HWY, Longiew, WA 98632 - 3507 Corporate Official Name: Megan Trinneer Phone: (206) 832-9356 Email: megan@peircy.com Address: 2625 Ocean Beach HWY, Longiew, WA 98632 - 3507",
        "7": "Authorized Contract Negotiator Name: Dennis Holden Phone: (757) 630-0243 Email: dennis@piercy.com Address: 2625 Ocean Beach HWY, Longiew, WA 98632 - 3507 Form Generated on 11/05/2024 05:52:14 PM",
        "8": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\nAccelerating Knowledge Representation and Situational Awareness Using Knowledge Graphs Volume 2: Technical Volume This proposal includes data that must not be disclosed outside the Government and must not be duplicated, used, or disclosed – in whole or in part – for any purpose other than to evaluate this proposal.\nIf, however, a contract is awarded to this offeror as a result of – or in connection with – the submission of this data, the Government has the right to duplicate, use, or disclose the data to the extent provided in the resulting contract.\nThis restriction does not limit the Government's right to use information contained in this data if it is obtained from another source without restriction.\nThe data subject to this restriction are contained in pages 1, 2, and 3.\n1.\nIdentification and Significance of the Problem or Opportunity.\nA key shortcoming of knowledge graph systems is their core cognitive design goal of representing knowledge built on consensus or shared understandings.\nWhen faced with the challenge of enabling human-machine teaming, these systems must generate ‘best guess’ predictions based on such consensus knowledge and understandings.\nMoreover, such systems encounter difficulties when attempting to adapt to dynamic real-world conditions such as battlefield operations and the unpredictability of combat.\nBut what if knowledge graph systems could adjust to an individual user's unique information processing abilities, current knowledge states, and propensity to share knowledge?\nTo dynamically and productively interact with a human, knowledge graph technologies must move beyond UX design paradigms that focus on digital interface design and integrate with adjacent systems that accurately model the internal context of the human’s situational awareness (perception, comprehension, projection) when engaging with such technologies.\nWe hypothesize that as next generation knowledge graph systems integrate multimodal data sources (text, image, audio) and seek to become more interactive, the generation of valid and verified machine inferences about users will be a core operational requirement.\nNext generation knowledge systems that meet this requirement will be positioned to positively impact explainability, trust, and interdependence in evolving human-machine relations and workflows.\nTo maximize the performance of human-knowledge graph interaction, we account for specific individual-level factors.\nWe maintain that the shortcomings of machine understanding of humans can be significantly remedied by new engineering and modeling approaches informed by greater insight into fundamental categories and structures involved in human learning from experience.\nFor this proposal, we focus on learning dynamics that represent how humans learn from Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 1 of 14",
        "9": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\nexperiences of objects and relations between objects within simulated environments and knowledge graph instances.\nOpportunity: Modeling the Human Learning Experience When an individual engages with a digital technology, a unique context is established.\nWe define this context as a situation that contains information useful for solving an inference problem (Steinberg, 2016).\nFor this proposal, we specify this context as a human experiencing objects embedded within a knowledge technology (e.g.\nsimulation or knowledge graph).\nThis operational definition affords knowledge engineers an opportunity to (1) gain insight into how a particular human perceives, understands, and takes action given a knowledge graph instance, and (2) target attributes of human learning from experience that can be exploited to improve the presentation, relevance and quality of information.\nFrom a group performance perspective, the ability to account for and federate individuals’ interactive learning experiences of a particular knowledge graph is an adaptive capability that will allow knowledge graph designers and engineers to aggregate separate learning experiences and discover what is true operational shared knowledge and understandings across a group or population.\nSuch findings can be used (1) to fine-tune and correct baseline knowledge assumptions within knowledge graphs in order to achieve work group / team objectives, and (2) to elicit and contribute new tacit (unshared) knowledge from each individual’s perspective.\nWe believe such functionality will have valuable implications for broader team performance goals (information sharing, coordination of tasks, correction of erroneous information) driven by improved distributed situational awareness.\nMethod: Semiotic Modeling Given both individual and group level perspectives, we maintain that the possibilities inherent in semiotic modeling and engineering as complementary to and directive of other methods indicate the importance of testing their scientific, technical and commercial merit and feasibility.\nThe discipline of semiotics construes human experience, human habits, and human behavior in particular environments as a sign-process.\nA person’s experience is always contextual, and is always the experience of an object through a sign (or signs).\nTo experience objects is thus to interpret them on the basis of their signs, eliciting outcomes called interpretants.\nThe modeling of experience as such, while having some common features with existing forms of knowledge representation, differs from them in that the knowledge represented is not knowledge in a public or ostensibly “neutral” sense, but relative rather to the individual person and their experiential perspectives.\nIn this semiotic modeling approach, an experienced object is not a mere “thing”, but a thing manifested or disclosed to a person through certain signs and eliciting certain judgments, feelings and behaviors on the basis of that disclosure.\nThe semiotic model seeks precisely to capture the sign-process (semiosis) constituting this person’s experience.\nInnovation: Individual Knowledge Graph Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 2 of 14",
        "10": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\nThe cognitive structure at the heart of experience as a sign-process is an irreducibly triadic structure, in which the encounter with an object through a sign yields an interpretant.\nA triadic data model is a novel type of semantic network based on fundamental principles derived from semiotics, the study of the action of signs.\nA triadic data model aims to directly represent the process of a particular human learning from experience, by discovering and representing the evolving set of interpretive rules that in fact govern an individual’s performance in specific environments.\nThe triadic data model can be used to structure and assemble a broader semantic network that represents a human person/user’s experience of objects in real and/or virtual environments, together with relevant domain knowledge.\nFor this proposal, we refer to this broader semantic network as a person’s individual knowledge graph.\nBased on a triadic data model, we plan to engineer a system that will generate a new form of synthetic data that represents the cognitive, affective and behavioral properties of a human actor.\nRelevant to this proposal, an individual’s knowledge graph can be constructed from such data.\nWe maintain that interpretive rules have the potential to mirror the properties of how specific humans experience specific, real-world environments (physical or virtual).\nStructured as an evolving set of rules (building blocks), such data contain an internal logic and essential structure enabling specific rules to represent and infer how a person in a situated context uniquely interprets, interacts, and adapts (high validity).\nValid rules governing an individual’s experience can then be generalized to connect patterns of an individual's experience to more general group patterns of shared knowledge and understanding.\nThus, the knowledge engineering challenge can be construed as an alignment and validation task between a machine knowledge system representing an operational domain, and a human knowledge system representing an individual’s learning experience of that particular machine knowledge system.\nFrom a next generation systems perspective, we envision a third actor, a software agent engineered to leverage an individual knowledge graph in order to interpret and broker alignment and validation tasks (see Figure 1).\nFigure 1: Envisioned Human-agent Knowledge Graph System Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\nPage 3 of 14",
        "11": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\n2.\nPhase I Technical Objectives.\nTo improve the interactive qualities of a human engaging with knowledge graph technologies, the goal of this Phase I proposal is to establish a solid foundation for Phase II by enacting an applied research plan intended to assess the feasibility of engineering a new method of generating synthetic data (machine inferences about humans) and a human-agent data validation and verification protocol.\nShould such methods prove viable, we plan to pursue a broader system design and engineering program in Phase II that will better equip the Air Force to improve the design, engineering, and operation of current and planned knowledge graph systems, and ultimately accelerate the performance of humans and teams who engage with such knowledge graph systems in multi-domain and contested environments.\nOur applied research plan will be organized around a pilot training simulation use case in order to demonstrate and capture how learning occurs as a human interacts with a dynamic simulation environment informed by knowledge technologies.\nWe anchor and align our proposal with prior work conducted under the Department of the Air Force / Massachusetts Institute of Technology Artificial Intelligence Accelerator Programs.1 Specifically, we plan to use the Multimodal Physiological Monitoring During Virtual Reality Piloting Tasks Database (https://physionet.org/content/virtual-reality-piloting/1.0.0/) developed under the Objective Performance Prediction & Optimization Using Physiological and Cognitive Metrics project.\nWe seek to evaluate the feasibility of using semiotic engineering methods to direct the application of neuro-symbolic programming techniques for representing and encoding multimodal physiological monitoring data of participants performing virtual-reality flight tasks.\nSpecifically, we focus on the cognitive challenge of semantic integration, how humans combine and make sense of diverse concepts and relationships.\nWe seek to determine whether our approach can be applied to (1) modeling the human experience of concept formation, (2) the engineering and mathematical techniques associated with concept representation, and (3) the outlining of a human-agent system symbolic communication protocol.\nThe following technical objectives will be pursued in response to their respective research questions: Technical Objective 1: Using a triadic data model, semiotically represent and encode individuals’ simulation experience(s) as indicated by multimodal physiological monitoring data.\nResearch Question 1.1: Guided by a task model, can triadic data modeling be used to transform a set of sensory and semantic cues from a virtual-reality flight interface and multimodal physiological monitoring data?\n1 Reference: United States Air Force Research Laboratory and the Department of the Air Force Artificial Intelligence Accelerator Cooperative Agreement Number FA8750-19-2-1000",
        "12": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\nResearch Question 1.2: If detected, can such cues function as updates to semantic content (indices, icons, symbols, semantic relationships, concept hierarchies) embedded within an individual knowledge graph representing an individual’s evolving set of interpretive rules?\nTechnical Objective 2: Evaluate the ability of triadic data and relationships between data to express conceptual structures embedded within an individual’s multimodal physiological monitoring data.\nResearch Question 2.1: Can Semiotic-Conceptual Analysis (SCA), a mathematical formalization of basic semiotic notions, be applied as a method for expressing conceptual structures embedded within multimodal physiological monitoring data and an individual knowledge graph?\nResearch Question 2.2: Can SCA be used to augment or compliment current scientific and industry conceptual modeling approaches focused on concept formation and representation?\nTechnical Objective 3: Determine whether the social nature of signs and communication can be used to inform and structure the design of a human-agent system communication protocol.\nResearch Question 3.1: Can a human-agent system use the symbolic meanings of concepts as a form of non-verbal, symbolic communication?\nResearch Question 3.1: Can a symbolic communication protocol based on human verification enable a human-agent system to propose and validate updates to a domain knowledge graph?\nResearch Question 3.3: Determine if a combination of criteria and methods be used to determine the technical feasibility of a zero trust framework for data validation to occur between a human and software agent while addressing the requirements for protecting sensitive or valuable data as outlined in the Federal Information Processing Standards (FIPS) 140-3.\n3.\nPhase I Statement of Work (include Subcontractors and/or Research Institutions).\nScope: This statement of work outlines a systematic approach for applying scientific and technical knowledge toward the initial design and engineering minimum viable product for aligning a machine knowledge system representing an operational domain, and a human knowledge system representing an individual’s learning experience of that particular machine knowledge system.\nAll work will be completed remotely.",
        "13": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\nTask 1: Kick-off Meeting and Outline of Triadic Data Modeling Approach - Identify key Air Force personnel and determine status reporting periodicity and format.\nDevelop a methodological approach for structuring the fusion and representation of multimodal sensor data in a triadic data model.\nDeliverable: Initial Meeting and Review Summary Report.\nTriadic Data Modeling Document.\nA document outlining the key steps involved in the triadic modeling of multimodal sensor data.\nMethods: Apply a standard data modeling approach to identifying conceptual and logical entity relationships, physical modeling schema, and data mapping and transformation techniques.\nMilestone Schedule: Within 30 days of award / Payment: $20,000 Task 2: Scientific & Technical Literature Review - Conduct a systematic review of scientific and technical literature (pre-print and published) that will target the following domains: symbol-referent mapping, concept modeling (formation and representation), and symbolic communication protocols in multi-agent settings.\nDeliverable: A report synthesizing findings and knowledge gaps.\nMethods: Conduct a systematic electronic search and content analysis of U.S.\nAir Force provided data, research archives, scientific journals, and industry publications.\nMilestone Schedule: Award + 2 months / Payment: $40,000 Task 3: Outline Evaluation Research Objective #1 - Develop an evaluation research design for comparing a subset of current concept modeling approaches to the proposed triadic data approach for modeling concepts.\nDeliverable: Research Design Document # 1 Methods: Select data set, preprocessing, feature extraction/representation, model selection, experimental setup.\nMilestone Schedule: Award + 3 months / Payment: $40,000 Task 4: Outline Evaluation Research Objective #2 - Develop an evaluation research design for comparing a subset of current human-agent symbolic communication protocols to the proposed synthetic data approach for generating machine inferences (interpretive rules).\nDeliverable: Research Design Document # 2 Methods: Select data set, preprocessing, feature extraction/representation, model selection, experimental setup.\nMilestone Schedule: Award + 4 months / Payment: $20,000",
        "14": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\nTask 5: Write Final Report(s) and Phase II Work Plan - Complete final reports summarizing outcomes of Tasks 1-4, and a detailed work plan for Phase II.\nDeliverable: Project summary report, Final report of Inventions and Subcontracts, Final Report with SF298 and Detailed Phase II Work Plan Methods: Complete all required reports.\nMilestone Schedule: Award + 6 months / Payment: $19,880 4.\nRelated Work.\nThe Peircy team possesses a breadth of experience and expertise related to this project.\nThe following activities highlight the team’s understanding of how past work relates to the project: ● Project: SIEM integration for SOC Fusion and Global Visibility Description: Built a Security Event Incident Management (SEIM) solution including licensing, network build, use case build, SOC systems process updates, and reporting.\nClient: Deloitte & Touche LLP Date of Performance: Nov 2016 – March 2019 Point of Contact: Bob Magnus, Senior Manager Global Cybersecurity Deloitte, bomagnus@deloitte.com, 630.215.9136 ● Project: Pilot: Graph Representation for Robotic Process Automation Applications Description: A semantic and graph computing pilot project that exposed hidden risk conditions associated with technology assets and people.\nClient: Technology & Business Services, Wells Fargo & Company Date of Performance: Jan - Aug 2018 Point of Contact: James Toczylowski, Vice President Freddie Mac, james_toczylowski@freddiemac.com, 201.981.4507 5.\nRelationship with Future Research or Research and Development.\nAnticipated Results: Testing for feasibility and evaluations of methods will result in the definition, design and plan for a minimum viable product (MVP) to be built in Phase II.\nSignificance of Phase I Effort: From an industrial and commercial perspective, knowledge graph technologies can leverage this semiotic modeling and engineering to (1) improve the configuration, evolution, and scaling of current and emerging human-machine relationships, (2) increase the accuracy and trustworthiness of knowledge graph interactions, query results and resulting situational awareness, and (3) improve domain knowledge across Joint All-Domain Command and Control operations with validated, high-fidelity experiential and personalized interpretive rule sets - an untapped source of human-systems intelligence and operations.\nClearances, certifications and approvals required for Phase II testing: None are anticipated.",
        "15": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\n6.\nCommercialization Strategy.\nMarket – Air Force Research Laboratory, BIOTECH Market Need - We seek to contribute to the Air Force’s efforts to develop methods for fusion, analysis and reasoning of multi-source data contributing to human machine situational awareness and combat performance.\nPeircy’s individual domain knowledge graphs for situational awareness have relevance to the BIOTECH solutions currently in development by the Air Force Research Laboratory (AFRL).\nIn order for these systems to positively impact explainability, trust, and interdependence in evolving human-machine relations and workflows they will be required to generate valid, and verified synthetic data for machine understanding of users.\nNew systems that meet this requirement are positioned to enable development of technologies already in development in the following ways: Solutions to Airmen and Guardians - AFRL BIOTECH Goals 1.\nProducing fundamental understanding of biological mechanisms and biomarkers indicative of physiological and cognitive states and their responses to operational stressors Peircy Innovation - Our solution uses semiotic engineering methods to direct the application of neuro-symbolic programming techniques for representing multimodal physiological monitoring data of participants performing virtual-reality flight tasks.\n2.\nLeveraging systems and synthetic biology to accelerate human adaptation Peircy Innovation - We push human experience and behavioral adaptation into the world of symbolic representation schema, establishing encoding rules, and creating mapping between concepts and symbols.\nThese methods outline the iterative transition from indices, to icons, to symbols of human understanding making them consumable to machine learning systems.\n3.\nImproving human machine teaming with autonomous systems thru autonomies responding to changes in operator states Peircy Innovation - We apply neuro-symbolic programming tools and techniques as directed by principles of semiotic engineering to (1) the modeling the human experience of concept formation, and (2) engineering and mathematical techniques associated with concept representation, and manipulation.\n4.\nEnabling brain-machine interfaces with autonomous weapons systems Peircy Innovation - To better support distributed situational awareness, we apply semiotic engineering and triadic semiotic modeling techniques to model communication within human-agent systems operating in physical and hybrid environments.",
        "16": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\n5.\nAugmenting decision making via novel Artificial Intelligence and Machine Learning (AI/ML) paradigms Peircy Innovation - We use a Human Digital Twin (software agent) to mediate validation of knowledge graph updates as a person acquires new, relevant knowledge about their environment.\nWe also apply a zero trust framework for data validation between a human and agent addressing the requirements for protecting sensitive or valuable data as outlined in the Federal Information Processing Standards (FIPS) 140-3.\nEnabling AI systems to meet Authority to Operate (AOT) standards for data collection and transmision.\nQuantitative Results Our commercialization strategy within the Air Force and expanding across the Department of Defense is to leverage our technology to further the goals of the Advanced Battle Management Systems (ABMS) program serving as the digital innovation foundation for the Joint All-Domain Command and Control (JADC2).\nAs stated in the March 2022 Department of Defense press release, Deputy Secretary of Defense Kathleen Hicks states that a primary goal is to , ’...enable the Joint Force to \"sense,\" \"make sense,\" and \"act\" on information across the battle-space quickly using automation, artificial intelligence (AI), predictive analytics, and machine learning to deliver informed solutions via a resilient and robust network environment....allowing U.S.\nforces from all services—as well as allies—to receive, fuse and act upon a vast array of data and information in all domains at the “speed of relevance.” Our human centric technology is uniquely positioned to enable this goal across the DoD.\nThe cohort of companies supporting these initiatives where we see Peircy having an impact on revenue generating adoption and scaling are: ● Data Fusion - Anduril Industries, LinQuest Corporation, Venator solutions LLC ● AI Solutions - Anduril Industries, Colorado Engineering Inc ● Interface Solutions - OddBall Inc., VivSoft Technologies LLC ● Training and Readiness - Kratos Technology & Training Solutions Inc.\n● Secure Communications - Red River Technology LLC We estimate Peircy’s market value for commercial licensing to this cohort of ABMS service providers to be $100M.\nPath to Market- The ABMS community of companies onboarded in 2020 represent the best path to market for Peircy solutions within the Air Force and across the DoD applying licensing and unit cost revenue structures depending on the use case.\nMarket – Private Sector/ Healthcare Diagnostics Similar to the Air Force, healthcare services are increasingly dealing with exponential growth of data and looking for ways to organize and understand data being ingested into knowledge",
        "17": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\nsystems from a huge array of multimodal inputs.\nAs an industry, healthcare is seeking ways to integrate the person into knowledge systems in order to address a growing, ‘...gap between how well a system could perform if it tailors results to the individual, and how well it performs by returning results designed to satisfy everyone.’ (Teevan et al., 2010).\nThis opportunity is referred to as the potential for personalization and Peircy’s individual domain knowledge graph is positioned to close this gap in important ways.\nMarket Need - A recent Johns Hopkins University School of Medicine study documented the extent to which misdiagnosis affects society.\nThe study concluded that up to 80,000 of all American deaths can be attributed to misdiagnosis, adding up to nearly $2 billion in approved malpractice claims over a 10-year period.\nPatients are most at risk of misdiagnosis within primary care environments, where one-third of all misdiagnosed cases become serious or life-threatening.\nThe report went on to say, ‘disease-based solutions have already been developed and deployed at Johns Hopkins to address missed stroke, the top identified cause of serious harm.\nThese solutions include virtual patient simulators to improve front-line clinician skills in stroke diagnosis, portable eye movement recordings via video goggles and mobile phones to enable specialists to remotely assist front-line clinicians in diagnosing stroke, computer-based algorithms to automate aspects of the diagnostic process to facilitate scaling, and diagnostic excellence dashboards to measure performance and provide feedback on quality improvement.\nQuantitative Results The Johns Hopkins findings point to a future where diagnosis will be handled by automated AI agents.\nBased on a 2024 study published in Nature, ‘Towards knowledge-infused automated disease diagnosis assistant,’the authors (Tomar et all) found that fusing semantic knowledge graph data with conversational data between patients and doctors using a discourse aware disease diagnostic model demonstrated,‘...\na significant improvement over the existing state-of-the-art models, establishing the crucial roles of (a) a doctor’s effort for additional symptom extraction (in addition to patient self-report) and (b) infusing medical knowledge in identifying diseases effectively.\nThe Peircy individual domain knowledge graph model and interface not only leverages the power of discourse, we push this practice into symbolic meaning which is then correlated to physiological patterns.\nWe fuse what a condition means to a person with how they feel when experiencing symptoms to provide greater context to the diagnosis process and to deliver secure personalized data for automated diagnostic insight.\nAs reported by Boston Consulting Group, in their 2023 article, Bringing Advanced Diagnostics to Market, ‘it can take significant time and funding: companies can spend up to ten years and up to $100 million before their advanced diagnostic reaches the inflection point for market adoption.’ At Peircy we seek to accelerate both the clinical trial process by creating greater patient access and to support research by producing more precise patient insights.",
        "18": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\n● Automated Disease Diagnostic Agents Market Size - We estimate Peircy’s market size of AI Agent solutions to be $900M.\n● Secure Patient/Device Interface Market Size - We estimate Peircy’s market size of secure solutions for health data to be $750M.\nPath to Market- We plan to license our solution to companies building AI agents (GE, Siemens, Roche) however we recognize relationships with these large corporations will take time to develop.\nAs a starting place we have also identified two open-source device manufactures whose CEO’s have expressed the need for ethical, secure interfaces to be developed by industry to protect individuals as more and more intimate data is generated by their devices and to provide contextual data for product refinement and performance.\n● Openwater was founded in 2016 to explore if consumer electronics, semiconductor device physics, and artificial intelligence could come together for a future where the profound act of curing disease becomes a reality for all, transcending borders and transforming the course of human health.\nOpenwater’s innovative technologies leverage infrared and ultrasound to treat a huge range of diseases.\nA partnership with Openwater would create a platform where patients could make their data available to health insurance carriers as a unit cost who benefit from lower cost, higher efficacy solutions with these providers paying a transaction fee back to Peircy.\n● OpenBCI has spent the last decade developing the Galea headset that uses 10 active channels of dry EEG conductive polymer active electrodes.\nThis innovative headset includes eye tracking, forehead and ear clip sensors, 4 challenges of facial EMG, 2 channels of EXG and EOG respectively (brain, muscle, eye heart activity).\nOpenBCI has a challenge with adoption and scaling given the cost of their device and the complexity of product integration into other digital systems.\nA Peircy interface helps products like the Galea by using our interface solution to make the device more user friendly by converting raw data into symbolic meaning specific to the person and enabling communication between device signals and other digital assets (e.g.\nvideo games, health research, learning in simulated environments) 7.\nKey Personnel.\nPrimary Investigator James Bernard O’Kane, Ph.D.\nJames Bernard O’Kane, Ph.D - James holds a Ph.D from Rutgers University, Ph.D.\nand is an applied social scientist.\nHis current work focuses on emerging technology, its impact on human information processing, and commercial cognitive engineering applications.\nHis professional experience ranges from academia and applied scientific research to management consulting.\nThroughout his career, he has led cross-functional teams and turned scientific research insights",
        "19": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\ninto human-system design guidelines for industry practice.\nHe has worked on a diverse set of security projects for multiple industry clients, various criminal justice research projects for U.S.\ngovernment agencies, led service development efforts for the information risk management and forensic practices of professional consulting services firms, and published and presented several scientific papers.\nHe held a U.S.\nDepartment of Defense Top Secret Clearance (2014-2019).\nRelevant Experience ▪ Peircy Inc.\nCo-founder and Chief Scientist.\nCoordinating a pre-seed startup that is developing signal processing technologies focused on human experience modeling, reinforcement learning, and applied encryption (Nov 2022-present).\n▪ Unit 221B, LLC.\nVice President, Threat Intelligence & Investigations.\nDirected a remote team of digital threat investigators.\nIntroduced semiotic techniques to analyze threat actor communications and tactics (Sept 2023-Jul 2024).\n▪ Wells Fargo & Co.\nSenior Lead Technology Business Services, Cybersecurity Strategy.\nProposed and led a cross-team semantic technologies pilot project focused on latent operational risk conditions associated with automated technology assets and people.\n▪ Deloitte & Touche LLP.\nSpecialist Leader, Advanced Research & Solutions Group.\nCo-managed applied behavioral and data science research & development efforts to engineer cyber security solution prototypes.\nRelevant Awards or Patents ▪ User Experience Modeling System, PCT Application No.\nPCT/US2022/048750.\nFiled ▪ November 2022 Finalist, Corporate Risk Innovation Challenge, Wells Fargo & Co.\nProposal for an inverse methodology to expose hidden risk conditions within business processes.\nRelevant Publications ▪ Robust Cyber Risk Management.\n2016.\nIn M.\nGelles, J.\nTurner (Eds.), Insider Threat: Detection, Mitigation, Deterrence and Prevention.\nNew York, NY: Elsevier Publishing.\n▪ A Case Study in Opportunity Reduction: Mitigating the Dirt Jumper Drive -smart attack.\nIEEE Joint Intelligence and Security Informatics Conference (JISIC) September 24-26, 2014, The Hague, Netherlands.\n▪ Exposure to Violent Events: The Impact of Social Information on Children's Cognitive Appraisal.\n1998.\nDoctoral Dissertation.\nRutgers, the State University of New Jersey.\nDirector of Systems Engineering (Consultant) Kirk Kanzelberger, Ph.D - Kirk holds a Ph.D.\nin Philosophy (Fordham), a Masters degree in Philosophical and Systematic Theology (Berkeley) and an undergraduate degree in Biology (CalTech).\nEducation Fordham University, Ph.D.\n2011",
        "20": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\nRelevant Experience ● Peircy Inc.\nDirector of Systems Engineering (Aug 2020 - present).\n● Technocap Group, Principal Software Architect (Apr 2023 - present).\n● Independent Contractor, Software Architect (Apr 2016 - present).\n● Deloitte & Touche LLP, R&D Associate Cyber Risk Services (May 2014 - Mar 2016).\nRelevant Awards or Patents User Experience Modeling System, PCT Application No.\nPCT/US2022/048750.\nFiled 11/2022.\nU.S.\nPatent 10,275,518 (issued Apr.\n30, 2019): “Integrated phonetic matching methods and systems.” U.S.\nPatent 7,107,263 (issued Sep.\n12, 2006): “Multistage intelligent database search method.” CEO and Technical Commercialization Lead Megan Trinneer M.S.\n- Megan has spent her career running technology integration and adoption initiatives from leading the technology and services sales cycle to managing change adoption at the process level.\nShe is an expert in people and technology systems design and has managed global deployment programs.\nEducation New School University, M.S.\nOrganizational Change Management Relevant Experience ● Peircy Inc.\nCo-Founder and CEO (Feb 2020 - present).\n● Optiv, Global Executive Services Director (Feb 2019 - Feb 2020).\n● Deloitte & Touche LLP, Senior Manager Cyber Risk Services (Feb 2013 - Feb 2019).\nRelevant Awards or Patents User Experience Modeling System, PCT Application No.\nPCT/US2022/048750.\nFiled 11/2022 8.\nForeign Citizens.\nNo foreign citizens will be involved in this project.\n9.\nFacilities/Equipment.\nIndividuals contributing to the project will work remotely/virtually within the United States.\n10.\nSubcontractors/Consultants.\nRefer to Key Personnel, Kirk Kanzelberger, Director of Systems Engineering.\n11.\nPrior, Current or Pending Support of Similar Proposals or Awards.\nNo prior, current, or pending support has been provided for the proposed work.\n12.\nTechnical Data Rights.\nPeircy does not intend to submit assertions or restrictions on technical data.",
        "21": "Proposal Number AF244-0001-0066 Topic Number AF244-0001 Peircy Inc.\n13.\nIdentification and Assertion of Restrictions on the Government's Use, Release, or Disclosure of Technical Data or Computer Software.\nThe Offeror asserts for itself, or the persons identified below, that the Government's rights to use, release, or disclose the following technical data or computer software should be restricted: Technical Data or Computer Software to be Furnished with Restrictions Basis for Assertion Asserted Rights Category Name of Person or Organization Asserting Restrictions none N/A N/A N/A",
        "22": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Cage F244-0001-0066 AF244-0001 Accelerating Knowledge Representation and Situational Awareness using Knowledge Graphs 11/05/2024 05:52:11 PM Peircy inc.\n2625 Ocean Beach HWY, Longiew, Washington, 98632 www.peircy.com WFATZJHNKFQ5 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 4%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (4%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) $139,880.00 $139,880.00 $0.00 $0.00 $0.00 $92,500.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $92,500.00 $42,000.00 $42,000.00 -$0.00 $5,380.00 $139,880.00 $0.00 $0.00 $0.00",
        "23": "Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Life Scientists, All Other/ Principal Investigator (James O'Kane) Chief Executive/ CEO (Megan Trinneer) Subtotal Direct Labor (DL) Labor Overhead (rate 0%) x (DL) Total Direct Labor (TDL) Subcontractor Costs Subcontractor- Kirk Kanzelberger Kirk Kanzelberger Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC1) G&A (rate 0%) x Base () Cost Sharing Profit Rate (4%) Total Estimated Cost TABA Year 2 Direct Labor Costs Category / Individual-TR $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $150.00 400 $125.00 260 $60,000.00 $32,500.00 $92,500.00 $0.00 $92,500.00 $42,000.00 $42,000.00 $42,000.00 $0.00 -$0.00 $5,380.00 $139,880.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost",
        "24": "Life, Physical, and Social Technician, All Other/ Principal Investigator (James O'Kane) $0.00 0 Subtotal Direct Labor (DL) Labor Overhead (rate 0%) x (DL) Total Direct Labor (TDL) Subcontractor Costs Subcontractor- Kirk Kanzelberger Kirk Kanzelberger Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC1) G&A (rate 0%) x Base () Cost Sharing Profit Rate (0%) Total Estimated Cost TABA $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Megan Trinneer Phone: (206) 832-9356 Phone: megan@peircy.com Title: Proposal Owner If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: No Select the Type of Payment Desired: Partial payments",
        "25": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Life Scientists, All Other Principal Investigator Chief Executive CEO PhD Master's Degree 30 23 400 $150.00 $60,000.00 260 $125.00 $32,500.00 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\nW2 employees fringe benefits are included in per hour information at an estimated 30% cost of benefits as total wages.\nContract employees cost per hour is based on market rates.\nProvide any additional information and cost support data related to the nature of the direct labor detailed above.\nEvery individual has more than 20 years of experience as well as advanced degrees and PhD's in their field of experiences.\nWe are happy to provide additional documentation upon request.\nDirect Labor Cost ($): Year2 Category Description Education Yrs Experience Hours Rate Fringe Rate Life, Physical, and Social Technician, All Other Principal Investigator PhD 30 0 $0.00 Are the labor rates detailed below fully loaded?\nPlease explain any costs that apply.\nThis proposal is for a Phase I, 6 month contract.\nProvide any additional information and cost support data related to the nature of the direct labor detailed above.\nThis proposal is for a Phase I, 6 month contract.\n$92,500.00 Total $0.00 YES",
        "26": "Direct Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) Overhead Comments: Overhead Cost ($): Year2 Labor Cost Overhead Rate (%) Overhead Comments: Overhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Subcontractor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\n$0.00 $92,500.00 0 $0.00 0 $0.00 $0.00 4 NO NO NO $0.00 0 NO",
        "27": "Apply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Subcontractor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Sum of all G&A Costs is ($): Subcontractor/Consultants Base Subcontractor/Consultant: Kirk Kanzelberger NO NO $0.00 $0.00 Budget Contact Name Budget Contact Title Budget Contact Phone Budget Contact Email Kirk Kanzelberger Ph.D Engineer (206) 909-9348 kirk@peircy.com Do you have a letter of commitment from the subcontractor/consultant?\nDocument uploaded for the letter of commitment: • Kirk Kanzelberger_ConfirmationofAvailability_SBIRKnowledge.pdf Are you able to provide detailed budget information for this subcontractor/consultant?\nTotal Cost($) : Do you provide the authority to the Government to contact this Budget Contact?\nYear2 Subcontractor/Consultant: Kirk Kanzelberger YES NO $42,000.00 YES Budget Contact Name Budget Contact Title Budget Contact Phone Budget Contact Email Mr.\nKirk Kanzelberger Ph.D N/A (206) 909-9348 Kirk@peircy.com",
        "28": "Do you have a letter of commitment from the subcontractor/consultant?\nProvide an explanation of any contact you have had with the subcontractor/consultant as to their availability to perform the proposed work.\nProposal is for a Phase I project and doesn't not exceed 6 months Are you able to provide detailed budget information for this subcontractor/consultant?\nTotal Cost($) : Do you provide the authority to the Government to contact this Budget Contact?\nNO NO $0.00 YES Total Subcontractors/Consultants Cost ($): $42,000.00 Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Total Proposed Amount ($): - 4 $5,380.00 -$0.00 0 $5,380.00 $139,880.00",
        "29": "Megan Trinneer, Peircy inc.\nNov 05, 2024 Nov 05, 2025"
    },
    "images": [
        {
            "page": 10,
            "image_file": "docNAC01FB745353a69b0fb7e1fe5d3a7ae37e8d0770c82aaac576ed3567d3f831f5b3e762211509_page10_img1.jpeg",
            "hash": "b6669c893252e7a6",
            "position": "Bottom Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "peircy.com",
        "name": "N/A",
        "phone": "N/A"
    }
}