{
    "filename": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0109 Proposal Title: INTERACTIVE KNOWLEDGE GRAPHS FOR SITUATIONAL AWARENESS Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: Anautics, Inc Address: Website: UEI: DUNS: CAGE: 17 NW 6th Street, Oklahoma City, OK 73102-6001 https://www.anautics.com YSC7Q9EN6JD5 024384633 1V9F9 SBA SBC Identification Number: 000089554 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 45 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_000089554 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_000089554 (3).pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [X] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Title Business Name Date Mike Johnson Mike Johnson CEO Anautics, Inc 05/17/2024",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?\nWas your accounting system approved by the auditing agency?\nWas a rate agreement negotiated with the auditing agency?\nWas an overhead and/or cost audit performed?\nYES Last Audit Date: 11/02/2018 YES Last Update Date: 01/01/2006 NO YES Date of Overhead Audit: 11/02/2018 Date of Cost Audit: 11/02/2018 Are the rates from the audit agreement used for this firms proposal?\nYES Firm Information: Agency Firm: Address: Point of Contact (POC) Name: POC Phone: POC Email: Upload a copy of the audit information: • F2D_12800_Anautics_ProvisionalRateLetter2023.pdf DCAA Witchita Branch 215 Dean McGee Ave Oklahoma City , Oklahoma 73102 Walter Ordonez (571) 448-7970 waler.ordonez@dcaa.mil VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: Altair Graph Studio is a complete, dynamic, scalable and proven knowledge graph platform.\nHowever, it lacks the capabilities that would qualify it to meet the definition of a dynamic knowledge graph.\nSpecifically, a graph that continuously evolves and adapts to new information, reflecting the changing nature of the real world, based upon a dynamic schema that allows for",
        "5": "immediate changes to the graph as new data becomes available and/or as a user interacts with the graph.\nOur objective is to extend the platform to include this capability.\nGraph Studio loads knowledge graphs in memory for dynamic access, so it provides the foundation necessary to allow users to make changes to loaded knowledge graphs; that is, at run time.\nBased upon this foundation, the integration of Artificial Intelligence (AI) and Machine Learning (ML) will aim to close the gap in reaching the dynamic knowledge graph capabilities in support of situational awareness, pattern of life analysis, threat detection, and targeting operations in a real-time capacity.\nNatural Language Processing (NLP) and NLP techniques, such as named entity recognition and relationship extraction, can lay the foundation to support a machine’s understanding of the underlying graph based upon its unstructured data.\nIn turn, ML algorithms can be leveraged to predict missing links between entities in the graph, identify and merge duplicate entities, and automatically detect and adapt the graph schema to accommodate new entity types and relationships.\nML can also be used to generate interactive visualizations of the knowledge graph, highlighting important relationships or insights about the graph itself.\nThe development of an integrated recommendation system will allow for those highlights to be based upon user changes and/or personalized for individual users based upon interests and past behavior.\nPractically, a user represents another client to the platform, and we will implement change management, provenance tracking, and apply access control policies to users in different roles in these cases.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: The anticipated benefits include highly curated knowledge graphs, more effective situational awareness, and improved accuracy of outputs from downstream applications.\nCommercial applications of interactive knowledge graphs include improved analysis, decision making and trust.\nThe ability to dynamically curate knowledge graphs adds a new dimension to the current platform and increases our overall capabilities offerings.\nFor example, dynamically changing knowledge graphs allows our customers to more easily optimize their generative AI applications that rely on high quality knowledge graphs.\nIn addition, applications of a dynamic knowledge graph extend to include real-time decision-making, IoT data analysis, event tracking, anomaly detection, and social network analysis.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project:",
        "6": "Dynamic knowledge graph, generative AI, machine learning, natural language processing, decision support, analysis Summary: VOL I - Proposal Certification 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\n3.\nDuring the performance of the contract, the research/research and development will be performed in the United States.\n67.3% 32.7% YES YES 4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\n8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES YES NO NO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.",
        "7": "NOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\n15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nYES NO 16.\nWhat percentage of the principal investigators total time will be on the project?\n57% 17.\nIs the principal investigator socially/economically disadvantaged?\n18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nNO YES Partners: Partner Name Altair Partner Type Large Business Point of Contact Coats VOL I - Contact Information Principal Investigator Name: Mr.\nBrian Bendele Phone: (405) 594-3965 Email: brian.bendele@anautics.com Address: 17 NW 6th Street, Oklahoma City, OK 73102 - 6001 Corporate Official Name: Mike Johnson Phone: (405) 594-3965 Email: mike.johnson@anautics.com Address: 116 E Sheridan Ave Suite 100, Oklahoma City, OK 73104 - 1111 Authorized Contract Negotiator Name: Mrs.\nAngela Wilson Phone: (405) 417-7718 Email: dee.wilson@anautics.com Address: 17 NW 6th Street, Oklahoma City, OK 73102 - 6001 Form Generated on 11/06/2024 09:23:30 AM",
        "8": "RESPONSE TO: AF244-0001 SBIR PHASE I: INTERACTIVE KNOWLEDGE GRAPHS FOR SITUATIONAL AWARENESS Anautics, Inc.\n17 NW 6th Street Oklahoma City, OK 73102-6001 November 6, 2024 This proposal contains information that shall not be disclosed outside the Federal Government and shall not be duplicated, used, or disclosed in whole or in part for any purpose other than evaluation of this proposal, unless authorized by law.\nThe Government shall have the right to duplicate, use, or disclose the data to the extent provided in the resulting contact if award is made as a result of the submission of this proposal.",
        "9": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS 1.0 Table of Contents 2.0 Glossary .................................................................................................................................\n3 3.0 Identiﬁcation and Signiﬁcance of the Problem or Opportunity ..................................................\n4 4.0 Phase I Technical Objectives ...................................................................................................\n5 5.0 Phase I Statement of Work ......................................................................................................\n6 5.1 Scope .................................................................................................................................\n6 5.2 Task Outline ........................................................................................................................\n6 5.3 Milestone Schedule ............................................................................................................\n8 5.4 Deliverables .......................................................................................................................\n9 5.4.1General .........................................................................................................................\n9 5.5 Progress Reports .................................................................................................................\n9 5.6 Final Report with SF 298 ......................................................................................................\n9 5.7 Additional Reporting ...........................................................................................................\n9 6.0 Related Work ........................................................................................................................\n10 7.0 Relationship with Future Research or Research and Development .........................................\n13 8.0 Commercialization Strategy ..................................................................................................\n14 8.1 Company Information ..........................................................................................................\n14 8.1.1 Company Description .................................................................................................\n14 8.1.2 Company Proﬁle .........................................................................................................\n14 8.1.3 Customer and Competition ........................................................................................\n14 8.1.4 Market ........................................................................................................................\n16 8.1.5 Intellectual Property ...................................................................................................\n17 8.1.6 Financing ...................................................................................................................\n17 8.1.7 Assistance and Mentoring ...........................................................................................\n18 8.2 Commercialization of This Solution ...................................................................................\n18 9.0 Key Personnel .......................................................................................................................\n20 10.0 Foreign Citizens ..................................................................................................................\n22 11.0 Facilities and Equipment ....................................................................................................\n22 12.0 Subcontractors/ Consultants ..............................................................................................\n22 12.1 Altair Engineering Inc.\n......................................................................................................\n22 13.0 Prior, Current, or Pending Support of Similar Proposals or Awards ........................................\n23 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 2 of 23",
        "10": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS 2.0 Glossary AFRL AFSC AI ALC API AR/VR/MR ARL BOM CAGR CCA COTS DA DARPA DoD ELT FEA HPC IR&D M&S ML MPP NASA JPL NCMS NDAA NIPR NIST NLP NSF OCR ODNI OEM PaaS PCB PDM PLM POC PoP Air Force Research Laboratory Air Force Sustainment Center Artiﬁcial Intelligence Air Logistics Complex Application Program Interfaces Augmented Reality/Virtual Reality/Mixed Reality Army Research laboratory Bill of Materials Compound Annual Growth Rate Circuit Card Assembly Commercial-Off-The-Shelf Data Analytics Defense Advanced Research Projects Agency Department of Defense Extraction, Loaded and Transformation Finite Element Analysis High Performance Computing Internal Research and Development Modeling and Simulation Machine Learning Massive Parallel Processing National Aeronautics & Space Administration– Jet Propulsion Laboratory National Center for Manufacturing Science National Defense Authorization Act Non-classiﬁed Internet Protocol (IP) Router National Institute of Standards and Technology Natural Language Processing National Science Foundation Optical Character Recognition Office of the Director of National Intelligence Original Equipment Manufacturer Platform as a Service Printed Circuit Board Product Data Management Product Lifecycle Management Point of Contact Period of Performance Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 3 of 23",
        "11": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS R&D RDT&E SaaS SBIR SIPR SOA SOW STTR TITAN TM TO TPOC TS/SCI TK USAF VTC W3C Research, Development Research, Development, Test, & Evaluation Software as a Service Small Business Innovation Research Secret Internet Protocol Router Software Open Architecture Statement of Work Small Business Technology Transfer Trusted Intelligence for Technology, Analytics, and Networks Technical Manual Technical Order Technical point of Contact Top Secret/ Sensitive Compartmented Information Talent Keyhole United States Air Force Video Tele-Conference World Wide Web Consortium 3.0 Identiﬁcation and Signiﬁcance of the Problem or Opportunity The increasing volume, velocity, and variety of big data have led to the need for efficient data processing and analysis.\nKnowledge Graphs enable real-time data processing, helping organizations make quick, data-driven decisions on the most up-to-date information available.\nWith advances in NLP, there is a growing need for more sophisticated data models that can understand and process human language effectively.\nKnowledge Graphs play a crucial role in enhancing NLP capabilities by enabling machines to comprehend the context and relationships between words and phrases.\nOf interest to the USAF are Knowledge Graphs that enable situational awareness, pattern of life analysis, threat detection, and targeting operations that will allow for user modiﬁcations to a dynamic knowledge graph and predict additional necessary changes to the graph based on the user's input.\nDynamic knowledge graphs are well-suited to these applications due to the changing nature of an operational environment.\nPrevious AFRL/RI research has shown the added value to analysts in capabilities that allow a user to interact with stored data, especially when the data was structured and stored by ML and AI based capabilities.\nAI/ML approaches for identifying, structuring, and storing data are not 100% trusted by analysts, so there is a requirement to enable the analyst to make corrections to the data as needed and manually add additional data.\nCurrently, these modiﬁcations are all entered by manual methods and are not utilized to further improve the overall data store and analysis capability, making it a time-consuming task that will not be feasible Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 4 of 23",
        "12": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS in a time-constrained environment, such as a peer ﬁght.\nExisting approaches for interacting with a knowledge graph have focused on visualization techniques and query mechanisms, but additional user interaction is required for such graphs to be useful and trusted by users in USAF applications, especially when time of the essence.\nKnowledge Graphs capture information about entities and the relationships between those entities, represented as nodes and edges within a graph.\nEntities can be comprised of objects, events, situations, or concepts.\nKnowledge Graphs are typically constructed from various data sources with diverse types of data, creating a shared model and context for formerly disparate pieces of data.\nAs such, Knowledge Graphs provide a rich source of information, enabling capabilities like question and answering systems, information retrieval, and intelligent reasoning.\n4.0 Phase I Technical Objectives The Anautics Team will explore techniques that allow a user to interact with a dynamic knowledge graph by making changes and additions to the knowledge graph, and then utilize that user input to suggest additional updates to surrounding nodes/edges in the graph.\nThis will be accomplished through detailed reviews of available literature and then determinations made on where in Graph Studio we can apply these modiﬁcations to address the topic author’s request.\nSpeciﬁcally, we will execute the feasibility study to address the below Technical Objectives and have identiﬁed the key results for accomplishment through the project.\nUltimately, we will develop an initial prototype design and document all work completed in this feasibility study for submission to our Final Report.\nTechnical Objective 1: Leverage Natural Language Processing (NLP) techniques to enhance the construction and reﬁnement of knowledge graphs Key Results: NLP techniques, like named entity recognition, and relationship extraction can automatically extract entities and relationships from unstructured text data to support a machine’s understanding of the underlying knowledge graph and its data.\nKey Results: Text mining algorithms can analyze large volumes of text data to identify relevant information and extract knowledge as a basis for recommending changes to the model.\nTechnical Objective 2: Utilize AI/ML techniques and technologies to automate the construction, maintenance, and enhancement of knowledge graphs Key Results: Machine Learning algorithms can predict missing links between entities in the knowledge graph, helping to complete the knowledge base.\nKey Results: Machine Learning techniques can help identify and merge duplicate entities, ensuring data consistency and accuracy.\nKey Results: Machine Learning can be used to automatically detect and adapt the 6 Months 6 Months Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 5 of 23",
        "13": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS knowledge graph ontology to accommodate new entity types and relationships.\nTechnical Objective 3: Enhance the user experience of interacting with knowledge graphs and personalize the interface based on user behavior and data insights Key Results: Machine Learning can be used to generate interactive visualizations of the knowledge graph, highlighting important relationships and insights.\nKey Results: A recommendation system can recommend modiﬁcations based upon data or user changes and/or highlight conﬂicts or information gaps within the model.\n6 Months Key Results: Machine Learning can be used to personalize the user experience by recommending relevant information / modiﬁcations based upon the user’s interests and past behavior.\n5.0 Phase I Statement of Work 5.1 Scope The Phase I effort will be to conduct a feasibility study to research state-of-the-art techniques for enabling a user to interact with a dynamic knowledge graph and suggest additional necessary changes to the graph in support of faster, more effective situational awareness, pattern of life analysis, threat detection, and targeting operations in time-constrained environments.\nOur Team will use our own unclassiﬁed datasets during the project.\nWe intend to identify a planned prototype design that would signiﬁcantly reduce the current time required to complete analytic tasks such that less time would be spent manually correcting the results of AI/ML data structuring, correlation, and storage.\nThe goal of the feasibility study research will be to identify techniques that target dynamic knowledge graph capability to enable AI assistance and/or machine learning algorithms to modify the model by suggesting additional updates to surrounding nodes/edges in the graph based upon user input or new data that becomes available.\nThis may include, but is not limited to, aspects such as: updating the graph’s underlying ontology/schema, inferring additional edges between nodes, highlighting conﬂicting information in the graph, highlighting information gaps, and suggesting additional changes to the graph because of the user’s modiﬁcations.\n5.2 Task Outline Task 1: Anautics shall ﬁnalize customer requirements including the identiﬁcation of candidate(s) for the TPOC use case.\nDescription: Finalize the set of requirements to which the project must align; identify all representative candidate(s) with related data to use as a basis for development and testing throughout the project; identify any applicable standards to be adhered to during project execution; update milestones and the work plan to align with this ﬁnalized set of inputs.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 6 of 23",
        "14": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS Measurable Performance Standard: All parties agree to the requirements, candidate data, standards, and alignment to milestones / work plan.\nKey Results: The shared understanding of the technical goals to be achieved over the 6- month period of performance including how those technical goals align to schedule and expectations of delivery to the customer.\nThe resulting deliverable acts as the ‘north star’ vision for the team to work towards achieving.\nLocation: Government site and/or contractor facility Performance Period: From award through end of week two Task 2: Anautics Shall Conduct Literature Review and Technology Assessment (Feasibility Study) Description: Conduct a comprehensive literature review to identify relevant research and development in the ﬁeld of dynamic knowledge graphs and adjacent technologies.\nAssess technology capabilities leveraged from related work, including decades of applied experience and proven knowledge graph technology, for ﬁts and gaps in meeting customer requirements / overall vision.\nMeasurable Performance Standard: Measurable standards shall be developed speciﬁc to the technology and its assessment as part of this task within the context of dynamic knowledge graphs and the aspects mentioned above, such as highlighting conﬂicting information and information gaps in the graph.\nThese goals will be used to develop objectives and relevant metrics by which the candidate technology approaches shall be measured against.\nKey Results: A weighted scoring of candidate technology approaches based upon the results of the objectives and metrics developed as part of the overall technology assessment, including a recommended technology path forward for the prototype design for the dynamic knowledge graph approach.\nLocation: Contractor facility Performance Period: From award through end of month six Task 3: Anautics Shall Develop Prototype Design Description: Design an overall dynamic knowledge graph architecture based upon the current architecture of the knowledge graph capabilities inherent within the Graph Studio product, addressing key requirements identiﬁed within Task 1 combined with the highest scoring technology approach identiﬁed within Task 2.\nMeasurable Performance Standard: The application of the best practices systems engineering approach shall determine how the design of the prototype architecture meets the requirements captured from stakeholders by demonstrating where and how the proposed technological approach meets those requirements.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 7 of 23",
        "15": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 Key Results: The prototype design for the dynamic knowledge graph, a key input into future prototype development and validation activities.\nANAUTICS Location: Contractor facility Performance Period: From award through end of month six Task 4: Anautics Shall Deliver Prototype Design Description: Package and deliver the resulting prototype design from the output of Task 3 to Gov POCs as applicable.\nMeasurable Performance Standard: Government review and acceptance of the delivered prototype design.\nKey Results: The Government accepted prototype design for dynamic knowledge graph architecture.\nThis provides a path forward for development and validation in a future SBIR effort.\nLocation: Contractor facility Performance Period: From award through end of month six 5.3 Milestone Schedule TASK EPECTED DELIVERY DELIVERABLE LOCATION TASK NO.\nTask 1 Finalize Requirements / Standards Award + 2 weeks Task 2 Feasibility study Task 3 Prototype Design Award + 1- 6 months Award + 6 months Updated Milestones/Work Plan; Complete list of requirements and standards to be used Intermittent status reports on progress of literature review and technology assessment Contractor Site/VTC Contractor Site Final Prototype Design Contractor Site Task 4 Final Report Award + 6 months Final Report on activities taking place during the 6- Contractor Site Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 8 of 23",
        "16": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS month PoP inclusive of Task 3 information 5.4 Deliverables 5.4.1General • Updated Milestone / Workplan will be delivered within 2 weeks.\n• Conduct Feasibility Study to determine best option for prototype (Months 1 – 6) • Final Prototype Design will be delivered at the end of the PoP (6 months after award) • Final Report will be delivered at the end of the PoP (6 months after the award) 5.5 Progress Reports Progress reports will be provided monthly, at a minimum.\nThese will be concise documents describing progress in meeting the project TPOCs.\n5.6 Final Report with SF 298 A draft will be provided 30 calendar days after completion of the Phase I technical effort.\nThe ﬁrst page of the ﬁnal report will include a single-page project summary identifying the purpose of the work, providing a brief description of the effort accomplished, and listing potential results applications.\nDoD may publish the summary.\nTherefore, it will not contain proprietary information.\nIt will also contain project objectives met, work completed, results obtained, and technical feasibility estimate.\nThe Report will be sent to the awarding DAF organization based on the instructions provided in an awarded contract.\n5.7 Additional Reporting In addition to the standard federal and DoD procurement certiﬁcations, the SBA SBIR Policy Directive requires collecting certain information from ﬁrms at the time of award and during the award life cycle.\nAnautics is aware of these additional requirements as laid out in the Lifecycle Certiﬁcation Form (at the time of the Phase I award, prior to receiving 50% of the total award amount for a Phase I award, and prior to ﬁnal payment on the Phase I award).\nWe anticipate providing high level architecture process diagrams and workﬂows as part of our deliverable to the Customer/End-User.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 9 of 23",
        "17": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS 6.0 Related Work Since 2000, Anautics has been successfully executing research and development projects across the Department of Defense (DoD).\nOur track record of commercializing SBIRs is built upon the backbone of our digital innovation framework: the continuous discovery, framing, integration, and deployment of digital solutions, transforming the way the DoD operates.\nThe Principal Investigator proposed on this project, Mr.\nGarrett W.\nAlderson, has been a key person involved in the Air Force Sustainment Center’s (AFSC) Trusted Intelligence for Technology, Analytics, and Networks (TITAN) program.\nOne such initiative under TITAN is Materiel Insights, a system of engagement designed to bring together data within context to equip users to meet their daily mission(s) through data-driven decision-making.\nA key foundational capability for Materiel Insights is the underlying data fabric architecture which serves up the data in a way that is necessary for the system to deliver on this vision.\nFigure 1.\nConceptual Data Fabric Architecture As pictured above, a vital component of the data fabric architecture is a knowledge graph.\nIn working the digital innovation framework from discovery through framing, the team introduced Altair’s Graph Studio product to connect to source system data, conduct ELT through the in- memory MPP graph database (providing a high-performance, large-scale knowledge graph), thus providing a means for RESTful API endpoint connectivity for data accessibility for Materiel Insights in addition to data visualization applications.\nStructured data from a representative system of record was used in the framing of Graph Studio.\nThis data set included part information, bills of material (BOMs), related supply chain information where those parts had OEMs responsible for manufacture and procurement, as well as service data speciﬁc to the parts that were at a serviceable level within the BOM structure, including identiﬁers such as serial numbers and if/where those serviceable parts were used in a higher-level serviceable Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 10 of 23",
        "18": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS part assembly.\nSimilarly, a related set of unstructured data (i.e., ﬁle-based data, MS Word, MS Excel, PDFs, etc.) was also ingested through Graph Studio’s unstructured pipeline.\nFigure 2.\nFraming of Graph Studio As data was incrementally introduced, Altair’s key personnel led by Mr.\nSamuel G.\nChance (Senior Data Engineer and Technical Manager), were able to train key personnel from Anautics, including Mr.\nGarrett W.\nAlderson (Chief, Digital Services), on the metadata capture and design of the ontologies in support of populating the knowledge graph.\nThe iterative development of data ingestion, discovery, and ontology design supported by Graph Studio provided the dynamic means to accomplish the eventual end state knowledge graph central to the success of this implementation.\nThe nature of the knowledge graph within Graph Studio allows for an analyst to create new nodes and edges over time as additional disparate and diverse data sets are ingested and data discovery leads to new ﬁndings on how the data connects.\nData discovery is supported natively by the platform through the direct querying of data within the integrated interface.\nAs needed, separate ontologies can be designed in isolation within their own data layers and later integrated as key data becomes available for integration across the models.\nData layers are eligible to be conﬁgured for REST API connectivity through conﬁguration within the platform.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 11 of 23",
        "19": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS Figure 3.\nGraph Studio Conceptual Architecture One additional point of interest in the framing of this technology was the ability of the Graph Studio platform’s inclusion of elastic search of unstructured data within the knowledge graph.\nThis extension of the model allowed for full text search capability across the unstructured ﬁle data and allowed for speciﬁc key indicators in the structured data set (i.e., part number) to be conﬁgured as an annotator to be searched across the text and used as a ﬁlter within the full text search results.\nThe blending of elastic search within the context of the structured data sets allows for an analyst to continue to discover information and further reﬁne the knowledge graph for greater value within the resulting data fabric.\nFigure 4.\nData Fabric (Graph Studio) Value Proposition Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 12 of 23",
        "20": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS The realized value proposition is depicted above.\nIn today’s work within AFSC, a data analyst initiates their work from a question proposed by Air Force leadership.\nThey locate, ingest, and prepare data, build analytics outputs, and present the insights within a very serial process, isolating the knowledge gained through data integration and insights to the analyst themselves.\nIf similar questions are proposed in the future, reuse of this knowledge requires the same analyst and data to be available.\nIf not, rework cannot be avoided.\nWith a knowledge graph in place using the Graph Studio platform, the data engineering and iterative building of the knowledge graph can be done within its own cycle, providing greater value over time and democratizing the ability for insights to be delivered more quickly.\nThe results of this effort were presented at a Program Management Review (PMR) event for the TITAN program on 24 October 2024 in Austin, Texas.\nFor additional information on the TITAN program and the presentation of this effort, please contact the Government Program Manager: Lt Joseph Way, joseph.way.7@us.af.mil.\n7.0 Relationship with Future Research or Research and Development After successful completion of the research proposed within this Phase I SOW, the Anautics team would position Altair with a design recommendation for a Phase II research and development effort targeting dynamic knowledge graph capability that extends the current knowledge graph offering of their existing Graph Studio product.\nThe design recommendation would aim to incorporate maturing the knowledge graph to allow continuous updates and adaptation to new information in real-time as new data becomes available, ideally accomplished through the use of AI assistance and machine learning algorithms.\nThis would directly assist users by predicting additional necessary changes to the graph based upon their input.\nIn general, this improved dynamic knowledge graph approach would enable use cases to include real-time decision-making, event tracking, IoT data analysis, anomaly detection, and/or social network analysis.\nMore speciﬁcally, DoD use cases such as situational awareness, pattern of life analysis, threat detection, and targeting operations become highly feasible with this newly dynamic capability.\nIn addition, continued integration and maturity with NLP via the Altair Copilot feature will allow this design approach to meet the growing need for sophisticated models that can understand and process human language effectively.\nIn turn, Anautics would be able to leverage these advancements in Altair product design within the TITAN program to bring the same real-time decision-making value to Materiel Insights, as well as other AFSC initiatives whose goal is to achieve real-time IoT data analysis within the test labs and on the shop ﬂoor, driving digital transformation across the Air Logistics Complexes (ALCs) and delivering on the Digital Depot vision.\nThis is a direct ﬁt of this SBIR proposal in positioning dynamic knowledge graph technology as a well-suited solution for the changing nature of the depots’ operational environment.\nUltimately, this would allow continuous improvement of the dynamic Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 13 of 23",
        "21": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS knowledge graph capability to continue through considerations of how to effectively apply visualization techniques and query mechanisms to yield the highest value output from the information within the model efficiently and effectively for end users.\nPhase II testing could continue with the use of non-sensitive, open data sets avoiding the need for speciﬁc clearances, certiﬁcations, or approvals.\n8.0 Commercialization Strategy 8.1 Company Information 8.1.1 Company Description Anautics architects and delivers adaptive, secure, and ﬂexible solutions that enable digital transformation supporting both operational and analytical digital outcomes.\nAnautics provides a standards-based approach to data management practices and principles that work in the cloud, on-premises, and on edge devices.\nEnabling data visibility and insights, data access and control, and data protection and security is at the heart of everything Anautics builds.\n8.1.2 Company Proﬁle Provide appropriate company information below: 2.\nSmall Business Concern (SBC) Name: Anautics, Inc.\n3.\nAddress: 17 NW 6th Street, Oklahoma City, OK 73102 3.\nPOC: Garrett W.\nAlderson 4.\nPOC Email: garrett.alderson@anautics.com 5.\nPOC Phone #: (405) 594-3965 6.\nUEI#: YSC7Q9EN6JD5 7.\nCage #: 1V9F9 8.\nSBC Control ID#: SBC_000089554 8.1.3 Customer and Competition This technology holds signiﬁcant potential for a wide range of users, including Intelligence and Defense agencies, OEMs, and suppliers.\nBy enabling unprecedented collaboration, it allows users to create, share, and access complex, diverse, and often isolated data sources, breaking down traditional silos that limit data utility.\nAcross both commercial and defense sectors, there is an increasing need for solutions that empower end-users to perform data engineering and analytics independently, improving speed and ﬂexibility.\nBy employing a knowledge model that adds semantic depth to intelligence data and assessments, analysts and AI working together are positioned to extract far greater value from existing information.\nThis approach not only enables them to identify previously hidden patterns and insights but also facilitates the integration of machine learning and artiﬁcial intelligence tools, Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 14 of 23",
        "22": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS signiﬁcantly enhancing analytical precision and predictive capabilities.\nAs a result, organizations can stay responsive to rapidly evolving operational challenges, leveraging predictive insights to anticipate and respond to shifts in the operational environment with greater agility.\nThrough this fusion of knowledge models, advanced analytics, and self-service access, organizations can ensure that critical intelligence ﬂows seamlessly to those who need it, enabling more informed decision-making at every level.\nAs it relates to the TITAN program, a complex weapon system of today can be managed more efficiently, innovated more quickly, and sustained more effectively within a secure technology that reduces cost and time over competing approaches.\nGenerally, teaming humans with AI supports digital transformation initiatives more broadly.\nThe graph database market includes solutions from major providers like AWS, IBM, and Microsoft, as well as specialized options from Neo4j, TigerGraph, Stardog, and GraphDB.\nThese databases are often developer-focused, transactional, and designed to handle speciﬁc graph workloads, typically requiring signiﬁcant technical expertise.\nData integration and transformation tasks are commonly managed outside of the graph database itself, usually through ETL processes or pipelines.\nVisualization of the knowledge graph as well is typically handled by 3rd party tools like Linkurious, Bloom, Keylines, Jupiter/ Zepplin notebooks.\nIn contrast, Altair Graph Studio offers an integrated platform designed to be accessible to both developers and non-technical users, such as business analysts.\nIt provides tools that make graph data more approachable for a broader audience and is built on W3C standards like RDF, OWL, and SPARQL, ensuring compatibility and futureprooﬁng.\nUnlike many competing solutions that focus solely on graph databases or AI frameworks, Altair Graph Studio brings together diverse data sources into a uniﬁed, comprehensive knowledge graph.\nIts intuitive interface enables users to build and manage knowledge graphs with minimal technical background.\nAdditionally, Graph Studio is unique in its ability to overlay and virtualize data from existing sources without requiring a full data load into a central database.\nWith Kubernetes-based architecture, it scales dynamically to meet organizational data demands, supporting just-in-time loading and seamless data integration across the enterprise.\nThe Anautics solution seeks to provide a uniﬁed, full-featured platform for creating, managing, and applying knowledge graphs to drive actionable insights.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 15 of 23",
        "23": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS Figure 5.\nGraph Studio (formerly Anzo) vs Competition 8.1.4 Market The Knowledge Graph market size was reasonably estimated at $0.9B USD in 2023.\nIt is anticipated to grow at a CAGR of 21.8% between 2023 to 2028 to a valuation of $2.8B USD.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 16 of 23",
        "24": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS Figure 6.\nGlobal Knowledge Graph Market Size 8.1.5 Intellectual Property Our project is novel.\nThere are no patents registered with respect to the solution we intend to develop here.\nSBIR data rights that would come with an award and project completion will remain for the next 20 years based on current NDAA language.\n8.1.6 Financing Anautics’ current revenues and investments, along with the funds listed in this Phase I proposal will be sufficient to successfully produce a feasibility study at the completion of the effort.\nAnautics has been in business for 24 years.\nWe have self-funded IR&D solutions currently in progress.\nWe typically budget $440K per year for advancing R&D efforts and partner with Industry leading software providers who budget millions of dollars annually for advancing R&D efforts.\nWe have ﬁnancial relationships in place that would allow us to secure funding if deemed necessary, such as $200M+ annual IR&D from our teaming partner, Altair Engineering Inc.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 17 of 23",
        "25": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 8.1.7 Assistance and Mentoring ANAUTICS The Anautics Team has transitioned prior SBIR/STTR efforts to Phase III contracts 8 times over the past three (3) years.\nAdditionally, we have created relationships with mentors and consultants who hold expertise in RDT&E projects and possess a deep understanding of the past and current contracts with the DoD.\nOur team partners for this effort have an additional 13+ SBIR/STTR awards with a conversion rate of 100%.\nOur mentors/consultants have assisted small businesses, former small businesses that have transitioned to large businesses, and large business purchasers of SBIR/STTR IP and data rights transition projects to SBIR/STTR Phase III commercialized contracts throughout the DoD more than 20 times since 2018.\nAnautics, our teaming partners, and our consultants have marketed company capabilities to other industry entities and government organizations (Program Managers, Deputy Program Managers, TPOCs, and other personnel) in obtaining contracts for execution.\n8.2 Commercialization of This Solution The commercialization of Knowledge Graph technology will target industries leveraging data-driven decision-making, including technology companies, research institutions, government agencies, and enterprises in sectors such as healthcare, ﬁnance, and retail.\nBy offering a uniﬁed platform for capturing and integrating diverse data sources into cohesive knowledge structures, the product will enable advanced capabilities like intelligent question-answering, personalized information retrieval, and enhanced reasoning.\nWe will offer ﬂexible pricing models, including subscription- based and licensing options, to cater to organizations of all sizes.\nMarketing efforts will focus on demonstrating the technology’s ability to transform data into actionable insights through webinars, digital campaigns, and strategic partnerships with AI, ML, and data analytics ﬁrms.\nContinuous development and user feedback will drive product enhancements, ensuring the solution remains relevant to evolving industry needs.\nMarket Opportunity: • Target Market: Organizations and industries involved in data analytics, AI, ML, and knowledge management, including tech companies, research institutions, and government agencies.\n• Market Size: The global AI and data analytics market is rapidly growing, with the knowledge graph market alone projected to reach $6.9 billion by 2025, as enterprises increasingly adopt knowledge graphs to enhance their data-driven capabilities.\nProduct Overview: • Features: Knowledge Graphs provide a structured representation of entities (objects, events, situations, or concepts) and their interrelationships, captured as nodes and edges.\nThey integrate data from multiple diverse sources into a uniﬁed ontology, enabling organizations to connect previously disparate pieces of information.\n• Beneﬁts: Knowledge Graphs enable advanced capabilities such as question answering, personalized information retrieval, and intelligent reasoning, driving insights from complex Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 18 of 23",
        "26": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS datasets.\nThey improve decision-making, enhance data accessibility, and allow for more accurate, context-driven AI and ML model training.\nCompetitive Landscape: • Competitors: Major players like Google, Microsoft, and IBM offer knowledge graph solutions, but often focus on speciﬁc use cases or individual aspects of knowledge management.\nThese solutions may include graph databases or AI frameworks but often lack the holistic integration of various data sources and the advanced reasoning capabilities of a comprehensive knowledge graph platform.\nThis solution seeks to provide a uniﬁed, full-featured platform for creating, managing, and applying knowledge graphs to drive actionable insights.\nGo-to-Market Strategy: • Direct Sales: Engage with large enterprises, AI and ML-focused tech ﬁrms, and government organizations involved in data-driven research to showcase the beneﬁts of using knowledge graphs for improved decision-making.\n• Partnerships: Develop collaborations with tech companies, academic research institutions, and government agencies like DARPA, ARL, and AFRL to explore joint research and application of knowledge graph technology.\n• Marketing: Utilize targeted marketing strategies, including webinars, content marketing, and participation in industry conferences, to raise awareness about the power of knowledge graphs in transforming data analytics and AI.\nRevenue Model: • Subscription-Based Pricing: Offer ﬂexible pricing models, including subscription-based and usage-based structures, to cater to both large enterprises and smaller businesses.\n• Licensing: Provide licensing options that include both one-time fees and recurring licensing for long-term enterprise clients, along with free trials to encourage initial adoption.\nCustomer Support and Training: • Training: Provide educational resources, tutorials, and certiﬁcation programs to help clients effectively implement and leverage knowledge graph technology.\n• Support: Offer dedicated customer support teams for troubleshooting, optimization, and assistance with integrating knowledge graphs into existing data systems.\nContinuous Development: • Feedback Loop: Continuously enhance the platform by incorporating user feedback, technological advancements, and new market trends, ensuring the knowledge graph solution remains at the cutting edge of data analytics and AI integration.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 19 of 23",
        "27": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS 9.0 Key Personnel Principal Investigator: Garrett W.\nAlderson, Digital Lead (Enterprise Architect), US Citizen Education: • Purdue University, MS Computer and Information Technology, 2018 • PennWest California, BS Applied Computer Sciences, 2002 Experience: • 2021 – Present, Chief, Digital Services.\nCollaborates with DoD leadership to deﬁne digital strategy and leads strategic implementation initiatives with key DoD personnel.\nEvaluates and selects technologies and tools that maximize delivery of value to DoD.\nDelivers organizational change through management and leadership of DoD contractor support services • 2019 – 2021, Chief, Technology.\nLead development, deployment, and integration of IT applications and systems across DoD customer initiatives.\nLed overall strategic direction of technology and platform architecture • 2018 – 2019, Enterprise Support Manager.\nEstablished, executed, and managed global processes for internal/external communication for key customers and their issues • 2015 – 2018, Sr.\nPLM Consultant.\nLed and participated in several digital transformation initiatives, including the design of solution architecture, integration of enterprise systems, and facilitation of customer workshops across automotive, aerospace, defense, and industrial verticals • 2012 – 2015, IT Project Lead (PLM).\nLed PLM and PDM initiatives to implement, enhance, and upgrade capabilities for enterprise IT systems extending global adoption • 2011 – 2012, Business Programmer Analyst • 2008 – 2011, Programmer Analyst • 2004 – 2008, Computer Programmer Relevant Awards or Patents: • None Relevant Publications: • None Key Personnel: Samuel G.\nChance, Sr.\nData Engineer (Technical Manager), US Citizen Education: • Naval Postgraduate School, MS Information Systems Technology, 2003 • Florida A&M, BS Electronic Engineering Technology, 1995 • Pensacola Jr.\nCollege, AS Electronic Engineering Technology, 1992 Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 20 of 23",
        "28": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 Experience: ANAUTICS • Active TS/SCI TK (Mar 2011) with current full scope polygraph (Mar 2014) • Completed Masters Thesis in Semantic Technologies for Military Applications, 2003 • Recognized thought leader in the ﬁelds of Semantic Web, distributed computing.\n• 2016 – Present, Technical Consultant.\nWorks closely with the Sales and Engineering teams to accurately deﬁne and communicate the value of the company’s Anzo Knowledge Graph platform to the marketplace and customers, while also architecting customized solutions for their environments • 2011 – 2015, Director, Special Programs.\nEstablished and led IR&D program.\nWon, led, and delivered numerous applied R&D contracts using semantic technologies for government and commercial customers.\nApplied Anzo knowledge graph platform in production for ELINT data portal.\n• 2014 – 2016, Principal Investigator for Phase I & II SBIR called MatOnto, a semantic technology platform for distributed data publishing, discovering and consuming.\nThe product is commercially available for advanced ontology management.\n• 2008 – 2011, Chief Solutions Architect.\nConceived, designed, developed semantic and geographic technology capabilities to support critical intelligence needs.\n• 2008 – 2010, Lead SETA system engineer for ODNI program.\nProvided extensive, diversified knowledge of advanced data integration technologies, scientific principles and theories contributing to design and development of new processes, methods and concepts.\n• 2006 – 2007, Senior Enterprise Architect.\nProvided system engineering and software development support on a DoD unstructured information management program using semantic technologies.\nConceived and led a funded IR&D project that designed and prototyped a semantic technology-powered autonomic, distributed cloud “Platform as a Service” (PaaS) system.\n• 2004 – 2006, Technical Director for a DoD large-scale Knowledge Systems program with an approximate annual budget of several tens of millions of dollars.\nManaged technical risk reduction and Technology Thrust Initiatives program including management, project plans, technical architecture, and technology selection.\nProposed and won three innovative, advanced commercial software technology integration projects; conceived, designed, and led each.\nTwo programs were (Semantic) SOA systems; the third was a Semantic Metadata Repository Relevant Awards or Patents: • None Relevant Publications: • Co-authored “Rule Languages for Interoperability Workshop” position paper for the World Wide Web Consortium (W3C) Use or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 21 of 23",
        "29": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS • Co-authored “Environmental Data Exchange Network for Inland Water” Mr.\nChance co- authored Chapter 15, Environmental Data: Edge Issues and the Path Forward.\n(http://tinyurl.com/louzjjl) 10.0 Foreign Citizens No foreign citizens or individuals holding dual citizenship will be involved in this project.\n11.0 Facilities and Equipment Contractor facilities planned for use in conducting the feasibility study for this project meet environmental laws and regulations of federal, state (Oklahoma, Michigan, Massachusetts, Florida, Utah and Pennsylvania), and local Governments for, but not limited to, airborne emissions, waterborne effluents, external radiation levels, outdoor noise, solid and bulk waste disposal practices, and handling and storage of toxic and hazardous materials.\n12.0 Subcontractors/ Consultants 12.1 Altair Engineering Inc.\nAltair is a large US business based in Troy, MI.\nbut has a global presence.\nWith a 25+ year successful relationship with the government community, we provide over 180+ software tools addressing multi-physics-based M&S, HPC and DA software tools to address the most complex problems.\nWe fully embrace an agnostic, open architecture and modular philosophy that virtually eliminates vendor lock.\nAltair has tools being used across all the government agencies meeting stringent software security requirements for both NIPR and SIPR networks and are currently working on cloud security requirements.\nOur customers can push and pull tools within workﬂows based on their individual needs yet can fully integrate via APIs.\nOur patented SaaS-like, consumption-based licensing model (Figure 7) with non-perishable units ensures affordable software applications and solution integrations all while giving access to all our tools all the time; our “All-in, Always-on” philosophy, supplying freedom, ﬂexibility, and value.\nThis model allows users to access the entire Altair product portfolio, access to over 180 products by purchasing Altair Units instead of individual software application licenses.\nUsers can share units, so they only need to buy what they use, and units are returned to the pool when not in use.\nThis model can help organizations avoid buying licenses for every user and can also help with cost efficiency across a range of Altair products.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 22 of 23",
        "30": "Proposal Number: F244-0001-0109 Topic Number: AF244-0001 ANAUTICS Figure 7 - Altair Licensing Model Can Save a Company as Much as 68% on software costs.\nAltair’s Enterprise Solutions Group is a team of solution architects, creative thinkers and software engineers that focus on providing efficiency to our customers.\nThis includes workﬂow automation, enterprise integration solutions, custom applications and system integrations in engineering and data science.\nThey provide trusted consulting services to our customers starting from inception to ﬁnal solution delivery fully embracing an agile development methodology.\n13.0 Prior, Current, or Pending Support of Similar Proposals or Awards No prior, current, or pending support of similar proposals or awards has been submitted for proposed work.\nUse or disclosure of data contained on this page is subject to the restriction on the ﬁrst page of this Volume.\nPage 23 of 23",
        "31": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Duns Cage F244-0001-0109 AF244-0001 INTERACTIVE KNOWLEDGE GRAPHS FOR SITUATIONAL AWARENESS 11/06/2024 09:23:26 AM Anautics, Inc 17 NW 6th Street, Oklahoma City, Oklahoma, 73102 https://www.anautics.com YSC7Q9EN6JD5 024384633 1V9F9 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) $139,996.30 $139,996.30 $0.00 $0.00 $0.00 $87,233.30 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $87,233.30 $42,392.90 $42,392.90 -$0.00 $10,370.10 $139,996.30 $0.00 $0.00",
        "32": "Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Engineers, All Other/ Principal Investigator Subtotal Direct Labor (DL) Labor Overhead (rate 0%) x (DL) Total Direct Labor (TDL) Subcontractor Costs Subcontractor- Sam Chance Sam Chance Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC1) G&A (rate 0%) x Base () Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Year 2 Direct Labor Costs $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $226.58 385 $87,233.30 $87,233.30 $0.00 $87,233.30 $42,392.90 $42,392.90 $42,392.90 $0.00 -$0.00 $10,370.10 $139,996.30 $0.00 Category / Individual-TR Engineers, All Other/ Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $226.83 0 $0.00",
        "33": "Principal Investigator Subtotal Direct Labor (DL) Labor Overhead (rate 0%) x (DL) Total Direct Labor (TDL) Subcontractor Costs Subcontractor- Sam Chance Sam Chance Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC1) G&A (rate 0%) x Base () Cost Sharing Profit Rate (0%) Total Estimated Cost TABA $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Mike Johnson Phone: (405) 594-3965 Phone: mike.johnson@anautics.com Title: Proposal Owner If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: Yes Audit Agency Name: DCAA Witchita Branch Audit Agency POC: Walter Ordonez Address: 215 Dean McGee Ave, Oklahoma City, Oklahoma,73102 Phone: (571) 448-7970 Email: waler.ordonez@dcaa.mil Select the Type of Payment Desired: Partial payments",
        "34": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Engineers, All Other Principal Investigator Master's Degree 20 385 $226.58 $87,233.30 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\nRates derived from buy.gsa.gov 2024 rate schedule Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nRates derived from buy.gsa.gov 2024 rate schedule Direct Labor Cost ($): Year2 $87,233.30 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Engineers, All Other Principal Investigator Master's Degree 20 0 $226.83 $0.00 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\nrates derived from buy.gsa.gov 2024 rate schedule Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nrates derived from buy.gsa.gov 2024 rate schedule Direct Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base $0.00 $87,233.30",
        "35": "Labor Cost Overhead Rate (%) Overhead Comments: Fully burden rates used Overhead Cost ($): Year2 Labor Cost Overhead Rate (%) Overhead Comments: Fully burden rate used Overhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Subcontractor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nFully burden rates used G&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\n0 $0.00 0 $0.00 $0.00 0 NO NO NO $0.00 0 NO NO",
        "36": "Apply G&A Rate to Subcontractor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nfully burden rate used G&A Cost ($): Sum of all G&A Costs is ($): Subcontractor/Consultants Base Subcontractor/Consultant: Sam Chance NO $0.00 $0.00 Budget Contact Name Budget Contact Title Budget Contact Phone Budget Contact Email David Coates Military and Defense BD Director (248) 321-4550 dac@altair.com Do you have a letter of commitment from the subcontractor/consultant?\nDocument uploaded for the letter of commitment: • F244_0001_0109_Anautics_LOC.pdf Are you able to provide detailed budget information for this subcontractor/consultant?\nTotal Cost($) : Do you provide the authority to the Government to contact this Budget Contact?\nYear2 Subcontractor/Consultant: Sam Chance YES NO $42,392.90 YES Budget Contact Name Budget Contact Title Budget Contact Phone Budget Contact Email David Coates Military and Defense BD Director (248) 321-4550 dac@altair.com Do you have a letter of commitment from the subcontractor/consultant?\nYES",
        "37": "Document uploaded for the letter of commitment: • F244_0001_0109_Anautics_LOC.pdf Are you able to provide detailed budget information for this subcontractor/consultant?\nTotal Cost($) : Do you provide the authority to the Government to contact this Budget Contact?\nNO $0.00 YES Total Subcontractors/Consultants Cost ($): $42,392.90 Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Total Proposed Amount ($): -$0.00 8 $10,370.10 -$0.00 0 $10,370.10 $139,996.30",
        "38": "SBIR Company Commercialization Report ANAUTICS, INC.\nTotal Investments: $8,753,827.00 *This CAI is calculated at the time of submission.\nCAI is calculated 1st of every month for all the organizations.\nThis might change your firms CAI.\nPlease visit our company dashboard on SBIR.Gov to view the most recent CAI for your organization.\nTotal Patents: 0 Total Sales: $5,072,882.00 * CAI: 80 Company Information Address: 116 E SHERIDAN AVE STE 100, OKLAHOMA CITY, OK, 73104-2446 SBC Control ID: SBC_000089554 Company Url: http://www.anautics.com Company POC Title: Brian Bendele Full Name: Brian Bendele Commercialization POC Title: CEO Full Name: Michael Johnson Phone: Email: 4053923012 brian.bendele@anautics.com Phone: Email: (405) 392-3012 mike.johnson@anautics.com Additional Company Information % Revenue for last fiscal year from SBIR/STTR funding: Total revenue for last fiscal year: 0.0% Year Founded: 2001 # Employees Currently: 41 Year first Phase I award received: # SBIR/STTR Phase I Awards: 2003 10 Year first Phase II award received: # SBIR/STTR Phase II Awards: 2004 11 # Employees at first Phase II award: Mergers and Acquisition within past 2 years: 3 No Spin-offs resulting from SBIR/STTR: IPO resulting from SBIR/STTR | Year of IPO: No No | N/A Patents resulting from SBIR/STTR | #Patents: List of Patents: No | 0 Woman-Owned: N HUBZone-Certified: N SMARTY-ii Socially and Economically Disadvantaged: N SBC majority-owned by multiple VCOC, HF, PE firms | By what percent (%): No | N/A Additional Investment From (Year over Year) DoD contracts/DoD subcontracts Angel Investors Venture Capital Self Funded Private Sector Other Federal Contracts/Grants Other Sources Additional Investment Total Investment 2019 $45,000.00 $0.00 $0.00 $0.00 $259,212.00 $385,000.00 $25,000.00 $0.00 $714,212.00 2020 $45,000.00 $0.00 $0.00 $0.00 $259,212.00 $385,000.00 $25,000.00 $0.00 2021 $4,246,396.00 $0.00 $0.00 $0.00 $3,712,431.00 $770,000.00 $25,000.00 $0.00 $714,212.00 $8,753,827.00 Last Updated On: 02/16/2021 Last Updated By: mjohnson4 Page 1/6",
        "39": "SBIR Company Commercialization Report Phase III Sales To (Year over Year) DoD or DoD prime contractors Private Sector Export Markets Other Federal Agencies Additional commercialization by 3rd Party Revenue Other Customers Additional Sales Total Sales 2019 $321,486.00 2020 2021 $321,486.00 $5,072,882.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $321,486.00 $321,486.00 $5,072,882.00 Commercialization Narrative Over the last two years Anautics has gone through a reorganization that has directly impacted our SBIR efforts.\nSome of our achievements include 1) Digital Engineering Platform for B-52 & B-52 Commercial Engine Replacement Program (CERP) and 2) Digital Greenhouse Phase III award.\nWe anticipate another Phase III award in the next 6 months.\nCommercialized Awards Digital Greenhouse Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2019 Subsidiaries No | N/A N/A Topic #: AF112-208 Contract/Grant #: FA8650-19-C-5083 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: 1 of 9 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 2 of 9 Non-Destructive Inspection Data Capture Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2017 Topic #: AF151-162 Contract/Grant #: FA8100-17-C-0019 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: USAF b.\nSystem/Program: AFSC c.\nCost Savings: $1,500,000.00 d.\nCost Savings Type: Annual savings e.\nExplanation: Anautics developed an innovation framework under the Digital Greenhouse used for discovery, prototyping and Yes | Systems Level Manufacturing Digital Greenhouse Corporation Subsidiaries Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nYes a.\nPrimary Agency: Air Force b.\nSystem/Program: Air Force Sustainment Center (AFSC) c.\nPhase III Contract #: FA8117-10-C-0023 Last Updated On: 02/16/2021 Last Updated By: mjohnson4 Page 2/6",
        "40": "SBIR Company Commercialization Report continuous delivery and operation of software.\nThis is an agile process that has saved the Air Force time and money by going away from old approach to software development.\nAdditional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $0.00 Dod or DoD prime contractors: $550,000.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $550,000.00 Government Phase III awards Funding Agreement / Contract # FA8117-10-C-0023 USAF Agency Project Title Year Awarded Awarded Value AFSC Digital Greenhouse 2021 $550,000.00 Multi-Attribute Reliability and Maintainability Engineering Assessment Methodology Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2012 Subsidiaries No | N/A N/A Topic #: AF093-193 Contract/Grant #: FA8117-12-C-0001 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: Decision Support System Based On Collaborative-orientated System Engineering Cpabilities Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2010 Subsidiaries No | N/A N/A Topic #: AF083-229 Contract/Grant #: FA8117-10-C-0023 Achieved a cost saving or cost avoidance?: No Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Additional Investment From Phase III Sales To Last Updated On: 02/16/2021 Last Updated By: mjohnson4 3 of 9 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 4 of 9 Page 3/6",
        "41": "SBIR Company Commercialization Report DoD contract/subcontract: Other Federal contract/grants: $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Advanced MRO Multi-Echelon Planning and Scheduling 5 of 9 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2008 Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Topic #: AF06-330 Contract/Grant #: FA8103-08-C-0071 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: GCLS b.\nSystem/Program: Air Force c.\nCost Savings: $421,000.00 d.\nCost Savings Type: Annual savings e.\nExplanation: On this project we provided the algorithms, processes and data schema free of charge for th use by the air force.\nPhase III Sales To $0.00 Dod or DoD prime contractors: $171,486.00 Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: Next Generation Aircraft Depot Maintenance Management Technologies Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2008 Subsidiaries No | N/A N/A Topic #: AF05-265 Contract/Grant #: FA8103-08-C-0070 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Last Updated On: 02/16/2021 Last Updated By: mjohnson4 Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 $0.00 $0.00 $0.00 $0.00 $171,486.00 6 of 9 $0.00 $0.00 $0.00 $0.00 Page 4/6",
        "42": "SBIR Company Commercialization Report Self-Funded: Private Sector: Other Sources: Other Sources Description: N/A $0.00 3rd Party Revenue: $234,212.00 Other Customers: $25,000.00 Investment Total: $259,212.00 Sales Total: $0.00 $0.00 $0.00 Pattern Recognition for Aircraft Maintainer Troubleshooting 7 of 9 Agency/Branch: Department of Defense/Air Force Manufacturing related Yes | Systems Level Manufacturing N/A Subsidiaries Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Program/Phase/Year: SBIR/Phase II/2007 Topic #: AF05-263 Contract/Grant #: FA8103-07-C-0003 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: EN b.\nSystem/Program: ECSS/GCSS c.\nCost Savings: $3,500,000.00 d.\nCost Savings Type: Annual savings e.\nExplanation: Smarty application is used to save man hours for building cross reference tables between to -4 and -6.\nThe application on average saves over 500 hours when building Bill of Materials (BOM).\nAdditional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $45,000.00 Dod or DoD prime contractors: $150,000.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $45,000.00 Sales Total: $150,000.00 Graphical Indexes for Aircraft Legacy Data Systems 8 of 9 Agency/Branch: DOD / AF Program/Phase/Year: N/A/N/A/2004 Topic #: AF03-274 Contract/Grant #: FA8103 -04-C-0152 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Manufacturing related Subsidiaries Yes | Systems Level Manufacturing N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: Other Federal contract/grants: $385,000.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Last Updated On: 02/16/2021 Last Updated By: mjohnson4 $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $25,000.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 5/6",
        "43": "SBIR Company Commercialization Report Other Sources: Investment Total: $0.00 $410,000.00 Sales Total: $0.00 Graphical Indexes for Aircraft Legacy Data Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2004 Topic #: AF03-274 Contract/Grant #: FA8103-04-C-0152 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Subsidiaries Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $4,201,396.00 Dod or DoD prime contractors: $4,201,396.00 Other Federal contract/grants: $385,000.00 Other Federal Agencies: 9 of 9 Yes | Systems Level Manufacturing N/A Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $3,453,219.00 Other Customers: $0.00 $8,039,615.00 Sales Total: $4,201,396.00 $0.00 $0.00 $0.00 $0.00 $0.00 Last Updated On: 02/16/2021 Last Updated By: mjohnson4 Page 6/6",
        "44": "Mike Johnson, Anautics, Inc Oct 31, 2024 Oct 31, 2025"
    },
    "images": [
        {
            "page": 8,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page8_img1.png",
            "hash": "c1493eb27b8fcc18",
            "position": "Top Center"
        },
        {
            "page": 9,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page9_img1.png",
            "hash": "c1493eb27b8fcc18",
            "position": "Top Right"
        },
        {
            "page": 10,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page10_img1.png",
            "hash": "c1493eb27b8fcc18",
            "position": "Top Right"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page11_img1.png",
            "hash": "c1493eb27b8fcc18",
            "position": "Top Right"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page12_img1.png",
            "hash": "c1493eb27b8fcc18",
            "position": "Top Right"
        },
        {
            "page": 13,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page13_img1.png",
            "hash": "c1493eb27b8fcc18",
            "position": "Top Right"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page14_img1.png",
            "hash": "c1493eb27b8fcc18",
            "position": "Top Right"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page15_img1.png",
            "hash": "c1493eb27b8fcc18",
            "position": "Top Right"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page16_img1.png",
            "hash": "c1493eb27b8fcc18",
            "position": "Top Right"
        },
        {
            "page": 17,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page17_img1.png",
            "hash": "c1493eb27b8fcc18",
            "position": "Top Right"
        },
        {
            "page": 17,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page17_img2.png",
            "hash": "820172617f7f2379",
            "position": "Middle Center"
        },
        {
            "page": 18,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page18_img2.jpeg",
            "hash": "eb3f49e6942237c0",
            "position": "Middle Center"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page19_img2.png",
            "hash": "f885c7d6961a1ad8",
            "position": "Top Center"
        },
        {
            "page": 19,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page19_img3.png",
            "hash": "fb1c9449c6c30b79",
            "position": "Bottom Center"
        },
        {
            "page": 23,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page23_img2.jpeg",
            "hash": "ee12d86d60a5b5a9",
            "position": "Top Center"
        },
        {
            "page": 24,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page24_img2.jpeg",
            "hash": "ca5c35705c1fcb86",
            "position": "Top Center"
        },
        {
            "page": 30,
            "image_file": "docNAC01FB7453531b1499bf272301b86c59c96da7c132b3f1e49fbb9a217ff5f7b0c1aa4e85c530_page30_img2.png",
            "hash": "ca4ba5b4b6296b4a",
            "position": "Top Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "anautics.com",
        "name": "N/A",
        "phone": "N/A"
    }
}