{
    "filename": "docNAC01FB7453532d99965533e35a1bb1ac37850e0910ca96e06c0d2778e1bee6b193928e27024b.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0097 Proposal S.M.A.R.T.\nL.I.N.K.S.\n- \"Streaming Modular Adaptation and Real-time Title: Transformation for Learning and Inference in Knowledge Structures\" Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: thatDot, Inc.\nAddress: Website: UEI: CAGE: 421 SW 6th Ave.\nSuite 300, Portland, OR 97204-1622 https://www.thatdot.com YDL7H2F7BH93 8EQU1 SBA SBC Identification Number: 002455077 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 12 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_002455077 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_002455077.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO N/A NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [X] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Ryan Wright Signature Title Business Name Date Ryan Wright Chief Technology Offi thatDot, Inc.\n09/27/2023 cer",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?NO VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: thatDot is a venture-backed American software company who created the revolutionary Quine streaming graph.\nThe capabilities of this streaming graph, developed over multiple DARPA projects, provide a major head start toward solving the challenges of human interaction on dynamic knowledge graphs.\nWith its “starnding query” capability, Quine helps humans interact with and understand dynamic knowledge graphs by monitoring the complete graph for user-defined patterns and triggering specified actions in real-time as the graph changes to fit the specified pattern.\nThis ability produces results immediately and can be scaled to ingest millions of events per second.\nWith standing queries in a streaming graph as the revolutionary new state of the art, thatDot proposes a roadmap for 8 applications of this capability to address the Air Force’s need to equip users to interact with dynamically changing knowledge graphs.\nThese proposed applications include: Machine-Assisted Graph Model Curation, Dynamic Schema Enforcement, Situational Awareness and Decision Making, Human-In-The-Loop Structure Learning, Pattern of Life Analysis, Threat Detection, and Graph Neural Networks for Similarity Measurement and Link Prediction.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: This proposal lays out a roadmap for 8 different applications of the new “Streaming Graph” capability to address the Air Force's need to allow a user to interact with a dynamic knowledge graph, make changes and additions to the knowledge graph, and suggest additional updates to surrounding nodes/edges in the graph.\nThe applications proposed include: Machine- Assisted Graph Model Curation, Dynamic Schema Enforcement, Situational Awareness and Decision Making, Human-In-The- Loop Structure Learning, Pattern of Life Analysis, Threat Detection, and Graph Neural Networks for Similarity Measurement and Link Prediction.",
        "5": "Attention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: streaming, graph, data, artificial intelligence, real time, anomaly detection, novelty, knowledge VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 100% 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES 3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES NO 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO",
        "6": "components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO 16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n20% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES VOL I - Contact Information Principal Investigator Name: Ryan Wright Phone: (810) 842-8368 Email: ryan@thatdot.com Address: 421 SW 6th Ave.\nSuite 300, Portland, OR 97204 - 1622 Corporate Official Name: Ryan Wright Phone: (810) 842-8368 Email: ryan@thatdot.com Address: 421 SW 6th Ave.\nSuite 300, Portland, OR 97204 - 1622 Authorized Contract Negotiator Name: Ryan Wright",
        "7": "Phone: (810) 842-8368 Email: ryan@thatdot.com Address: 421 SW 6th Ave.\nSuite 300, Portland, OR 97204 - 1622 Form Generated on 11/06/2024 02:38:11 AM",
        "8": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nS.M.A.R.T.\nL.I.N.K.S.\n\"Streaming Modular Adaptation and Real-time Transformation for Learning and Inference in Knowledge Structures\" SBIR Topic: Interactive Knowledge Graphs for Situational Awareness thatDot, Inc.\nPage 1 of 23",
        "9": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nTable of Contents Executive Summary.....................................................................................................................3 Introduction..................................................................................................................................4 Streaming Graphs........................................................................................................................5 The New State of the Art.........................................................................................................\n5 Quine.................................................................................................................................\n5 Novelty Detection..............................................................................................................\n7 Applications.............................................................................................................................\n9 1: Machine-Assisted Graph Model Curation.....................................................................\n9 2: Dynamic Schema Enforcement...................................................................................\n10 3: Situational Awareness and Decision Making...............................................................12 4: HITL Structure Learning...............................................................................................13 5: Pattern of Life Analysis................................................................................................\n14 6: Threat Detection..........................................................................................................\n15 7: GNNs for Similarity Measurement and Link Prediction...............................................\n17 Phase 1 Statement of Work......................................................................................................\n18 Scope....................................................................................................................................\n18 Task Outline...........................................................................................................................\n19 Milestone Schedule...............................................................................................................\n19 Deliverables...........................................................................................................................\n20 Progress Reports...................................................................................................................\n20 Final Report with SF 298.......................................................................................................\n21 Related Work..............................................................................................................................21 Future Research and Development.........................................................................................\n22 Key Personnel............................................................................................................................\n22 Foreign Citizens.........................................................................................................................\n23 Page 2 of 23",
        "10": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nExecutive Summary thatDot is a venture-backed American software company who created the revolutionary Quine streaming graph.\nThe capabilities of this streaming graph, developed over multiple DARPA projects, provide a major head start toward solving the challenges of human interaction on dynamic knowledge graphs.\nWith its “starnding query” capability, Quine helps humans interact with and understand dynamic knowledge graphs by monitoring the complete graph for user-deﬁned patterns and triggering speciﬁed actions in real-time as the graph changes to ﬁt the speciﬁed pattern.\nThis ability produces results immediately and can be scaled to ingest millions of events per second.\nWith standing queries in a streaming graph as the revolutionary new state of the art, thatDot proposes a roadmap for 8 applications of this capability to address the Air Force’s need to equip users to interact with dynamically changing knowledge graphs.\nThese proposed applications include: Machine-Assisted Graph Model Curation, Dynamic Schema Enforcement, Situational Awareness and Decision Making, Human-In-The-Loop Structure Learning, Pattern of Life Analysis, Threat Detection, and Graph Neural Networks for Similarity Measurement and Link Prediction.\nPage 3 of 23",
        "11": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nIntroduction Knowledge graphs are a tremendously powerful tool to understand data, but technical limitations on speed and scalability have limited their application to small use cases that generally operate in “human-time.” New technologies are opening the capabilities of these systems to unprecedented levels.\nKnowledge graphs are no longer static documents that rarely change but are becoming increasingly active and dynamic systems which show great promise for their role in modeling important systems to understand the world and live event taking place However as these systems get faster, the ability for humans to understand has not kept pace.\nTools were developed and staﬀ was trained when graphs were slow and mostly static data repositories.\nFor human understanding to keep up with the speed of technological development, new approaches are required.\nthatDot is a venture-backed American software company known as the creators of the Quine streaming graph.\nA revolutionary technology developed over multiple DARPA programs1 to solve previously impossible problems, Quine enables the understanding of high-volume streaming data at scale using event-driven graphs and the tools built on top of the graph.\nInitially designed to address the cybersecurity problem of detecting Advanced Persistent Threats (APTs), Quine has since seen applications in a wide collection of knowledge graph applications including: real-time attack path calculation for cyber threats at CrowdStrike, real-time risk scoring and asset allocation at JP Morgan Chase, following tainted funds through cryptocurrency blockchains, knowledge modeling and synthesis, data uniﬁcation across enterprise data silos in data fabrics, and many more.\nIn this proposal, thatDot lays out a 1 Including “Transparent Computing”: https://www.darpa.mil/program/transparent-computing and “ASKE”: https://www.darpa.mil/program/automating-scientiﬁc-knowledge-extraction Page 4 of 23",
        "12": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nresearch plan for building on top of the cutting edge streaming graph capabilities implemented in Quine and applying these capabilities to US Air Force applications.\nStreaming Graphs The New State of the Art Quine Over the last two decades, graphs have proven to be a highly eﬀective way to organize data.\nGraph databases like Neo4j, AWS Neptune, and TigerGraph have grown to be important tools for representing data and transforming it into knowledge.\nUseful as these tools may be, their adoption has been severely limited by a fatal ﬂaw: graph databases are slow and cannot scale to typical data volumes of the modern era.\nEven the fastest of these tools ends up being 3, 4, or 5 orders of magnitude too slow to be used in modern data pipelines.\nthatDot created Quine2 to solve this problem by building typical graph database functionality (e.g.\nstoring and querying data with the SQL-like CYPHER graph query language) into an event-driven, actor based, event-sourced streaming graph.\nQuine creates a graph by representing each node with an Actor.\nThe Actor Model was proposed by Carl Hewitt in the 1970s and it has seen a resurgence of use in the last decade as the ideal model for high-volume event-driven data processing pipelines.\nQuine integrates Actors deep into the graph model by using one or more actors to represent every node in the graph.\nActors are lightweight processes that contain internal state and communicate exclusively through asynchronous message passing.\nAn Actor has a mailbox where it receives messages, and 2 See: https://quine.io Page 5 of 23",
        "13": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nwhen scheduled on a CPU, it processes those messages from its mailbox in a single-threaded fashion.\nAn actor can perform arbitrary computation upon receiving a message, which allows it to perform all the duties required of a node in a graph.\nThe Actor foundation allows nodes in a Quine graph to eﬃciently compute query results, monitor themselves and their neighbors for matching user-deﬁned patterns, and trigger other actions when they witness certain kinds of events.\nActors can also be distributed over a very large cluster of computers to scale horizontally to support any size of workload.\nWith Actors at the heart of the graph in Quine, we employ other techniques to compliment the new functionality they aﬀord.\nData is saved to disk using a technique called “event-sourcing,” where only the changes to each node are actually saved to disk, and then added very eﬃciently to an append-only log.\nThis makes write operations very fast and the ideal way to support stream processing while ensuring updates are durably stored on disk.\nWith a history of changes for each node, the graph is also fully versioned, and the history of the full graph can be queried by simply including a timestamp with the user’s Cypher query.\nWith this capability, Quine enables querying all historical moments in the past to see what the data used to be.\nStanding Queries are a powerful feature enabled by Quine’s unique design.\nThese are the heart of how the SMART LINKS system can synthesize and understand new data ingested, and make timely interactive recommendations to human users.\nA Standing Query monitors the graph while it is changing for user-speciﬁed patterns of any complexity.\nWhen the data changes in a way so as to match the desired pattern, it triggers a Standing Query action.\nThese actions occur in real-time as the data changes.\nThey can alert analysts, publish data to Page 6 of 23",
        "14": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\ndownstream systems (like thatDot Novelty), or call back into the graph to create or update elements in the next tier of understanding in a new layer of the graph.\nthatDot has been told that the Air Force is already using Quine as a part of the “BDP” or “Big Data Platform” in the ELICSAR program.3 As an optional component in that platform, the ability to bring streaming knowledge synthesis and real-time pattern matching can already deliver tremendous beneﬁts.\nExtending that capability through the work proposed on the SMART LINKS project herein then has the potential to multiply the impact to other users inside the Air Force and across the DoD.\nNovelty Detection Novelty Detection is a new class of anomaly detection tool built on top of the Quine streaming graph.\nVirtually all other anomaly detection tools require only numbers as their input data.\nBut most behavioral data (of humans and computer systems) isn’t numeric but rather is categorical.\nCategorical data is just all the data which is not a number.\nValues like email addresses, username, ﬁle paths, IP addresses, and even ciphertexts are all categorical values.\nUsing categorical values in traditional anomaly detection is virtually impossible.\nWhile data scientists do have tools to represent categorical values as numbers (e.g.\none-hot encoding, binary encoding, etc.), doing so increases the vector dimensions enormously!\nOne-hot encoding (the most common approach) creates a new dimension for every single new value represented in the dataset; so every time a ﬁeld has a new value, a new dimension must be added to the vector.\nWhen performing anomaly detection, the practitioner faces the “curse of dimensionality”: as the number of dimensions increases, soon everything becomes an 3 https://elicsar.cce.af.mil/ Page 7 of 23",
        "15": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nanomaly.\nThis leads to a huge number of false positive results.\nTo make matters worse, these approaches cannot handle values they haven’t seen before, making them utterly unusable for streaming data applications.\nthatDot’s Novelty Detector takes a new approach.\nIt uses the Quine streaming graph under the hood to build a graph representation of the categorical data that streams through.\nWith a graph representation, Novelty can analyze each path through that graph to understand how common that path is, what alternatives there have been and how common they are, and ultimately use conditional probability in an information theoretic analysis of those graph paths to measure how novel each observation is compared to all observations which have streamed in previously.\nThis allows Novelty Detector to perform a self-training unsupervised and streaming/online learning model to measure how unusual or “truly novel” each event is, rather than relying on heuristics or approximations.\nNovelty Detector processes streaming data in real time to rank each event by how unusual it is—even if it has never been seen before.\nUnsupervised learning allows for better detection of the unknown unknowns to stop cyber threats.\nSince supervised learning relies on labeled datasets with known patterns, it struggles to identify new or previously unseen threats.\nUnsupervised learning, on the other hand, can detect anomalies and novel patterns in data without prior knowledge of what constitutes a threat .\nMalicious actors are dynamic and continuously evolving to evade detection mechanisms.\nNovelty Detection automatically learns the ﬁngerprint of normal behavior, automatically adapting to continuously learn from new data and identify and ﬂag deviations from normal behavior.\nThis behavioral monitoring approach fundamentally changes Page 8 of 23",
        "16": "the cat-and-mouse game that cyber defenders typically face, which is crucial for detecting DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nevolving cyber threat tactics .\nApplications At the heart of thatDot’s proposal to the Air Force for the “Interactive Knowledge Graphs for Situational Awareness” program is an important new capability: to know automatically WHEN important relationships and data structures have appeared (or disappeared) in the ever-growing graph model, and then to trigger action with that data automatically and in real-time.\nThat action can: a.) prompt a human to make a decision, b.) feed an external automated system in real-time, or even c.) feed back into the graph to update data or compute the next step in an algorithm to provide richer answers to the people who depend on understanding that data.\nHerein we lay out a roadmap of capabilities to be explored throughout the phases of this program—each of them enabled by the unique capabilities of the Quine streaming graph where the fundamental technologies have already been proven, and with the team of experts who work to deliver these capabilities daily.\n1: Machine-Assisted Graph Model Curation Standing queries are a revolutionary new capability to come to knowledge graph systems.\nWith a standing query, a user can express a pattern of interest and rely on the system to inform them every time a new result matches the pattern they are interested in.\nThose patterns can be positive patterns (matching a speciﬁc structure) or negative patterns (matching a base pattern, but failing to match an extension of that base pattern).\nThis makes standing Page 9 of 23",
        "17": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nqueries an ideal tool for a user to monitor a graph while it continues to change and ensure that various characteristics the user expects of the data continue to hold.\nAny variation of the data from what the user has expressed is delivered as results that can link to the speciﬁc data.\nWe propose creating an interface to enable a user to deﬁne a new standing query from their visual interaction with the underlying data in the knowledge graph.\nThe current capability requires a user to leave their graphical environment and make an API call to express a new Cypher query and output handler as their new Cypher query.\nThis process is cumbersome and requires skills beyond those needed for visual analysis and interaction.\nWith this proposed interface, a user can explore the graph using Quine’s built-in Exploration UI4, and upon ﬁnding a surprising pattern (because of unexpected extant graph structure or missing graph structure) the user could easily deﬁne a new standing query from the visualization they are already looking at.\nThe new standing query would allow the user to: a.) be notiﬁed if the pattern occurs again, b.) deﬁne a mitigation to adjust the data to its desired form, c.) publish the unexpected data to downstream or external systems, or d.) update an algorithm running on the graph, or e.) trigger any other action programmatically.\n2: Dynamic Schema Enforcement One of the great advantages of a graph data model is that it is very ﬂexible.\nHowever that advantage also becomes a disadvantage in many applications.\nA graph model is considered a “NoSQL” data model because it does not require or enforce a schema deﬁnition for data to be written in.\nThe downside of this model is that: a.) it is hard for a new query writer 4 https://quine.io/getting-started/exploration-ui/ Page 10 of 23",
        "18": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nto know what is worth querying without a structure of the data to start from; and b.) the data might change in unexpected ways, altering the results they expect to see.\nWe propose a new capability for an end user to create a “dynamic schema” on their knowledge graph.\nA dynamic schema is the ability—at any point during the operations on a graph—to specify constraints that must hold on the graph structure, or a query mutation will fail and return an error.\nA dynamic schema is not possible or practical on other graph systems, but because nodes in a Quine graph are backed by actors, and those actor can perform arbitrary computation during other graph operations, enforcing a dynamic schema is within reach.\nA dynamic schema can be thought of as a standing query which, upon matching a relevant node, will actively check subsequent operations on that node and cause incompatible types of operations to fail with a “Schema Violation” error.\nIn order to be applicable, a node must ﬁrst meet the criteria for the schema constraint—which can be as simple or complex as desired.\nOnce it meets that criteria, the speciﬁed types of operations will be disallowed on that node.\nAs a concrete example: A node in the graph may represent a user account, as signiﬁed by the presence of a userId property on that node.\nUser accounts may be granted access to other systems (signiﬁed by a systemId property) by creating a can_access edge from the user account node to the system node.\nA dynamic schema constraint could be added to the system node to ensure at least one user will always have access.\nTo enforce this, a dynamic schema constraint can be set on the system node which applies whenever the system has one or more incoming can_acccess edges (so the schema is only enforced after the ﬁrst user has been granted access).\nIf a user account is about to be deleted or have its can_access edge Page 11 of 23",
        "19": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nremoved, and that user is the last user connected with a can_access edge to that system node, then the operation attempting to remove the user returns an error with an explanation that a dynamic schema violation has occurred and explaining the requirement to ensure at least one user will have access to the system in question.\nThe formal theory behind dynamic schemas is based on “structural types”5 from type theory, which is also the theoretical model underlying standing queries.\n3: Situational Awareness and Decision Making Quine is an event-driven graph, which means it reacts to changes.\nAny event that causes data to change anywhere in the graph has the potential to perform arbitrary computation or to trigger other events (inside or outside of the system).\nHaving an event-driven capability on a graph makes it the perfect infrastructure tool to synthesize data from many remote sensors, troops, vehicles, or other assets.\nModeling those assets in a graph becomes the foundation for a highly adaptive and useful visualization to provide situational awareness for highly complex scenarios unfolding in real-time.\nWe propose building a graph model for situational awareness and a UI integration which uses Quine’s event-driven capability to update a visualization (e.g.\na battleﬁeld map) in real-time with the results of data reported from remote sensors.\nMore than simply moving the positions of icons over a map, to eﬀectively visualize a large number of data points requires aggregating and interpreting groups of data points depending on the circumstances of how the data changes over time and over a complex set of other characteristics (e.g.\nin relation to geographical features, progress toward mission goals, etc.).\n5 https://en.wikipedia.org/wiki/Structural_type_system Page 12 of 23",
        "20": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nOur proposal would build multiple graph layers, where each successive layer is an interpretation of the layer below it.\nAs changes ripple through each layer of the graph, their updates cause the layer above to update in real-time as well.\nEach graph layer shows a smaller amount of total data than the layer below it that it interprets, but information in the higher layer is more abstract than the layer below it.\nWhile the lowest layer would include every data point for every sensor reporting, the top layer would simply sum up the total progress as being “on target” or not.\nAs you move from the bottom to the top layer, each successive layer contains less total data (number of nodes), but each node represents an increasingly rich concept.\n4: HITL Structure Learning The richness of graph structure is on display when ingesting simple events which, once connected, can yield important and complex relationships among the paths between them.\nThe structure of the data written in is often not the determinant of what patterns are valuable to query out.\nSometimes a creative analyst can imagine which patterns are worth querying out of the emergent graph structure, but there is almost always a collection of interesting patterns that would be useful to know which the analyst cannot conceive of querying.\nWe propose a tool for learning those important patterns from the graph through an automated human-in-the-loop (HITL) process of structure learning.\nSometimes called “pattern learning” or “query learning,” the process of structure learning on a graph begins with the data in the graph, and ends with a pattern or a query that describes the subsections (or subgraphs) in the data which are useful to query for.\nPage 13 of 23",
        "21": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nThis process would begin by using machine learning tools to measure the similarity of nodes in the graph; see the section of Graph Neural Networks (GNNs) below.\nNodes that are measured to have a high similarity will have their neighboring structure parsed to determine small scale structure found in common among similar nodes.\nThe small-scale parsed structures will be presented to a human for evaluation and—crucially—for naming.\nAny pattern approved by a human evaluator and able to be named will be fed back in as input to repeat the process.\nWith the named structure as input, the process will repeat, but this time using the named structure to rewrite the graph wherever that structure occurs into a single node.\nSimplifying the graph structure based on the named pattern gives us a new iteration of the graph structure to measure for similarity, parse out common structure, and again present the newly found common structures to a human.\nUpon this second interaction, new patterns presented to the human analyst to approve and name will be composed of instances of their prior simpler named structure.\nThis process continues for as long as the human is able to identify and name useful structures.6 5: Pattern of Life Analysis Graphs are a useful tool for understanding behavioral data of subjects.\nThese subjects can be humans, computer systems, artiﬁcially intelligent agents, or more.\nRecording a series of behavioral observations naturally draws a graph as subjects interact with each other and objects in the world.\nUnderstanding commonalities in this space can follow the same general pattern as described above in the “Pattern Learning” section to ﬁnd types of behavior that are 6 This proposal is based on prior led by the same principal investigator, Ryan Wright, which showed this approach to be eﬀective: https://arxiv.org/abs/1908.02947 Page 14 of 23",
        "22": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\ncommon but useful to understand.\nHowever, much of the value in pattern of life analysis is in recognizing unusual patterns in the behavior of subjects.\nWe propose a tool for real-time ranking of how unusual behavioral patterns are that occur in a graph.\nThis tool would be able to a.) assemble individual behavioral events into a graph in order to b.) connect them to relevant context and c.) make simple measurements, before d.) sending complete observations to the Novelty Detection component to learn a thoroughgoing model of contextually aware behavioral patterns, and e.) scoring them in real-time to understand how novel that behavior is compared to the normal behavior pattern for each individual.\nTo develop this tool would be a matter of using Quine and Novelty Detection together and building an integration ﬁt to data that corresponds to a real-world Air Force use case.\nTwo key factors are critical for this approach: 1.) The learning model is entirely unsupervised.\nNo training data is required.\n2.) The model that is learned is contextually aware and able to distinguish between events that are simply new and previously unseen vs.\ntruely novel.\nThis approach has proven very eﬀective in pattern of life analysis for cybersecurity to measure in real-time the suspicious behaviors that call for swift action to stop a cyber threat.\n6: Threat Detection Interactive real-time graphs which can connect individual log events and measure the novelty of the events they observe are emerging as a critical capability for threat detection and cybersecurity.\nConnecting events gives a human analyst the context they need to understand the events.\nBut connecting data fast enough to keep up with non-trivial data volumes has Page 15 of 23",
        "23": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nhistorically been a challenge for graph systems.\nQuine has the ability to scale horizontally and has been demonstrated ingesting data over 1,000,000 events per second, while simultaneously ﬁnding and publishing 21,000 standing query results every second.\nThis scale represents an improvement of 1,000-100,000 times beyond any other graph system.\nIt opens up deep graph analysis to the data volumes needed to analyze and understand cybersecurity logs at the scale of large organizations.\nWhen combined with Novelty Detection, we have the capability to aid a human in prioritizing their analysis to ensure that emerging threats are properly identiﬁed in time to stop the threat.\nWe propose an application which combines the Quine streaming graph with Novelty Detection to ﬁnd and prioritize emerging threats based on the novelty of their behavioral patterns.\nThis capability is resilient to new and emerging threats threats because it evaluates the behavior of system in context and delivers a.) timely alerts to human analysts with b.) a link to interactively explore the relevant graph structure and c.) any surrounding context the analyst needs to understand the threat, and d.) a ranking of how novel this threat is compared to all other activity in the system.\nDemonstrating this capability will require either accessing or generating a proper dataset to simulate real-world background traﬃc, realistic malicious activity, and the integration of two systems to consume and evaluate the data.\nOur team has deep experience performing this kind of demonstration and deployments in real-world environments.\nThe US Navy is currently exploring such a deployment for detecting malicious adversaries onboard Navy ships in a DDIL environment.\nIn the commercial sector, Crowdstrike has deployed our tools to perform real-time analysis of potential attack paths from Page 16 of 23",
        "24": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\ncompromised machines to critical assets.\nFaster threat detection enables a critical diﬀerence in time to respond and success at stopping the threat.\n7: GNNs for Similarity Measurement and Link Prediction Graph Neural Networks (GNNs) are proving to be the powerful and necessary complement to LLM applications.\nWhile LLMs have amazed with the quality of their English responses, research has shown they are especially bad at logical reasoning7 and graph-oriented tasks in particular.8 However, graph neural networks are proving to provide the kind of graph-based reasoning for which LLMs are ill-suited.9 We propose a toolset for iteratively exploring updates to graph structure derived from GNNs reasoning over graphs.\nIn particular, the tool-enabled workﬂow would allow a user to automatically train a neural network over graph data which can then propose back to the user two kinds of suggestions: 1.) nodes or graph structures that are similar to the nodes they are investigating, and 2.) predicted edges missing from the dataset.\nMultiple GNNs techniques will be explored and their tradeoﬀs evaluated, including: Node2Vec, GraphSAGE, Graph Convolutional Networks, and Graph Attention Networks.\nEach of these techniques serves a diﬀerent purpose, and includes varying tradeoﬀs.\nA key challenge to operationalizing GNNs in practice is that the underlying graph data they need for training isn’t naturally static, it’s continually updating.\nMost datasets continue to change as time marches on.\nTraining neural networks can be time consuming when the dataset is large, and this exacerbates the problems in any approach that needs to hold the data 7 See recent research from Apple: https://arxiv.org/abs/2410.05229 8 See recent research from Google researcher Bryan Perozzi and team: https://arxiv.org/abs/2310.04560 9 See our related work here: https://www.thatdot.com/blog/graph-neural-networks-for-quine/ Page 17 of 23",
        "25": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nconstant—often for days at a time—while the neural network data is prepared and trained.\nOne of the key capabilities of Quine that we’ll explore in this area is the ability to query the historical state of the graph even while it continues to change.\nQuine’s internal data model produces a fully-versioned graph where every single change is saved individually and conveniently accessible.\nThat means that queries can be run on historical data in exactly the same way that they are run on present data, just by including a timestamp with the query.\nThat gives a dynamically changing graph the ability to be queried at a previous ﬁxed state (including queries that dynamically generate random walks).\nPhase 1 Statement of Work Scope This proposal will research techniques that enhance a user’s ability to interact with dynamic knowledge graphs.\nIn earlier sections, we laid out a roadmap of research topics which we expect will all provide value to the Air Force mission behind this program.\nFor execution during Phase 1, we propose tackling the ﬁrst option listed under “Applications” above: Machine-Assisted Graph Model Curation.\nRemaining topics can be explored in later phases of this work.\nHowever, our team is interested in maximizing the value to the Air Force in this research.\nTherefore, if a diﬀerent order of execution would be most appropriate, our team is willing to adapt the plan as laid out above to ﬁt.\nTo that end, our tasks, milestones, and deliverables incorporate discussion and feedback to adapt the work to the topics most relevant to the Air Force.\nPage 18 of 23",
        "26": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nTask Outline 1.\nCoordinate technical use case with customer 2.\nIdentify use case dataset 3.\nBuild streaming graph implementation 4.\nReport on results.\nMilestone Schedule ID Title Description 01 Kickoﬀ Meeting Kickoﬀ meeting and associated materials 02 03 Research Plan & Progress Report Research plan for using Quine and Novelty Detector to address the goals for interactive knowledge graphs.\nIdentiﬁed Dataset & Progress Report Contractor will deliver conﬁrmation of identiﬁed datasets suitable for the research plan, and a status report.\n04 Interim Demo Contractor will demonstrate preliminary capabilities for agreed upon experiments and datasets via teleconference 05 Final Demo Final demonstration of capability via teleconference 06 Final Report with SF 298 Report on the ﬁnal work performed during Phase 1 and results achieved Delivery 30 days from award 60 days from award 90 days from award 120 days from award 180 days from award 180 days from award Deliverables ● Kickoﬀ Meeting materials: Meeting minutes and ● Research Plan: A report of the updated research plan incorporating customer feedback Page 19 of 23",
        "27": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\n● Dataset Conﬁrmation: An explanation of the identiﬁed dataset which matches the customer’s desired use case application of the research ● Interim Demo: A demonstration of interim progress made toward the overall use case implementation.\n● Final Demo: A demonstration of the ﬁnal progress made during Phase 1 toward the overall use case implementation.\n● Final Report with SF 298: A written summary of the results accomplished during phase 1 and a standard form 298.\nFor the code developed on this program, we plan to deliver that code into the open source project that is published at https://quine.io with code freely available from https://github.com/thatdot/quine The Air Force and the DoD at large will be able to freely use all the code artifacts produced as a result of this proposal.\nProgress Reports Our desire is to make this research maximally eﬀective for the Air Force.\nTherefore, we incorporate into our proposal the ability to adapt to speciﬁc customer needs and integrate customer direction into our work.\nWe will report on the state of research as it adapts to customer needs through periodic status reporting.\nThe delivery of status reports will align with the timeframes described in the Milestone Schedule above.\nPage 20 of 23",
        "28": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nFinal Report with SF 298 At the completion of Phase 1, the contractor will submit a ﬁnal report to summarize the work done to date, including key performance metrics (including accuracy and completeness) and lay out directions for future continuation of the work performed.\nThis report will include a Standard Form 298.\nRelated Work From 2015 to 2019, Ryan Wright led a team of researchers from Galois, PARC, the University of Oregon, and the University of Edinburgh on the DARPA Transparent Computing program.\nThis program, organized by DARPA program manager Dr.\nAngelos D.\nKeromytis, was funded speciﬁcally to accomplish the 6-1 and 6-2 research required to detect highly sophisticated, nation-state-level attackers who are already inside of computer systems.\nResearch on this program led to the two key developments described in this proposal: the Quine streaming graph and Novelty Detection.\nWith these two revolutionary technologies, the team led by Wright demonstrated automated detection of Advanced Persistent Threats (APTs) by the end of the program.\nWright founded thatDot to commercialize these technologies and bring them to the ﬁeld as deployable commercial applications.\nIn recent months, thatDot has worked with the US Navy Undersea Naval Warfare Oﬃce (with Ian T.\nRussell and Kathleen Hourihan), the Oﬃce of Naval Research (with Dr.\nRyan Craven), AFWERX, and Lockheed Martin (with Jake Wertz, Scott Timme, William Moldenhauer, Char Carrie, and Tyler William) to successfully test applications of these technologies to protect systems onboard aircraft, ships, missile systems, and submarines.\nPage 21 of 23",
        "29": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nFuture Research and Development Future research and development objectives are focused on the combination of Quine Enterprise and Novelty Detector into a cohesive package that is forward deployable in a containerized package.\nThese packages will enable the organization to quickly deploy and maintain the capability, ingest large volumes of data and impact decision making without delays.\nFuture development objectives will also focus on scalability to ensure that any platform across the Navy can interoperate with other instances of this capability or with legacy tools.\nKey Personnel thatDot is proud to introduce its key personnel, a team of highly qualiﬁed and accomplished individuals who bring a wealth of expertise and experience to our organization.\nCommitted to excellence and innovation, our key personnel play a pivotal role in driving the success of thatDot and ensuring our continued growth in the ever-evolving landscape of technology and data analytics.\nWith their diverse skill sets and unwavering dedication, they embody our company's values and are instrumental in shaping our vision for the future.\nName Ryan Wright Title CTO KEY PERSONNEL SUMMARY Employer Description thatDot Ryan Wright is the creator of Quine (https://quine.io) and has been leading software teams focused on data infrastructure and data science for two decades.\nHe was principal engineer, architect, and director of engineering at several software startups.\nWhile at US Citizen Yes Page 22 of 23",
        "30": "DoD SBIR 2024.4 AF244-0001 Proposal #: F244-0001-0097 S.M.A.R.T.\nL.I.N.K.S.\nGalois for 6 years, Ryan served as principal investigator and more on DARPA-funded research programs such as Transparent Computing, CFAR, ASKE, Safeware, Brandeis, and others.\nHe has founded four diﬀerent companies, and is currently the founder and CTO of thatDot—the company supporting the new open source streaming graph, Quine.\nForeign Citizens thatDot does not have any foreign citizens, U.S.\npermanent residents, or individuals with dual citizenship employed in any capacity within our team for this project.\nTherefore, there are no individuals to report in terms of their country of origin, visa or work permit status, or anticipated level of involvement on this project.\nOur team is composed entirely of individuals who do not fall into this category, ensuring full compliance with all project requirements and regulations.\nPage 23 of 23",
        "31": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Cage F244-0001-0097 AF244-0001 S.M.A.R.T.\nL.I.N.K.S.\n- \"Streaming Modular Adaptation and Real-time Transformation for Learning and Inference in Knowledge Structures\" 11/06/2024 02:38:08 AM thatDot, Inc.\n421 SW 6th Ave.\nSuite 300, Portland, Oregon, 97204 https://www.thatdot.com YDL7H2F7BH93 8EQU1 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) $140,000.00 $140,000.00 $0.00 $0.00 $0.00 $140,000.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $140,000.00 $0.00 -$0.00 $0.00 $140,000.00 $0.00 $0.00 $0.00 $0.00",
        "32": "Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 0%) x Base () Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Base Year Direct Labor Costs $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Category / Individual-TR Computer and Information Research Scientist/ Principal Investigator Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $250.00 208 $52,000.00 Software Developer/ Engineer Subtotal Direct Labor (DL) Labor Overhead Cost Total Direct Labor (TDL) G&A (rate 0%) x Base () Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Year 2 Direct Labor Costs Category / Individual-TR $160.00 550 $88,000.00 $140,000.00 $0.00 $140,000.00 $0.00 -$0.00 $0.00 $140,000.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost Computer and Information Research Scientist/ Principal Investigator $250.00 0 Subtotal Direct Labor (DL) Labor Overhead Cost Total Direct Labor (TDL) $0.00 $0.00 $0.00 $0.00",
        "33": "G&A (rate 0%) x Base () Cost Sharing Profit Rate (0%) Total Estimated Cost TABA Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Ryan Wright Phone: (810) 842-8368 Phone: ryan@thatdot.com Title: Proposal Owner $0.00 -$0.00 $0.00 $0.00 $0.00 If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: No Select the Type of Payment Desired: Partial payments",
        "34": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Computer and Information Research Scientist Principal Investigator Master's Degree Software Developer Engineer Bachelor's Degree 22 10 208 $250.00 $52,000.00 550 $160.00 $88,000.00 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\nStandard burdened costs including benefits, health insurance, supplies, etc.\nProvide any additional information and cost support data related to the nature of the direct labor detailed above.\nRates compare favorably.\nDirect Labor Cost ($): Year2 $140,000.00 Category Description Education Yrs Experience Hours Rate Fringe Rate Computer and Information Research Scientist Principal Investigator Master's Degree 22 0 $250.00 Are the labor rates detailed below fully loaded?\nPlease explain any costs that apply.\nSame as previous year.\nProvide any additional information and cost support data related to the nature of the direct labor detailed above.\nRates compare favorably.\nDirect Labor Cost ($): Total $0.00 YES $0.00",
        "35": "Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Cost Overhead Comments: Overhead Cost ($): Year2 Labor Cost Overhead Cost Overhead Comments: Overhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs $140,000.00 $0.00 $0.00 $0.00 $0.00 $0.00 0 NO NO $0.00 0 NO NO",
        "36": "are calculated.\nG&A Cost ($): Sum of all G&A Costs is ($): Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): $0.00 $0.00 -$0.00 0 $0.00 -$0.00 0 $0.00 Total Proposed Amount ($): $140,000.00",
        "37": "Ryan Wright, thatDot, Inc.\nNov 04, 2024 Nov 04, 2025"
    },
    "images": [
        {
            "page": 8,
            "image_file": "docNAC01FB7453532d99965533e35a1bb1ac37850e0910ca96e06c0d2778e1bee6b193928e27024b_page8_img1.png",
            "hash": "d9b27a662443c2de",
            "position": "Top Left"
        },
        {
            "page": 9,
            "image_file": "docNAC01FB7453532d99965533e35a1bb1ac37850e0910ca96e06c0d2778e1bee6b193928e27024b_page9_img1.png",
            "hash": "d9b27a662443c2de",
            "position": "Top Left"
        },
        {
            "page": 10,
            "image_file": "docNAC01FB7453532d99965533e35a1bb1ac37850e0910ca96e06c0d2778e1bee6b193928e27024b_page10_img1.png",
            "hash": "d9b27a662443c2de",
            "position": "Top Left"
        },
        {
            "page": 11,
            "image_file": "docNAC01FB7453532d99965533e35a1bb1ac37850e0910ca96e06c0d2778e1bee6b193928e27024b_page11_img1.png",
            "hash": "d9b27a662443c2de",
            "position": "Top Left"
        },
        {
            "page": 12,
            "image_file": "docNAC01FB7453532d99965533e35a1bb1ac37850e0910ca96e06c0d2778e1bee6b193928e27024b_page12_img1.png",
            "hash": "d9b27a662443c2de",
            "position": "Top Left"
        },
        {
            "page": 13,
            "image_file": "docNAC01FB7453532d99965533e35a1bb1ac37850e0910ca96e06c0d2778e1bee6b193928e27024b_page13_img1.png",
            "hash": "d9b27a662443c2de",
            "position": "Top Left"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB7453532d99965533e35a1bb1ac37850e0910ca96e06c0d2778e1bee6b193928e27024b_page14_img1.png",
            "hash": "d9b27a662443c2de",
            "position": "Top Left"
        },
        {
            "page": 15,
            "image_file": "docNAC01FB7453532d99965533e35a1bb1ac37850e0910ca96e06c0d2778e1bee6b193928e27024b_page15_img1.png",
            "hash": "d9b27a662443c2de",
            "position": "Top Left"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB7453532d99965533e35a1bb1ac37850e0910ca96e06c0d2778e1bee6b193928e27024b_page16_img1.png",
            "hash": "d9b27a662443c2de",
            "position": "Top Left"
        },
        {
            "page": 17,
            "image_file": "docNAC01FB7453532d99965533e35a1bb1ac37850e0910ca96e06c0d2778e1bee6b193928e27024b_page17_img1.png",
            "hash": "d9b27a662443c2de",
            "position": "Top Left"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "thatdot.com",
        "name": "N/A",
        "phone": "N/A"
    }
}