{
    "filename": "docNAC01FB7453539d5141b0cf58f8e98e25bb9db213ff1594f0a0b9ce304a5632a9903362e33699.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0059 Proposal Title: Synchronized Statistical Knowledge Network (SSKN) Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: ATC - NY Address: Website: UEI: DUNS: CAGE: P.O.\nBox 422 , Trumansburg, NY 14886-0422 http://www.atcorp.com LE62V456GNB5 101321479 8V807 SBA SBC Identification Number: 000000460 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 78 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_000000460 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBA Registration confirmation 2019.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education YES YES YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [X] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Firm Affiliates: Name Address Architecture Technology Corporation 9971 Valley View Road Eden Prairie, MN Number of Employees 58",
        "4": "Signature: Printed Name Richard Smith Signature Title Business Name Date Richard Smith Controller ATC - NY 12/31/2019 Audit Information Summary: Has your Firm ever had a DCAA review?\nWas your accounting system approved by the auditing agency?\nWas a rate agreement negotiated with the auditing agency?\nWas an overhead and/or cost audit performed?\nYES Last Audit Date: 12/05/2019 YES Last Update Date: 12/16/2021 YES Last Update Date: 01/18/2019 YES Date of Overhead Audit: 12/05/2019 Date of Cost Audit: 09/11/2019 Are the rates from the audit agreement used for this firms proposal?\nNO Firm Information: Agency Firm: Address: Point of Contact (POC) Name: POC Phone: POC Email: Upload a copy of the audit information: • 2018 APPROVED FINAL RATES.pdf DCAA - Upstate Branch 5795 Widewaters Pkwy, 2nd Floor Dewitt , New York 13214 Scott McCarthy (518) 448-6216 scott.mccarthy@dcaa.mil VOL I - Proposal Summary",
        "5": "Summary: Proposed Base Duration (in months): 6 Technical Abstract: Knowledge Graphs (KGs) produced by automated AI techniques such as information extraction and KG engines are imperfect and require expert review to ensure trustworthiness and utility.\nATC-NY will develop the Synchronized Statistical Knowledge Network (SSKN), a dynamic KG editing and enhancement tool that streamlines user interactions by automatically incorporating the latest intelligence and synchronizing users’ feedback and updates across the organization.\nSSKN enables users to store the reasoning behind their changes, empowering automated updates to find and correct similar errors in future data collections, as well as building trust with the user community and further reducing manual effort.\nUsing SSKN, an Air Force analyst can exploit continually updating data sources, such as satellite image feeds and private chat message boards (e.g., a Slack channel), with minimal effort.\nSSKN automatically incorporates the latest information, which the analyst can quickly view and correct; SSKN then will propagate and reconcile these changes across the knowledge corpus to benefit all users and mission operations.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: The Synchronized Statistical Knowledge Network (SSKN), as an interactive Knowledge Graph (KG) updating and exploitation tool, can benefit Air Force and other DoD intelligence analysis workflows by reducing manual effort required for daily KG reviews and enabling dynamic KGs.\nSSKN also has the potential to streamline time-sensitive analysis applications involving KGs for other organizations, including law enforcement, security firms, and financial services.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: adaptive knowledge graph; dynamic knowledge graph; interactive knowledge graph; time-constrained decision making; user modification of knowledge graphs; automated knowledge gap detection; knowledge discovery",
        "6": "VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\n3.\nDuring the performance of the contract, the research/research and development will be performed in the United States.\n88.58% 11.42% YES YES 4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\n8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES NO NO NO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\n15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nYES NO",
        "7": "16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\n20% NO YES Partners: Partner Name Partner Type Architecture Technology Corporation Small Business Point of Contact Akeem Adewusi VOL I - Contact Information Principal Investigator Name: Paul Nicotera Phone: (607) 257-1975 Email: pnicotera@atcorp.com Address: P.O.\nBox 422 , Trumansburg, NY 14886 - 1111 Corporate Official Name: Rick Smith Phone: (607) 257-1975 Email: contracts@atc-nycorp.com Address: P.O.\nBox 422 , Trumansburg, NY 14886 - 0422 Authorized Contract Negotiator Name: Rick Smith Phone: (607) 257-1975 Email: contracts@atc-nycorp.com Address: P.O.\nBox 422 , Trumansburg, NY 14886 - 0422 Form Generated on 11/05/2024 03:56:55 PM",
        "8": "ATC-NY AF244-0001 F244-0001-0059 1 Identification and Significance of the Problem or Opportunity Knowledge Graphs (KGs) produced by automated AI techniques such as information extraction and KG engines are imperfect and require expert review to ensure trustworthiness and utility.\nFurther, the benefits of manually applied expert knowledge to individual KG instances are not easily propagated and persisted as KGs evolve with new data and are applied to other use cases.\nATC-NY will develop the Synchronized Statistical Knowledge Network (SSKN), a dynamic KG editing and enhancement tool that streamlines user interactions by automatically incorporating the latest intelligence and synchronizing users’ feedback and updates across the organization.\nSSKN enables users to store the reasoning behind their changes, empowering automated updates to find and correct similar errors in future data collections, as well as building trust with the user community and further reducing manual effort.\nTo do this, SSKN overlays Probabilistic Graphical Models (PGMs), such as Bayesian networks, onto KGs produced by existing, state-of-the-art Information Extraction (IE) and Artificial Intelligence (AI) pipelines.\nThe PGMs encode both evidence-based and user-driven statistical trends related to elements as they are updated in the associated KG.\nSSKN employs efficient dynamic graph alignment methods to accurately and rapidly update the dual graph representation – called a Probabilistic Dynamic Graph (PDG) – as new data and user inputs are received, maintaining consistent corpus-level references.\nPDGs enable SSKN’s Hypothesis Engine to infer probable inconsistencies and gaps in the current common operating picture, so stakeholders can readily identify intelligence gathering priorities and analytical objectives.\nUsing SSKN, an Air Force analyst can exploit continually updating data sources, such as satellite image feeds and private chat message boards (e.g., a Slack channel), with minimal effort.\nPDGs automatically incorporate the latest information, which the analyst can quickly view and correct; SSKN then will propagate and reconcile these changes across the knowledge corpus to benefit all users and mission operations.\nIf the analyst has selected to receive knowledge discovery recommendations, SSKN also provides suggestions related to potentially important entities and relations that may not have been explored, as well as missing evidence that is likely to provide useful situational understanding based on past interactions.\n1.1 Statement of the Problem While many IE and AI technologies exist to translate heterogenous, multimodal data sources into KGs, fully automated KG engines are not able to handle every eventuality which often results in errors, inconsistencies, and incomplete synthesis of the available knowledge.\nFor high-stakes applications that rely on KGs, it’s important to review the automated output and correct these issues.\nKG developments related to user interactions have predominantly focused on visualization, querying, and exploration activities.\nThus, modifications to KG content, schemas, and application interfaces are largely performed manually and are not reused to benefit future KG workflows.\nThe development of automated updates and interactivity to facilitate dynamic, rapidly evolving KGs entails overcoming many challenges.\nThere are multiple types of data sources that can feed into KG engines, resulting in diverse node contents and entity relationships, including structured data sources, unstructured information sources, and mixed datasets that may consist of structured data like a database populated with lengthy text entries.\nIn addition, an adaptive, interactive KG tool must This proposal includes data that shall not be disclosed outside the Government and shall not be duplicated, used, or disclosed-in whole or in part-for any purpose other than to evaluate this proposal.\nIf, however, a contract is awarded to this offeror as a result of-or in connection with-the submission of this data, the Government shall have the right to duplicate, use, or disclose the data to the extent provided in the resulting contract.\nThis restriction does not limit the Government's right to use information contained in this data if it is obtained from another source without restriction.\n1 The data subject to this restriction are contained in pages 1–7 and 10–34.",
        "9": "ATC-NY AF244-0001 F244-0001-0059 support the range of KG types commonly in use, such as domain graphs and lexical graphs, which entail different methods of interpreting and updating the nodes, links, and attributes.\nUsers may wish to alter the structure and even the schema or taxonomy associated with a KG to reflect changes in real world conditions, which requires ensuring that all affected entities and relationships in the KG are appropriately updated.\nSuch modifications may also create gaps or inconsistencies in the knowledge representation, which ideally the system should automatically correct to the extent possible and recommend intelligence gathering actions to fill any remaining gaps.\nFurther, to build trust in the automated system, KG updates would not “make the same mistake twice”, in the sense that as new intelligence is added from daily or weekly data collections, the automated updates would recognize issues similar to those that were previously corrected and apply analogous changes.\nHence, an innovative technology solution is called for to address these capability gaps and facilitate efficient, intuitive, and adaptive KG editing capabilities for time-sensitive and high-impact analytical workflows, such as national defense and peer fight missions.\n1.2 Innovative Solution ATC-NY will develop SSKN, an interactive KG editing tool designed to streamline ongoing review and exploitation of structured knowledge after its initial collection using automated KG engines.\nSSKN empowers data scientists, analysts, and other stakeholders and decision-makers to receive daily updates about situational understanding that incorporate the latest data and intelligence.\nUsers can then quickly apply their corrections, which are synchronized and shared across the user community.\nSSKN remembers the policies and trends applied by users, as integrated with evidence- based changes, building a trusted reasoning network that helps automate future updates and reduce the time required to exploit all available knowledge.\nThe first key innovation of SSKN is the incorporation of PGMs aligned with dynamic KG entities to enable evidence-based reasoning when performing and propagating updates to knowledge based on new data or user changes.\nThe PGM reflects the consensus of update strategies performed across the user community.\nThe second key innovation of SSKN is the use of our proven, AI-driven data cleaning technology, as developed and demonstrated for the Army in our Data Refinery for Aviation Sustainment (DRAS) software, to detect and correct noise in the data sources being used to generate and update KGs.\nThis enables preemptively eliminating potential sources of noise upstream in the KG pipeline, thereby reducing the analysis burden during daily revisions and reviews.\nAs displayed in Figure 1, the SSKN software system consists of four main components, and associated supporting subsystems: the Knowledge Interface, Graph Updater, Probabilistic Dynamic Graphs (PDGs), and the third-party IE and AI engines that generate graph data structures based on data sources.\nThe Knowledge Interface is the graphical user interface that facilitates all user interactions with KGs and the associated corpus-level knowledge elements, data sources, schemas, update strategies, discovery recommendations, and user preferences.\nThe Knowledge Interface provides an integrated knowledge exploitation environment with all the useful exploration and editing capabilities of existing KG tools, such as the Advanced Text Exploitation Assistant (ATEA) that was previously developed for Air Force analysis workflows.\nThe SSKN user interface will also deliver new views for interacting with its innovative features, including manipulatable representations of PDGs showing the alignment of the KGs and corresponding Bayesian networks with the accumulated reasoning for automated updates.\nAnother Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n2",
        "10": "ATC-NY AF244-0001 F244-0001-0059 view will highlight the daily graph revisions, with links to the source document, image, and video evidence, as well as any user-applied changes.\nThe knowledge discovery view will indicate unexplored segments of the KG that match criteria indicating they may be useful for current investigation and data collection tasks, as well as missing entity and relationship attributes that were not able to be derived automatically.\nUser Data Sources Synchronized Statistical Knowledge Network (SSKN) Knowledge Interface Graph Updater KG, PGM, and Graph Alignment Engines PDGs Hypothesis Engine Domain Knowledge Templates Graph Cleaning Models Legend SSKN Component SSKN Dependency User/Inputs Figure 1.\nSSKN updates KGs based on daily or weekly data collections and synchronizes user feedback across the knowledge corpus.\nSSKN also stores the expert insights associated with user interactions to automatically apply similar changes to future data.\nThe Knowledge Interface enables users to add new data sources, select and configure their preferred KG engine and analysis pipeline implementations, and edit any aspect of the PDGs.\nFor example, an analyst can define new entity and relationship types to accommodate discoveries uncovered from the latest intelligence sources, and SSKN will automatically learn and apply the expert-defined knowledge capture behaviors for these elements over time.\nThe Graph Updater employs multiple subsystems, which each contribute critical functionality that the Updater coordinates to produce consolidated daily KG updates.\nIt provides the latest PDGs and a common operating picture based on user feedback received from the Knowledge Interface.\nContributing subsystems include third-party KG and PGM software, which analyze and extract knowledge from databases, documents, images, videos, and other data sources to create imperfect and untrusted knowledge graphs, ontologies, and Bayesian networks.\nThe Graph Updater utilizes external graph alignment tools to efficiently merge multiple KGs or PGMs together.\nThis functionality is used to incorporate the KGs and PGMs created from a daily data collection and user review into existing PDGs.\nThese capabilities will be designed as extensible plugin tools, similar to the ATEA architecture, so different third-party implementations can be integrated based on each organization’s needs and as new, improved technologies become available.\nThe Graph Updater invokes the Hypothesis Engine to automatically explore the daily KG changes indicated by the third-party IE and AI pipeline, ensuring that user-defined entity and relationship attributes and patterns are maintained in the resulting graph.\nThis is accomplished by applying the statistical relationships that have been established in the PDGs, starting at affected nodes in the KG Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n3",
        "11": "ATC-NY AF244-0001 F244-0001-0059 and evaluating joint probabilities for the new graph structure based on corresponding random variables in the Bayesian network.\nThe Hypothesis Engine also enables knowledge discovery recommendations by performing the reverse operation, namely finding high-probability graph states associated with unexplored segments, missing attributes, and previous user actions.\nThe Graph Cleaning Models represent our proven noise detection and reduction models, which we will apply to clean the noisy data sources before they are analyzed by KG engines.\nThese data cleaning models provide several data enhancement capabilities specifically designed to improve the effectiveness of AI-based analysis, such as error correction, reformatting for consistent data types and value representations, and deduplication and reconciliation of redundant or conflicting entries and references.\nMultiple file and data formats are supported, including documents, forms, and spreadsheets with free text and application-specific jargon.\nDomain Knowledge Templates are formed over time based on user interactions, and can take the form of generic PGM network structures or design rules that facilitate modeling and aligning KGs as PDGs for a given application.\nThese templates guide Graph Updater operations and resolve ambiguities when different results are indicated by the contributing subsystems, such as the Hypothesis Engine and Graph Cleaning Models.\n1.3 Illustrative example of a PDG use case A simple example of a dynamic KG and aligned PGM is portrayed in Figure 2, to illustrate one possible approach for representing KG update strategies.\nIn this example, the KG is updated with recent data, resulting in new entities and relationships.\nWhile reviewing these changes, the user deletes the employs relation between Don and Cam, because Don no longer owns the company at which Cam is employed.\nThe user also adds a relation between Ellen and TikTok to indicate that they are actively using that social media service.\nThe user accepts the other automated updates as accurate, such as the new donation from Don to Ellen, after reviewing the source data on which the KG changes were based.\nDuring the review process, the SSKN system updates the PGM for this PDG, shown in the figure as a Bayesian network, to record the observation that selling a company entails removing employment relationships to its employees.\nThe variables related to social media are also updated based on the observation that reaching a certain level of involvement on a given platform, as indicated by attributes such as recent post frequency and number of followers, reflect that the user is active on that platform.\nThere could be analogous observations leading to other statuses, such as being a social media influencer.\nThis scenario is meant to show just one example approach and indicate the potential usefulness of the PDG concept.\nWe will experiment with multiple different representations and modeling approaches during the PDG design process.\nIn this way, SSKN provides dynamic and interactive KG capabilities for Air Force, other DoD, and enterprise communities to apply up-to-date knowledge and make informed decisions in time- constrained situations.\nThe SSKN graphical interface enables users to intuitively explore, update, and query PDGs with state-of-the-art visualization techniques delivered via any web browser, and receive graph updates and knowledge-gathering recommendations in real time.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n4",
        "12": "ATC-NY AF244-0001 F244-0001-0059 Dynamic Knowledge Graph (simple example) Updated Dynamic Knowledge Graph Spouses (married 4/1/2019 in Cancun) Spouses (married 4/1/2019 in Cancun) Alice Bob Update Alice Bob Parent Parent Parent Parent Follows (on X, TikTok) Cam Don Ellen TikTok Cam X Don Ellen TikTok Works at Employs (hired 2022) Owns Acme Co.\nDonated to (2023 Sherriff election, $25) Has account Works at Acme Co.\nSold Owns Spishak Inc.\nActive on Donated to (2023 Sherriff election, $25; 2024 Sherriff election, $50) Probabilistic Graphical Model (captures user actions and associated evidence) Employs Person Company Sells Follower Count Post Frequency Has account Active on Social Media Figure 2.\nA simple example of a dynamic KG update, showing one approach for modeling graph update strategies based on user interactions and relevant evidence to enable improved automated KG updates for future data collections.\n1.4 Qualifications of the Research Team The ATC-NY team has a solid record conducting successful advanced research and development for DoD agencies, including the Air Force, Army, and Navy.\nWe have a collection of skills well-suited to successfully developing SSKN.\nIn particular, our researchers have experience with graphical models, Bayesian inference, Large Language Models, other machine learning and artificial intelligence methodologies including resource-constrained and embedded modeling applications, as well as scalable data analysis pipelines and high-performance computing systems and workflows.\nWe also have extensive experience with information management systems, geospatial video and image datasets, and metadata processing, as well as knowledge discovery techniques, including the Resource Description Framework (RDF), embedding, and graph-based representations.\nOur team has demonstrated success with rapid prototyping and application development, enabling us to produce demonstrable proof-of-concept prototypes early in the project.\nATC-NY has a strong commercialization record and the ability to produce, market, and distribute software products to a variety of customers.\n2 Phase I Technical Objectives SSKN is an intuitive, interactive knowledge exploitation tool that automatically synchronizes the latest data and intelligence sources, as well as user feedback, into the dynamic KGs to facilitate fast- paced decision making based on evidence and relevant context.\nThe primary goal of the Phase I effort is to demonstrate the feasibility of the SSKN concept and lay the groundwork for prototype development during Phase II.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n5",
        "13": "ATC-NY AF244-0001 F244-0001-0059 2.1 System Requirements An automated, interactive knowledge management tool for continuously updating, improving, and delivering situational understanding, such as SSKN, must meet the following technical requirements: • Enable users to interact with a dynamic knowledge graph that represents up-to-date information • Suggest changes to KG based on input from users and data sources to support faster, more effective situational awareness, pattern of life analysis, threat detection, and targeting operations in time-constrained environments • Maintain or enhance existing KG capabilities, including visualization and query functions 2.2 Requirements Roadmap The following table illustrates how SSKN meets each of the requirements listed in Section 2.1 and indicates in which section(s) the requirement is addressed.\nRequirement Solution Enable users to interact with a dynamic knowledge graph that represents up-to-date information The SSKN Graph Updater and Knowledge Interface utilize Probabilistic Dynamic Graphs (PDGs), which combine logical and statistical relations between entities, to empower users and reduce manual effort for reviewing and exploiting automatically generated KGs, which are imperfect and untrusted in their as-generated form.\nSection(s) 3.2.1, 3.2.2, 3.2.3 Suggest changes to KG based on input from users and data sources to support faster, more effective situational awareness, pattern of life analysis, threat detection, and targeting operations in time- constrained environments The SSKN Graph Updater applies data cleaning models to reduce noise in the data sources, then state-of-the-art KG engines and graph alignment tools are run as extensible plugins to create and update the unverified KGs.\nSSKN then applies the Hypothesis Engine and Domain Templates to automatically correct known issues in the raw KG and then present these updated KGs to users for daily or weekly review and synchronization with corpus-level PDGs.\nMaintain or enhance existing KG capabilities, including visualization and query functions The SSKN Knowledge Interface provides an integrated graphical user interface with all the views found useful by Air Force users in past KG exploitation tools.\nSSKN also adds new editing and discovery views related to its PDGs and daily KG updates.\n3.2.3, 3.2.4, 3.2.5 3.2.6, 3.2.7 2.3 Enumerated Technical Objectives In order to prove the feasibility of the SSKN concept and demonstrate its applicability and effectiveness as a dynamic Knowledge Graph solution, ATC-NY will accomplish the following technical objectives: 1.\nDetermine most effective KG engine, pipeline, graphs, and datasets for developing SSKN.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n6",
        "14": "ATC-NY AF244-0001 F244-0001-0059 2.\nDesign the Probabilistic Dynamic Graph (PDG) representation for knowledge in SSKN.\n3.\nCreate methods for generating and testing hypotheses based on domain knowledge to update and assess graphs in response to new data and user feedback.\n4.\nAdapt processes from our DRAS data cleaning technology to verify, deduplicate, and improve accuracy of KGs through ongoing updates.\n5.\nEstablish techniques to apply the results of hypothesis testing, knowledge gap analysis, and data cleaning as a holistic, consistent KG state.\n6.\nDevelop an MVP user interface to perform a representative set of updates and interact with PDGs.\n7.\nSet up a proof-of-concept demonstration combining the above capabilities, and measure its baseline performance using key accuracy, completeness, and resource utilization metrics.\nThe core challenge of Phase I is demonstrating that our approach of incorporating PGMs and adapting data cleaning methods to graphical information can efficiently process relevant data sources, graphs, and user actions, in order to enable USAF personnel to effectively understand operational scenarios and make informed decisions at mission pace.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n7",
        "15": "ATC-NY AF244-0001 F244-0001-0059 3 Phase I Statement of Work (including Subcontractors’ Efforts) This section describes the tasks, schedule, and deliverables necessary to meet the technical objectives and prove the feasibility of the SSKN approach.\n3.1 Phase I Statement of Work Outline This section serves as the initial draft of the Phase I Statement of Work (SOW).\nThe SOW contains no proprietary information.\n3.1.1 Scope The scope of this effort is to design, develop, and demonstrate a proof-of-concept prototype for SSKN, an interactive, automated knowledge graph updating, improvement, and intelligence- gathering recommendation system.\nThe primary goal of the Phase I work is to develop a proof- of-concept implementation and demonstration of SSKN.\nThe secondary goals of the Phase I work are to develop a detailed system architecture and implementation plan and to lay the groundwork for Phase II development.\n3.1.2 Task Outline The Phase I work consists of seven technical tasks and one management task.\nThe work will be carried out at the ATC-NY office in Ithaca, NY, and the Architecture Technology Corporation (ATCorp) office in Campbell, CA.\nThe tasks are described in detail in the following sections.\n3.1.2.1 Task 1: Evaluate and select KG engine, pipeline, datasets, and models The ATC-NY team will determine the existing open-source and publicly available Information Extraction (IE) and Artificial Intelligence (AI) tools, as well as benchmark datasets and KG models that are best suited for developing and demonstrating the SSKN concept.\n3.1.2.2 Task 2: Design the Probabilistic Dynamic Graph (PDG) knowledge representation The ATC-NY team will determine the specific data structures, modeling techniques, and processes required to establish and update a Probabilistic Graphical Model (PGM) alongside a KG, such that the random variables and dependencies in the PGM align with corresponding elements of the KG.\n3.1.2.3 Task 3: Create initial hypothesis engine The ATC-NY team will develop automated procedures to verify and validate a set of KG changes representing a daily update produced by a KG engine.\n3.1.2.4 Task 4: Adapt data cleaning models for noisy graph data sources The ATC-NY team will update the noise detection and correction models from our DRAS technology to operate effectively for KG data sources.\n3.1.2.5 Task 5: Develop initial graph updater The ATC-NY team will build and test the graph update procedures, which orchestrate and merge the results of the data collection, data cleaning, KG revision, and hypothesis engine-based verification and recommendation analysis steps.\n8",
        "16": "ATC-NY AF244-0001 F244-0001-0059 3.1.2.6 Task 6: Build MVP user interface and associated knowledge update actions The ATC-NY team will design and implement a Minimum Viable Product (MVP) form of the SSKN Knowledge Interface, including the graphical user interface and associated user interaction capabilities.\n3.1.2.7 Task 7: Develop proof-of-concept demonstration The ATC-NY team will build and demonstrate a proof-of concept implementation of the SSKN application.\nThe SSKN demonstration will combine the initial components developed in the previous tasks to show an example end-to-end daily KG update and user review process.\n3.1.2.8 Task 8: Manage, document, and report The ATC-NY team will prepare a final report describing the results of the work of the project and submit monthly status reports on project progress.\nIn addition, ATC-NY will prepare briefings for a kickoff meeting in the first month of the effort and to support the proof-of-concept demonstration at the conclusion of the Phase I effort.\n3.1.3 Milestone Schedule Task Month 1 2 3 4 5 6 1.\nEvaluate and select KG engine, pipeline, and datasets 2.\nDesign Probabilistic Dynamic Graphs (PDGs) 3.\nCreate initial hypothesis engine 4.\nAdapt data cleaning models for noisy data sources 5.\nDevelop initial graph updater 6.\nBuild MVP user interface 7.\nDevelop proof-of-concept demonstration 8.\nManage, document, and report Deliverables Kickoff Meeting and Technical Review Monthly Status Reports Proof-of-Concept Demonstration Final Report 3.1.4 Deliverables ATC-NY will deliver: • Kickoff meeting within 30 days of contract start • Monthly progress reports, including discussion of technical tradeoffs and risk mitigation • Technical review within 6 months • Final report with SF 298 and feasibility study results • Proof-of-concept demonstration 9",
        "17": "ATC-NY AF244-0001 F244-0001-0059 3.2 Detailed Task Outline To meet the technical objectives defined in Section 2.3, the Phase I work consists of seven technical tasks and one management task as shown in the schedule in Section 3.1.3.\nThe work will be carried out at the ATC-NY location in Ithaca, NY and the Architecture Technology Corporation (ATCorp) office in Campbell, CA.\nThe tasks are described in detail in the following sections.\n3.2.1 Task 1: Evaluate and select KG engine, pipeline, datasets, and models During this task we will determine the IE and AI tools that are best suited for developing and demonstrating the SSKN concept.\nWe will consider open-source KG construction tools that support extraction from heterogeneous and multimodal data sources, particularly generative KG pipelines that have performed well in recent challenges and competitions within the research community.\nWe will consider popular and effective KG engines, such as the Knowledge Graph Toolkit1, Morph- KGC2, Dipper3, and LibKGE4.\nOther supporting functionality will be used as needed, such as the KG exchange (KGX) 5, which provides a command line utility to convert KGs between a variety of standard knowledge representations, including Resource Description Framework (RDF), Neo4j, TSV, Reasoner Standard API, and OBOGraph.\nEmerging KG engines also support the creation of incremental changes in KGs, so the entire graph need not be reconstructed with each update.\nThis capability is especially relevant for dynamic KGs.\nThe Incremental RDF Mapping Language (IncRML) is an example of such a system.\nIncRML combines RML and Function Ontology (FnO) to produce a Linked Data Event Stream (LDES) representing recent changes in monitored data sources.6 We will also review the available KGs and associated data sources to identify open-source and publicly available datasets and models that are representative of Air Force use cases, such as datasets containing multiple types of documents and imagery.\nIn addition, the KG must be large enough such that it cannot be directly explored or easily understood from a single visualization or perspective – in other words, relatively large KGs are more relevant.\nWe plan to select KGs based on both RDF and Labeled Property Graph (LPG) representations, to ensure that the PDG, hypothesis engine, and data cleaning functionalities are flexible and applicable to a range of KG formats.\nWe will also use both domain graphs and lexical graphs to develop and test SSKN, which will verify that the editing and updating operations are generalizable across different organizations of knowledge elements.\nSome examples of KGs and associated knowledge bases that we plan to include in our selection process are DBpedia7, YAGO, WordNet, OpenCyc, IMDb KG8, and KBpedia9.\nWe will also incorporate dynamic KG benchmarks that include evolving knowledge states and event sequences that must be accurately reflected in iterative KG updates.\nExamples of dynamic KG datasets are 1 https://github.com/usc-isi-i2/kgtk/ 2 https://github.com/morph-kgc/morph-kgc/ 3 https://github.com/monarch-initiative/dipper 4 https://github.com/uma-pi1/kge 5 https://github.com/biolink/kgx 6 https://semantic-web-journal.net/content/incrml-incremental-knowledge-graph-construction-heterogeneous-data- sources 7 https://www.dbpedia.org/resources/knowledge-graphs/ 8 https://blog.diffbot.com/knowledge-graph-glossary/open-source-knowledge-graphs/ 9 https://kbpedia.org/knowledge-graph/ Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n10",
        "18": "ATC-NY AF244-0001 F244-0001-0059 GTFS-Madrid-Bench10, which can be used to represent different timeframes for real data from the public transport domain in Madrid, and the real-world data sources used for the IncRML work (bike- sharing, transport timetables, weather, and geographical data)6.\nThese data sources are convenient because there are open-source KG engines and associated graphs that were constructed using these datasets as part of the Knowledge Graph Construction Workshop 2024 Challenge (KGCW2024 Challenge)11.\nImportantly, all of these KG construction tools, datasets, and KGs are imperfect and produce or contain realistic mistakes and missing information.\nFurther, the benchmark datasets and KGs provide ground truth information about errors and inconsistencies, which enable assessment of accuracy and completeness for a given set of KG modifications.\nHence, we can readily evaluate our approach’s capabilities for facilitating user interactions to correct these issues, as well as SSKN’s ability to learn the reasoning behind manual corrections and to propagate their effects across the knowledge corpus to maintain semantic consistency.\nThe result of this task will be a representative set of open-source KG construction tools, benchmark data sources, and KGs created using these resources, including dynamic KGs reflecting multiple checkpoints or evolutions in knowledge states.\nThese will enable effective development and demonstration of the SSKN proof-of-concept components during Phase I work.\n3.2.2 Task 2: Design the Probabilistic Dynamic Graph (PDG) knowledge representation For this task we will determine the specific data structures, modeling techniques, and processes required to establish and update a Probabilistic Graphical Model (PGM) alongside a KG, such that the random variables and dependencies in the PGM align with corresponding elements of the KG.\nThe PGM will be designed to represent the statistical trends and patterns that emerge from daily or weekly KG updates, both due to new evidence extracted from data sources, as well as user-initiated changes to entities, relationships, and underlying schemas and nomenclatures.\nIn this way, the PGM will learn KG update strategies based on the group consensus of the user community, where these strategies reflect the reasoning entailed in KG modifications, as supported by the knowledge elements collected at that time.\nDepending on the KG format and representation, it may be helpful to solicit additional information from the user for each change they make to the KG during their daily or weekly review process.\nThis information can be used to more accurately record the justifications for KG modifications, and to isolate the nature of the error in the automatically generated KG that necessitated manual correction, which can facilitate improved automated updates over time.\nAs part of the PDG design process, we will identify the types of user input that are needed, if any, for the PGM component to fulfill its role in the SSKN concept.\nWe anticipate that a Bayesian network model will serve as an effective implementation of the PGM for our PDG design.\nBayesian networks provide a flexible, expressive, and powerful reasoning framework for graphical relationships, including the capability to compute joint probabilities for any combination of connected random variables in the network.\nThey also support inference with incomplete evidence, which we expect will be valuable for dynamic KG applications.\nThe ATC-NY team has extensive experience working with Bayesian networks and the Bayes Server software 12, which we will take advantage of during this effort.\nWe plan to utilize the automated structure 10 https://github.com/oeg-upm/gtfs-bench 11 https://kg-construct.github.io/workshop/2024/challenge.html 12 https://www.bayesserver.com/ Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n11",
        "19": "ATC-NY AF244-0001 F244-0001-0059 learning features available in Bayes Server and other tools13, along with learning mechanisms that we will develop leveraging KG resources, to facilitate semi-automated instantiation and revision of PGMs for selected data sources.\nThe result of this task will be a complete PDG design that has been evaluated and verified with representative KGs and data sources, which we will employ for the proof-of-concept SSKN implementation and feasibility demonstration.\n3.2.3 Task 3: Create initial hypothesis engine During this task we will develop automated procedures to verify and validate a set of KG changes representing a daily update produced by a KG engine.\nThe hypothesis engine will be built to make correction recommendations as needed to resolve any observed deviations from the learned update strategies recorded in the PDG.\nIn particular, the PGM, such as a Bayesian network, will be used to compute a series of joint probabilities and infer the likelihood of the associated entity and relationship changes in the corresponding KG of the PDG.\nHighly unlikely configurations will be flagged, and more probable configurations that are consistent with prior user guidance and KG updates can be indicated for recommendation during the user review process.\nIn the event that new entities, relationships, or attributes are introduced in a KG update, the hypothesis engine can attempt to match these with similar domain knowledge templates, as available, to enable validation and recommendation of possible corrections.\nIf no similar templates are available, these new knowledge elements can be marked as unverified and the subsequent user feedback will be used to learn update strategies and associated PDG and template assets for future updates.\nThe result of this task will be an initial implementation of the hypothesis engine component of the SSKN proof-of-concept prototype.\n3.2.4 Task 4: Adapt data cleaning models for noisy graph data sources The focus of this task will be updating the noise detection and correction models from our DRAS technology to operate effectively for KG data sources.\nWe will select a subset of the collection of DRAS data cleaning models to update and demonstrate for the Phase I proof-of-concept, such as the intra-row and inter-row noise models.\nWe will then fine-tune these models using a portion of the KG data sources identified during Task 1 as a training and validation dataset.\nFinally, we will assess the effectiveness of the data cleaning capabilities by comparing the accuracy and completeness of KGs constructed using a held-out test dataset from the benchmark data sources, with and without applying the data cleaning model predictions.\nWe will iteratively update the model architectures and fine-tuning processes as needed to find a data cleaning methodology that improves KG construction performance for a representative set of test cases.\nThe result of this task will be an initial set of data cleaning models that have been shown to enable enhanced graph accuracy and completeness, thereby reducing the downstream burden on users to review and correct automatically generated KGs.\n3.2.5 Task 5: Develop initial graph updater During this task we will build and test the graph update procedures, which orchestrate and merge the results of the data collection, data cleaning, KG revision, and hypothesis engine-based verification 13 https://www.bayesserver.com/docs/learning/structural-learning/ Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n12",
        "20": "ATC-NY AF244-0001 F244-0001-0059 and recommendation analysis steps.\nThe graph updater will be designed to operate on the dynamic KG after its initial creation using the KG construction pipeline determined in Task 1.\nThe graph updater initiates and manages the daily updates to the dynamic KG based on recent data and user feedback.\nThe bulk of the work will involve determining an efficient and effective process for the KG revision step.\nWe plan to use existing, open-source KG tools and methodologies to accomplish this, especially the dynamic KG capabilities discussed in the Task 1 description.\nIn particular, we anticipate that the LDES format will be an efficient method of representing and analyzing the dynamic graph updates, because it is designed for expressing incremental, frequent changes in KGs and their data sources.\nWe also plan to evaluate and compare state-of-the-art graph modification techniques, such as IncRML and the DINGAL-O and DINGAL-U dynamic graph alignment algorithms, to find the best performing option for generating the daily LDES from the cleaned, collected data sources.\nWe will ensure the graph update process formats and connects the inputs and outputs of each of the steps to interoperate robustly and produce the desired overall PDG changes, so that they facilitate users to edit and exploit the automatically extracted dynamic KG.\nThe result of this task will be an initial implementation of the graph updater component of the SSNN proof-of-concept prototype.\n3.2.6 Task 6: Build MVP user interface and associated knowledge update actions In this task we will design and implement a Minimum Viable Product (MVP) form of the SSKN Knowledge Interface, including the graphical user interface and associate user interaction capabilities.\nThe key functionalities will be developed and tested, including KG visualization and exploration views, with traceability to the associated data sources, as well as the daily KG update and review display, which enables the user to check automated KG changes and edit them as needed.\nThe daily update and review display is a new interface unique to the SSKN system, so this will be the focus of our proof-of-concept development for the Knowledge Interface.\nThe KG updates will be displayed in a way that clearly shows the changes since the previous update and their context within the overall knowledge corpus.\nWe will experiment with different portrayals of the Graph Updater results, including the outcomes of the verification and recommendation analyses, and select the most intuitive and user-friendly approach.\nFor example, we can color-code, shade, or apply line and fill patterns to visually indicate detected inconsistencies based on their computed likelihood, which the user can then select to view the recommended KG corrections.\nThe user editing interactions will be based on the descriptions provided for the ATEA software, including capabilities to relabel entities, relationships, and attributes, as well as to consolidate corpus-level coreferences.\nWe will create mouse-click and key-combination commands to perform additional KG modifications, such as editing the underlying schema to create new entities and relationships.\nAll user interactions will be captured and applied in future updates by modifying the PDG with the associated KG and PGM changes.\nThe Graph Updater will synchronize user changes across the knowledge corpus by invoking the Hypothesis Engine to ensure all affected elements are updated and consistent with learned strategies.\nBased on user preferences, these synchronization actions can either be applied automatically and logged, or they can be presented to the user for review and approval as a confirmation step while they are performing an edit to the KG.\nWe plan to use existing, open-source KG visualization, exploration, and querying capabilities wherever possible to reduce effort for this task and avoid “reinventing the wheel”.\nFor example, we Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n13",
        "21": "ATC-NY AF244-0001 F244-0001-0059 will consider using libraries such as the LinkedDataHub (LDH)14, which are designed for creating KG applications and visualization tools.\nThe LDH provides a web-based HTTP API and data-driven architecture, which facilitate rapid prototyping and would serve as a convenient, flexible user interface development platform for Phase I feasibility demonstration.\nThe result of this task will be an MVP implementation of the SSKN Knowledge Interface that has been tested with representative data sources, KGs, and dynamic KG updates based on capabilities developed in the previous tasks.\n3.2.7 Task 7: Develop proof-of-concept demonstration In this task, we will build and demonstrate a proof-of concept implementation of the SSKN application.\nThe SSKN demonstration will combine the initial components developed in the previous tasks to show an example end-to-end daily KG update and user review process.\nA test dataset will be identified and used for the demonstration, which the SSNK system has not previously encountered.\nThis will ensure that the SSNK capabilities generalize well and can handle new information.\nThe demonstration will employ the Knowledge Interface to display the KG and PDG for the initial state, and then the daily update and review display will alert the user that new data has been collected and changes to the dynamic KG are indicated.\nThe user in the demonstration will then review the automated KG updates and apply any desired corrections.\nFinally, the Graph Updater will be demonstrated to properly synchronize user corrections across the KG to ensure consistency with the underlying schema and an example learned update strategy.\nWe will repeat the demonstration with additional test data collections as requested by the customer, to ensure SSKN can handle all data and KG formats of interest.\nAs part of the evaluation process, we will define and measure baseline performance metrics, including graph accuracy and completeness, knowledge gap detection rate, and computing and resource utilization efficiencies.\nWe will use existing open-source benchmarking tools as available to measure performance metrics, such as the KROWN data generator and execution framework.15 This proof-of-concept system will demonstrate the feasibility of the SSKN approach and ATC-NY’s ability to implement the proposed concept.\n3.2.8 Task 8: Manage, document, and report We will prepare a final report describing the results of the work of the project and submit monthly status reports on project progress.\nIn addition, we will prepare briefings for a kickoff meeting in the first month of the effort and to support the proof-of-concept demonstration at the conclusion of the Phase I effort.\n4 Related Work In the following section, we discuss past work performed by ATC-NY relevant to the SSKN project.\n4.1 Related Work by Proposing Team ATC-NY has over 40 years of experience developing information management, machine learning, and computer and network security software solutions for military and government customers.\nSSKN will benefit from ATC-NY’s extensive experience in ML/AI, data analytics, visualization, 14 https://github.com/AtomGraph/LinkedDataHub 15 https://github.com/kg-construct/krown Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n14",
        "22": "ATC-NY AF244-0001 F244-0001-0059 information and knowledge management, graphical interface design, system integration, and rapid, resource-constrained computing in tactical and anti-access operating environments.\nIn this section, we describe a select few projects that demonstrate our relevant experience and expertise.\nThe proposed PI and supporting subcontract staff were machine learning SMEs for DRAS.\nDRAS demonstrates our existing technology for noise detection and data cleaning to improve AI modeling and real-world analysis workflows.\nData Refinery for Aviation Sustainment (DRAS): The effectiveness and utility of algorithms and models used by the Army in support of Condition Based Maintenance (CBM+) are limited by noise in the source data.\nTools and methods need to be developed and applied to reduce the noise in the source data.\nThe solution needs to provide clean, relevant, and consistent data that increases the timeliness and effectiveness of the CBM+ analytical tools, algorithms, and models.\nDRAS applies methods and techniques from statistics, data science, data modeling and data management to refine the source data prior to its use in algorithms and models for sustainment.\nDRAS characterizes the causes and types of noise in the source data, and then applies the appropriate methods to effectively filter this noise from the data while maintaining the integrity of the data itself.\nNoise in the CBM source data can be caused by factors ranging from erroneous sensor data to simple data entry or transcription errors.\nDRAS automatically detects and removes errors and inconsistencies in the source data, and identifies and applies methods to optimize data generated from multiple sources including small sample sizes.\n(Army SBIR Phase II completed: 8/2/2022.\nContact: Jessica Glover, Lead General Engineer, Redstone Arsenal; jessica.t.glover.civ@mail.mil, 256-876-2781.) The proposed subcontract staff person was the PI for IWUCT, which demonstrates our ability to detect and correct errors in free text and natural language descriptions using AI analytics.\nIdeal Work Unit Code Tool (IWUCT): ATCorp developed the IWUCT module to help the Air Force RSO transition from reactive maintenance to predictive maintenance by improving the effectiveness and utility of predictive maintenance tools.\nFor the Air Force Condition Based Maintenance Plus (CBM+) program, the use of ML/AI has enabled the Air Force to improve maintenance data quality and evaluate large sets of aircraft sensor data and maintenance history to predict component failures.\nDeveloping IWUCT involved applying Natural Language Processing (NLP) models and building a proof-of-concept prototype in order to process varied maintenance data and standardize it by suggesting an ideal WUC.\nIWUCT includes a text classifier and corresponding GUI that outputs WUCs from unstructured text data inputs.\nThe GUI was built to be flexible enough to output an adjustable number of WUCs in a list in order to provide an option of choosing a WUC if manual input for WUC selection was still desired by the end users.\nIn situations where a very high level of accuracy would be valued above complete automation, the option of manually choosing a WUC from a short list would provide that level of accuracy while still significantly speeding up the WUC selection process.\nThe size of the neural network model (i.e., the set of parameters that need to be saved for later use) that was trained was well within the limits of what is reasonable for any modern machine, including hand-held devices, while processing a single text sample using the IWUCT GUI took a fraction of a second.\n(Air Force SBIR Phase I completed: 6/11/2021.\nContact: George Sarmiento, Air Force Rapid Sustainment Office, george.sarmiento.1@us.af.mil, 937-823- 1807.) The proposed PI was the machine learning SME for PARC.\nPARC demonstrates our experience applying probabilistic graphical models and Bayesian statistical methods to accurately and efficiently characterize and forecast complex system behaviors, namely large airport traffic patterns and flight operations.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n15",
        "23": "ATC-NY AF244-0001 F244-0001-0059 Predictor of Airport Runway Capacity (PARC): PARC is a decision support tool for air traffic managers to estimate the near-term arrival-departure capacity of an airport for traffic planning and control.\nPARC processes and fuses multiple, disparate data sources describing an airport’s historical traffic movements, operating conditions, operating procedures, time intervals between successive airport takeoffs and landings and geospatial data to generate multi-feature data sets for modeling.\nPARC applies data sampling to reduce quantities of data, and standard data partitioning for model training and validation.\nPARC utilizes Bayes Server to construct Bayesian network statistical models of the joint probability of the airport and traffic variables.\nPARC uses the models in Monte-Carlo simulations of airport arrival-departure traffic to obtain a distribution of possible capacities, and estimates a target capacity from the distribution.\nPARC presents the estimated airport arrival and departure capacities to air traffic controllers for traffic planning and management.\n(NASA SBIR Phase II completed: 4/29/2020.\nContact: Gary Lohr, NASA Langley Research Center, gary.lohr@nasa.gov, 757-864-2020.) The ARCA project shows our expertise in using graphical models, advanced data processing, and statical analysis to predict threats and rare events in practical, enterprise-scale data flows and operating conditions.\nAutomated Real-time Clearance Analyzer (ARCA): ARCA automates safety assessment of air traffic control (ATC) decisions and can operate orders of magnitude faster (and on a wider range of information) than a human.\nARCA’s core algorithms mirror human safety assessments so that decision analyses are comprehendible on inspection and can be calibrated with experience and observation.\nFurthermore, ARCA archives operational data as it operates in the field, giving it increasingly better information from which to learn and make increasingly more accurate safety assessments.\nARCA uses a Bayesian network to determine the estimated probabilities of incidents and accidents.\nARCA’s operational safety assessments are objectively linked to hard data.\nAs in any estimation (human or automated), there are always uncertainties.\nHowever, ARCA does not rely on any heuristics or subjective integration algorithms.\nThe assessments it produces are objective and quantitatively defensible based on its growing archive of operational information.\nThis is a highly desirable characteristic of trusted automation.\nHuman control remains a critical element of aviation operations because of the difficulty of implementing flexible, trustworthy autonomy that can process real-world safety decisions.\nARCA is designed to meet this need.\n(NASA SBIR Phase II completed: 4/13/2019.\nContact: Nikunj Oza, NASA Ames, Nikunj.c.oza@nasa.gov, 650-604-2978.) The proposed PI was the machine learning SME for CAJ.\nCAJ demonstrates our expertise with automatically organizing, cataloging, and visualizing complex analytical tasks and associated evidence chains for lookback and knowledge retrieval.\nCyber Analyst Journal (CAJ): ATC-NY developed CAJ, a cloud-based Cyber Analyst Journal that supports automated tagging, searching, and archiving.\nCAJ uses open-source software that is prepared for private cloud hosting to add smart-tagging features to uploaded screen shots of analysis tools in order to streamline the investigative process of Publicly Available Information (PAI).\nInformation environment analysts employ various tools to perform investigations into threats, narratives, propaganda along with other information environment topics.\nCurrently analysts do not have any means of recording the steps they take during their investigations that show how they came to logical conclusions.\nCAJ addresses this unsolved challenge by customizing and enhancing an existing open-source collaboration suite and adding semi-automated tagging and enhanced searching capabilities.\nUtilizing Optical Character Recognition (OCR) and efficient image processing algorithms, CAJ is able to extract text from screen shots of data analysis tools uploaded by analysts to apply the appropriate tags to the image and store that image with tags in a timeline of events for Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n16",
        "24": "ATC-NY AF244-0001 F244-0001-0059 better look-back capabilities.\nCAJ is composed of two parts: the user interface that analysts interact with, and the OCR engine that pulls text from the uploaded screen shots and associates them with the images.\nThese features will provide analysts with a streamlined process for recording the notes and observations during their investigations.\n(Navy SBIR Phase I completed: 4/19/2022.\nContact: Rebecca Goolsby, Navy, rebecca.goolsby@navy.mil, 571-314-2331.) The proposed PI was the Principal Investigator for the WHAM project.\nWHAM enables Defense Logistics Agency warehouses to identify processes and procedures that can be changed to optimize warehouse production, demonstrating ATC-NY’s experience with Predictive Analytics, ML, and big data.\nWarehouse Artificial Intelligence for Management (WHAM): Defense Logistics Agency operations can significantly benefit from Predictive Analytics (PA) harnessing Artificial Intelligence (AI) technologies.\nEffective use of AI requires system-of-systems integration, online training of models and predictions, and trust-able and scalable machine learning methods for reliable system behavior.\nWHAM is an AI-based decision support tool that coordinates and integrates data from related systems, such as Warehouse Execution Systems (WES), Smart Warehouse systems, and human input to improve order fulfillment rates and reduce operating costs.\nWHAM's supply chain and logistics PA services address challenges in the areas of inventory management, materiel distribution, and asset visibility.\nIn the Phase I work we applied WHAM to forecast the types, quantities, and conditions of items arriving at DLA Distribution Centers (DCs), which enabled more efficient use of resources and improved order processing times.\nWHAM operates as a cloud service to deliver actionable intelligence to multiple DCs using elastically scalable deep learning and provide perspective across the organization to anticipate bottlenecks and reveal opportunities.\n(DLA SBIR Phase I completed: 3/28/2022.\nContact: Mr.\nManual Casas, DLA, manuel.casas@dla.mil.) The proposed PI was the machine learning SME for SIFT.\nSIFT uses ML for anomaly detection and is built for distributed storage and processing.\nSIFT demonstrates ATC-NY’s existing work with ML and distributed data processing to facilitate practical threat detection based on live data streams.\nScalable Incident-response and Forensics Toolkit (SIFT): ATC-NY developed SIFT, an anomaly detection software product that accommodates any scale security operation while maintaining real- time analytics that provides situational awareness and actionable advice.\nSIFT is built for distributed storage and processing to provide an extensive framework to integrate with existing and future security tools by federating disparate data sources into a unified form to search and interrogate.\nInformation security analysts are able to import data streams from sensors and tools into SIFT, putting datasets within the same context, enabling greater monitoring and investigative reports generated through advanced queries and applied rule-based and machine learning threat detection algorithms.\n(SBIR Phase I completed: 10/27/2017.\nContact: Nicholas Guinn, SOCOM, nicholas.guinn@socom.mil, 813-826-9911.) The proposed PI was the machine learning SME for the Argus project.\nArgus uses big-data machine learning techniques to autonomously analyze records of program behavior to reveal latent errors, demonstrating ATC-NY’s experience with applying ML/AI techniques to extract relevant knowledge.\nArgus: Software bugs are a significant risk to mission success and human safety.\nSoftware testing and analysis, which is used to combat bugs, is difficult, and thus time-consuming and expensive.\nIt is particularly difficult to find latent bugs-bugs that do not have obvious, observable effects on the system.\nThis results in undiscovered and unfixed bugs in the system.\nATC-NY developed Argus, an automated software testing tool that finds latent errors in a program by analyzing large amounts of Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n17",
        "25": "ATC-NY AF244-0001 F244-0001-0059 testing output.\nArgus uses a combination of Execution Driver and Instrumentation components to exercise a variety of code paths and capture the target program’s behavior.\nBig-data machine learning techniques autonomously analyze records of program behavior to find and prioritize anomalous behavior that may indicate and undiscovered software bug.\nArgus offers the capability to catch bugs with less time and cost than manual approaches.\n(Navy SBIR Phase I completed: 12/15/2018.\nContact: John Clarke, Navy, john.r.clarke@navy.mil, 202-781-3922.) ATC-NY has a successful history developing innovative knowledge management and knowledge graph solutions for Air Force applications, as reflected in our VSTaR and PMAF projects.\nVSTaR–Virtual Scalable Tactical Repository: Tactical users must have reliable access to information stored in legacy networked data repositories, which were designed years ago with disparate data formats, schemas, and semantics.\nIn order to effectively use this information, the warfighter needs agile information management—that is, that can harmonize data from a wide range of repositories and formats, both legacy and new, and do so while making effective use of dynamically varying tactical link quality and availability.\nATC-NY, in collaboration with Architecture Technology Corporation, developed a prototype Virtual Scalable Tactical Repository (VSTaR), which implements a single virtual repository with a single query language that supports quality of service (QoS) concepts.\nVSTaR is based on two core ideas.\nFirst, it is a general-purpose engine for processing queries from combinations of remote repositories.\nIt orchestrates the retrieval of data and combines the results into a unified answer.\nThe second significant feature of VSTaR is its use of the Resource Description Framework (RDF) as a basic model for data.\nRDF is a mature and standardized technology that naturally represents data as “things” and their attributes as name- value pairs; other representations, such as relational databases or XML, can be translated into this basic model and combined.\n(Completed: 7/20/2010.\nContact: Robert Flo, AFRL/RIS, 315-330-2334.) 4.2 Related Work by Others Web knowledge graphs, both free and commercial, have been created and maintained for many years.\nA few openly available knowledge graphs, such as DBpedia, YAGO, and Freebase, were largely constructed from semi-structured knowledge, such as Wikipedia, or harvested from the web with a combination of statistical and linguistic methods.\nLarge-scale knowledge graphs attempt to balance completeness and correctness.\nVarious refinement methods have been reported to infer and add missing knowledge to such graphs, as well as detect errors, which have shown to be effective for focused areas of knowledge but require significant improvement to become widely applicable.\n[1] The Air Force previously funded research and development of the Advanced Text Exploitation Assistant (ATEA), which provides an interactive KG exploration and editing tool.\nATEA was demonstrated to reduce manual effort required for Air Force analysts to perform representative tasks involving KGs, such as identifying the entities in a social network from a collection of 1,250 documents and answering 15 requests for information (RFIs) using a collection of 88 documents.\nWhile ATEA saves user changes to KGs in its database and shares updates across users, the underlying insights and reasoning behind those user modifications are not captured for future KG updates.\n[2] Many research efforts have proposed and experimented with KG visualization and exploration methodologies.\nOne such effort reported the KGBrowser, which introduced an ontology that enables the expression and publication of visual configurations, so users can reuse and share their graph visualization components across tools and environments.\n[3] Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n18",
        "26": "ATC-NY AF244-0001 F244-0001-0059 Another area of research involves knowledge graph embedding, which has mostly focused on structure-based information, but more recent research has demonstrated the successful inclusion of text-based and image-based information in entity embedding, as well as context information.\nA survey paper from 2021 summarizes growth in the field from simple translation-based models to enrichment-based models, and described the utility of KG embedding in real-world applications.\n[4] Work has been reported that trains statistical models using large knowledge graphs, which are then used to predict new facts, or edges in the associated KG.\nA review paper discusses two kinds of statistical relational models, which can both support large datasets: one based on latent feature models such as tensor factorization and multiway neural networks, and another based on mining observable patterns in the graph.\nThe authors describe how to combine these latent and observable models to improve modeling power while decreasing computational cost.\nThey propose using statistical models of graphs in conjunction with text-based information extraction methods as a means to automatically construct KGs from the Web, and they cite Google’s Knowledge Vault project as an example of such an approach.\nThis work provides evidence supporting the potential effectiveness of combining probabilistic models with KGs, similar to the PDGs in our proposed SSKN concept.\n[5] The KGScope system was reported as a mechanism to uncover and summarize insights in knowledge graphs.\nIt accomplishes this through interactive visual exploration of KGs and provides embedding- based guidance to derive insights.\nKGScope was evaluated in a study involving multiple KG usage scenarios, which showed that KGScope supported exploration of the entire network, but any insights could not readily be captured or encoded for future application.\n[6] A French research group presented Path Outlines, which is a tool for browsing path-based summaries of KGs based on coordinated views using two different visualizations.\nPath Outlines was evaluated in an experiment with 36 participants and found to enable faster and more accurate analysis task completion compared to a baseline KG visualization method.\nThe same lead researcher also investigated a graph navigation strategy that relies on aggregated path characteristics to determine the most readable representation.\nThey presented S-Paths based on this strategy, a browsing tool for linked datasets that systematically identifies the best-rated view within a given resource set, which enables flexible perspective switching by selecting different semantic paths to visualize.\nThese graph visualization techniques did not enable users to more easily modify KGs.\n[7] [8] A recent study reported a context-aware visualization recommender system (VisCARS) as a means of avoiding the need for users to manually create numerous visualizations or dashboards.\nVisCARS was shown to be able to automatically recommend a personalized dashboard to the user based on the system they are monitoring and the task they are trying to achieve.\nA knowledge graph-based approach was employed to encode expert knowledge about the data and the application, which was found to improve the recommendation process.\nThe authors presented a dashboard ontology that describes key components needed to semantically annotate the KG.\nKG embedding and comparison techniques were used, in combination with a context-aware collaborative filtering, to derive recommendations based on both the state of the monitored system and user preferences.\nThis resulted in a dynamic dashboard solution and recommender system, which was evaluated using a smart healthcare scenario and found to facilitate more effective data visualization for time-critical monitoring applications.\nThis dynamic dashboard system did not include capabilities for users to interactively update the KG.\n[9] Temporal Knowledge Graphs (TKGs) present unique constraints and requirements relating to graph modifications and user interactions.\nThe few-shot Fuzzy Temporal Knowledge Graph (FTKG) completion method was reported to predict missing facts in TKGs and overcome shortcomings in Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n19",
        "27": "ATC-NY AF244-0001 F244-0001-0059 previous related work.\nFTKG modeled fuzzy TKG information in a vector space and applied a dynamic attention neighbor aggregator and a time-aware fuzzy mapping framework for TKG completion.\nThis enabled integration of semantic information from neighborhood relations to generate fuzzy membership degrees for each temporal sample.\nFTKG also integrated an error-aware feature extractor within its meta-learning framework to address errors during the learning process.\nFTKG was found to increase performance compared to existing state-of-the-art methods across multiple few-shot TKG benchmark completion tasks.\nSuch techniques may be useful in developing SSKN and supporting automatic updates of TKGs.\n[10] Multi-modal Knowledge Graphs (MMKGs) combine a structured knowledge representation with multiple modalities.\nMMKGs represent a powerful extension of KGs, but they also introduce special considerations and remain an active area of research.\nA recent survey classified known approaches for addressing four main challenges in MMKG research – representation, fusion, alignment, and translation – which has facilitated categorization and comparison of MMKG algorithms.\n[11] Another review of MMKG publications included two task categories: KG-aware multi-modal learning tasks, such as image classification and visual question answering, and intrinsic MMKG tasks like MMKG completion and entity alignment.\nThis survey identified progress in LLM and multi- modal pre-training strategies, while concluding that significant challenges remain to be overcome for broad MMKG application.\n[12] The Multimodal Reasoning with Multimodal Knowledge Graph (MR-MKG) method was recently reported, which leveraged MMKGs to learn semantic information across modalities.\nMR-MKG was found to significantly enhance the multimodal reasoning capabilities of LLMs, even when training on only a small fraction of the LLM parameters.\nThis work indicates a large potential application area for SSKN, where dynamic KGs can enhance the performance of LLMs used in time-sensitive scenarios involving rapidly evolving information environments.\n[13] KG alignment methods are an important class of algorithms to enable accurately and automatically merging multiple KGs with potentially disparate representations for common entities and relationships into a single, consolidated KG.\nAn efficient method for KG alignment was reported that builds on Graph Convolutional Network (GCN) embedding-based alignment techniques.\nBy viewing the parameter matrix of the GCN as a feature transformation operator and decoupling the transformation process from the aggregation process, the reported dynamic graph alignment method achieved at least an order of magnitude faster performance for benchmark alignment tasks with little loss in accuracy.\nThis dynamic alignment algorithm is expected to be useful during SSKN development for achieving efficient daily KG updates.\n[14] 4.3 Bibliography [1] H.\nPaulheim, “Knowledge graph refinement: A survey of approaches and evaluation methods,” Semantic Web, vol.\n8, no.\n3, pp.\n489–508, Dec.\n2016, doi: 10.3233/SW-160218.\n[2] E.\nBudlong et al., “Interactive Information Extraction and Navigation to Enable Effective Link Analysis and Visualization of Unstructured Text,” Proc.\nAAAI Conf.\nArtif.\nIntell., vol.\n27, no.\n2, pp.\n1493–1500, Jul.\n2013, doi: 10.1609/aaai.v27i2.18988.\n[3] M.\nNečaský and Š.\nStenchlák, “Interactive and iterative visual exploration of knowledge graphs based on shareable and reusable visual configurations,” J.\nWeb Semant., vol.\n73, p.\n100713, Jul.\n2022, doi: 10.1016/j.websem.2022.100713.\n[4] S.\nChoudhary, T.\nLuthra, A.\nMittal, and R.\nSingh, “A Survey of Knowledge Graph Embedding and Their Applications,” 2021, arXiv.\ndoi: 10.48550/ARXIV.2107.07842.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n20",
        "28": "ATC-NY AF244-0001 F244-0001-0059 [5] M.\nNickel, K.\nMurphy, V.\nTresp, and E.\nGabrilovich, “A Review of Relational Machine Learning for Knowledge Graphs,” Proc.\nIEEE, vol.\n104, no.\n1, pp.\n11–33, Jan.\n2016, doi: 10.1109/JPROC.2015.2483592.\n[6] C.-W.\nH.\nYuan, T.-W.\nYu, J.-Y.\nPan, and W.-C.\nLin, “KGScope: Interactive Visual Exploration of Knowledge Graphs with Embedding-based Guidance,” IEEE Trans.\nVis.\nComput.\nGraph., pp.\n1–14, 2024, doi: 10.1109/TVCG.2024.3360690.\n[7] M.\nDestandau, O.\nCorby, J.-D.\nFekete, and A.\nGiboin, “Path Outlines: Browsing Path-Based Summaries of Knowledge Graphs,” 2020, arXiv.\ndoi: 10.48550/ARXIV.2002.09949.\n[8] M.\nDestandau, C.\nAppert, and E.\nPietriga, “S-Paths: Set-based visual exploration of linked data driven by semantic paths,” Semantic Web, vol.\n12, no.\n1, pp.\n99–116, Nov.\n2020, doi: 10.3233/SW-200383.\n[9] P.\nMoens, B.\nVolckaert, and S.\nVan Hoecke, “VisCARS: Knowledge Graph-based Context- Aware Recommender System for Time-Series Data Visualization and Monitoring Dashboards,” IEEE Trans.\nVis.\nComput.\nGraph., pp.\n1–18, 2024, doi: 10.1109/TVCG.2024.3414191.\n[10]X.\nAn, L.\nBai, L.\nZhou, and J.\nSong, “Few-shot Fuzzy Temporal Knowledge Graph Completion via Fuzzy Semantics and Dynamic Attention Network,” IEEE Trans.\nFuzzy Syst., pp.\n1–11, 2024, doi: 10.1109/TFUZZ.2024.3447003.\n[11]W.\nLiang, P.\nD.\nMeo, Y.\nTang, and J.\nZhu, “A Survey of Multi-modal Knowledge Graphs: Technologies and Trends,” ACM Comput.\nSurv., vol.\n56, no.\n11, pp.\n1–41, Nov.\n2024, doi: 10.1145/3656579.\n[12]Z.\nChen et al., “Knowledge Graphs Meet Multi-Modal Learning: A Comprehensive Survey,” 2024, arXiv.\ndoi: 10.48550/ARXIV.2402.05391.\n[13]J.\nLee, Y.\nWang, J.\nLi, and M.\nZhang, “Multimodal Reasoning with Multimodal Knowledge Graph,” 2024, arXiv.\ndoi: 10.48550/ARXIV.2406.02030.\n[14]Y.\nYan, L.\nLiu, Y.\nBan, B.\nJing, and H.\nTong, “Dynamic Knowledge Graph Alignment,” Proc.\nAAAI Conf.\nArtif.\nIntell., vol.\n35, no.\n5, pp.\n4564–4572, May 2021, doi: 10.1609/aaai.v35i5.16585.\n5 Relationship with Future Research or Research and Development By the end of Phase I, we will have demonstrated, using our proof-of-concept implementation, the feasibility of the SSKN concept.\nIn particular, we will have demonstrated how the SSKN can accelerate and improve USAF mission operations, especially in time-constrained operating environments, such as peer fights.\nFurther, we will have demonstrated implementations for each of the key technological components of SSKN.\nFinally, we will have developed a complete Phase II implementation plan and defined and measured dynamic KG-related baseline performance metrics for quantitative performance tracking and prototype assessment.\nIn Phase II, we will build a complete, prototype SSKN system based on our work and design in Phase I.\nThe result of the Phase II effort will be a TRL 6 prototype implementation of the SSKN software.\nWe will demonstrate the effectiveness of the capability for an AF-relevant application.\nWe will deliver prototype software and support on-site testing in the customer’s environment, and we will evaluate performance of the prototype compared to baseline from Phase I.\nWe will also work with the customer and/or transition partners to ensure that SSKN meets the requirements for deployment to USAF and other DoD systems and to identify representative deployment environments of interest.\nSSKN will adhere to the DoD Unified Capabilities Requirements (UCR), and it will be certified per the Air Force Evaluated Products List (EPL).\nIn addition, we will work with potential commercial customers to ensure that SSKN meets commercial needs.\nWe may deploy a beta version of the software with a commercial partner for testing and Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n21",
        "29": "ATC-NY AF244-0001 F244-0001-0059 feedback.\nWe have successfully used this approach on past Phase II SBIRs; this would occur about one year into the effort.\nIn Phase III, we will focus on deployment of SSKN within the USAF and the DoD.\nAs part of the Phase III effort, we will obtain any necessary certifications for SSKN and will perform developmental testing and demonstration in an operational environment, including testing with classified data sources.\nThe result of the Phase III effort will be a deployable SSKN software product at TRL 8.\nATC-NY expects to support transition to TRL 9 within 6 months after the end of the Phase III effort.\nDuring Phase I, with the support of ATC-NY’s Facility Security Officer and Information Systems Security Manager, we will begin the necessary steps to acquire any additional certifications and approvals required to conduct Phase II testing.\nATC-NY maintains a secure facility, authorized to access, store, and generate classified information at the DoD SECRET level, and most ATC-NY personnel hold active SECRET clearances.\nSection 9 describes our secure facilities in more detail.\n6 Commercialization Strategy In today’s rapidly evolving threat landscape, the ability to make well-informed, data-driven decisions can be the difference between mission success and catastrophic failure.\nHowever, analysts and traditional analytical methods are often overwhelmed by the sheer volume and complexity of data confronting modern defense and intelligence operations.\nStandalone AI models, while powerful, lack the contextual grounding necessary to reliably support mission-critical applications.\nThese models are often trained on broad internet data, leaving them susceptible to hallucinations, factual inconsistencies, and a lack of sensitivity to the complex operational realities faced by defense forces.\nKGs can bridge this crucial gap by providing AI with a rich, structured knowledge base tailored to the defense domain.\nThese graphs model real-world concepts, entities (people, organizations, locations, etc.), and their interconnected relationships, and capture the deep context required for reliable decision support.\nHowever, current KGs produced by automated AI techniques such as information extraction and KG engines are imperfect and require expert review to ensure trustworthiness and utility.\nTo address these issues, ATC-NY proposes to develop the Synchronized Statistical Knowledge Network (SSKN), a dynamic KG editing and enhancement tool that streamlines user interactions by automatically incorporating the latest information and synchronizing users’ feedback and updates across the organization.\nSSKN enables users to store the reasoning behind their changes, empowering automated updates to find and correct similar errors in future data collections, as well as building trust with the user community and reducing manual effort.\n6.1 Market Opportunity SSKN will give the Air Force, as well as other DoD, government, and commercial entities the ability to apply up-to-date and fast-breaking information in fluid and dynamic environments.\nThe SSKN graphical interface will enable users to intuitively explore, update, and query KGs with state-of-the- art visualization techniques delivered via any web browser and receive improved, automated daily KG updates and intelligence gathering recommendations over time.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n22",
        "30": "ATC-NY AF244-0001 F244-0001-0059 6.1.1 Military Market Data is becoming more ubiquitous and powerful in government and defense sectors.\nTailoring data to add value, support decisions, and evaluate key criteria in a timely manner remains a significant and growing challenge as more and more data becomes available.\nKGs have emerged as a powerful solution to address this issue.\nA KG integrates data from diverse sources into a unified, structured, and interconnected representation, offering a more nuanced look at information.\nThis is where advanced AI powered by KGs offers a transformative solution.\nBy harnessing KGs to provide better context and more relevant prompts to large language models, military leaders and analysts gain faster, more grounded insights to stay ahead of emerging threats and make critical decisions with confidence.\nOther applications include intelligence analysis where contextual AI can uncover hidden patterns, surface critical insights, and generate hypotheses by connecting disparate pieces of information within the larger context of the intelligence domain.\nThe training and simulation arena is another potential military application where knowledge graphs and AI can capture and encode the deep institutional knowledge and best practices of experienced personnel, allowing contextual AI to generate realistic training scenarios and support immersive simulations for mission rehearsal.\n16 Knowledge models can play a crucial role in DoD operations by providing a structured framework to organize, represent, and apply knowledge within specific contexts.\nThe question is can they be trusted and automated to accept changes and updates and parse those into new applications without having to manually recheck and review everything.\nKnowledge models in the DoD, optimized and enhanced in this way, can span various domains, contributing to enhanced decision-making, operational efficiency, and overall mission success.\nThis cross-domain sharing will enable the true value of KG’s to be realized in critical mission areas like cybersecurity, logistics and supply chain management and overall decision support systems.17 Effective decision-making in the defense domain requires a nuanced understanding of the operational picture and patterns of life – the intricate web of entities, relationships, and domain-specific knowledge that shapes real-world scenarios.\nThis contextual awareness is paramount when lives are at stake and the margin for error is razor thin.\nHowever, tools such as knowledge graphs in their current iterations still need to be fine-tuned so that patterns and changes made to one situation can be saved and utilized in corresponding or cross-domain situations, without having a user manually review an entire dynamic knowledge graph to suggest additional necessary changes.\nSSKN can decipher these trends with Probabilistic Dynamic Knowledge Graphs (PDGs), and builds on already established data-cleaning capabilities from our DRAS software to reduce noise.\nThis enables SSKN to apply expert feedback and knowledge in future automated updates, building trust with users over time and further reducing manual effort.\nThis will support faster, more effective situational awareness, particularly in time-constrained environments.\n6.1.2 First Responders and Other Government Markets For law enforcement and first responders, knowledge graphs can facilitate advanced queries that interlink disparate data points, such as connecting a crime victim to associated individuals, their vehicles, and subsequent sightings by traffic cameras.\nThe graph exploration approach allows 16 https://valkyrie.ai/post/the-future-of-mission-readiness-knowledge-graphs-and-contextual-ai-for-defense 17 https://www.wti-solutions.com/ontologies-knowledge-graphs-knowledge-models-part-ii-dod-application/ Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n23",
        "31": "ATC-NY AF244-0001 F244-0001-0059 analysts to navigate through a web of data, following their investigative intuition and hypotheses, supported by visual aids that map the paths of their inquiry.18 KGs can become effective tools that first responders can use to create advanced analytics for proactive crime prevention while supporting investigations, and predictive policing.\nThis can help not only to solve past crimes, but also help to implement effective crime prevention policies.\nDue to the adoption of knowledge graph databases and their rigorous nature, such analysis is becoming more commonplace.19 For the Air Force as well as other Defense and government agencies, SSKN will allow further insights by analysts, law enforcement, homeland security, and the intelligence community, giving users the ability to break down data silos and link diverse datasets.\nThis will contribute to a more connected, informed, and responsive data environment that can be used by the military, first responders and other government analysts to leverage data for improved decision-making, mission planning, and operational effectiveness.\n6.1.3 Commercial Market The Knowledge Graph market was valued at $1.06 billion in 2023, and total knowledge graph revenue is expected to grow at a compound annual growth rate (CAGR) of 18.1% from 2024 to 2030, reaching nearly $3.42 billion.\nA knowledge graph is particularly important in commercial applications as it allows businesses to manage data so that they understand the connections between their customers, products or services, markets, current events, and anything else that impacts the enterprise.\nKnowledge graphs can provide background information, such as what kind of things are important to the company and how they relate to one another.\nAn explicit representation of business knowledge allows different data sets to share a common reference.\nA knowledge graph combines business data and business knowledge to provide a more complete and integrated experience with the organization’s data.20 The knowledge graph industry is poised for sustained growth as businesses recognize its significant role in data management, decision-making, and innovation.\nThe rise in knowledge graph market integration within enterprise applications is evident, with increased demand across diverse sectors such as healthcare, finance, and retail.\nOpen-source knowledge graph platforms are on the rise, accompanied by a growing emphasis on security and privacy considerations.\nKnowledge graphs have been shown to impact several industries such as retail, where knowledge graphs have been used for up-sell and cross-sell strategies and products based on individual purchase behavior.\nThe entertainment industry is also using knowledge graphs and leveraging AI-based recommendation engines for content platforms, like Netflix or social media companies.\nBased on online engagement behaviors, these providers recommend new content for users to read or watch.\nFinance is another fast-growing market where the technology is being used to create know-your- customer (KYC) and anti-money laundering initiatives within the finance industry.\nThey assist in financial crime prevention and investigation, allowing banking institutions to understand the flow of money across their clientele and identify noncompliant customers.\nHealthcare is a key market where knowledge graphs are also benefiting the quality of care and the speed of innovation by organizing 18 https://policinginsight.com/feature/from-data-to-knowledge-creating-a-single-connected-view-of-intelligence/ 19 https://policinginsight.com/feature/advertisement/transparency-within-graph-powered-predictive-policing/ 20 https://www.maximizemarketresearch.com/market-report/knowledge-graph-market/221742/ Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n24",
        "32": "ATC-NY AF244-0001 F244-0001-0059 and categorizing relationships within medical research.\nThis information assists providers by validating diagnoses and identifying treatment plans based on individual needs.\n21 For commercial applications, knowledge graphs can create a unified ecosystem by breaking down data silos and linking diverse datasets.\nWith consistent identifiers and flexible schemas, they simplify data integration and make it possible to access fresh insights.\nAs in the military, commercial users of KGs will run into similar bottlenecks when using AI, necessitating laborious review processes that we believe SSKN can alleviate.\nWe see the capacity to transfer SSKN technology to the commercial sector.\nOur proven technologies, developed for several different military applications and departments, including the Army and the Navy, will enable us to demonstrate solutions using SSKN that will hold value in this sector including reducing noise in data sources and establishing trusted dynamic KG update strategies tailored for each application.\nWe believe SSKN can assist commercial entities in their emerging AI-driven workflows, and we can work with them directly or license our solution to integrate SSKN with current KG vendors.\nWe can demonstrate that these capabilities in the defense sector are directly applicable to commercial situations.\nThe ability to utilize data more effectively, accurately and quickly is a game changer whether for defense or commercial applications.\n6.2 Business Model Reliable and timely knowledge is critical whether on the battlefield or in the boardroom.\nThere is an expression that says most battles, games or contests are won before they start.\nThe side that is prepared and ready has already stacked the odds in their favor.\nWithout the right information at the right time soldiers don’t move, goods are not shipped, communication is ineffective, and people cannot complete their objectives.\nParticularly in a modern environment, massive amounts of data are collected every day.\nKnowledge graphs are considered a rapidly developing capability that will tie disparate data together.\nHowever, a major challenge remains: how to leverage automated KG creation tools in time-constrained applications to maintain trusted, up-to-date knowledge without requiring prohibitive levels of manual effort.\nIn the creation of SSKN, ATC-NY looks to extend our proven capabilities from prior work to achieve a more nuanced and effective knowledge graph that will enable AI-based workflows to be trusted and exploited in mission-critical scenarios.\nAF users can rely on SSKN to organize daily data collections into meaningful knowledge through a process that is less manual and more automated, supporting situational understanding, threat detection, targeting operations, and pattern-of-life analyses.\nThe goal is to develop this into a prototype product for Air Force use; but once proven in this environment we believe it can be transferred to other defense and government sectors and into commercial applications, as well.\nWe have three primary methods of sale and distribution: direct sales, licensing, and sale to resellers and systems integrators.\nWe are experienced in all three.\nATC-NY personnel have demonstrated success in defining product vision, functionality, and styling and establishing a brand for our software and technology transitions.\nTo cite some examples, we established a brand identity with the “Cyber Marshal” family of forensic products: P2P Marshal, Mac Marshal, Router Marshal, Mem Marshal, Mobile Marshal, and Live Marshal.\nSome 26,000 copies of these products have been distributed directly to law enforcement agencies and commercial enterprises in all 50 states and 47 countries.\nThe Marshal family of products was developed as part of ATC-NY’s forensics security products group and initially funded by the National Institute of Justice.\n21 https://www.ibm.com/topics/knowledge-graph Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n25",
        "33": "ATC-NY AF244-0001 F244-0001-0059 One of our most recent success stories is CYRIN, a virtual cybersecurity training platform.\nCYRIN is the result of several SBIR contracts and is a fully operational commercial product.22 It now has an annual run rate of $1.5-$2 million per year, showing a 10-15% annual growth rate year-over-year.\nTo date, we have over 90,000 users of the system, with over 100,000 exercise runs, and the platform is protected by seven patents.\nBecause of CYRIN we have an established presence around the world with both domestic and overseas partners such as QA, the largest training company in Europe with thousands of subscribers and over $200 million in annual sales.\nCYRIN’s development began with support from the Air Force, enabling online cybersecurity training anytime, anywhere, and with accurate measures of training effectiveness.\nDuring a Phase II effort we collaborated with the Air Force Institute of Technology (AFIT) to move CYRIN to a FedRAMP- approved cloud computing provider.\nNot only is CYRIN an approved DoD vendor, but on the commercial side we train a multitude of customers and learners, including students and instructors from universities and educational institutions, such as Rochester Institute of Technology (RIT), Penn State, Carnegie Mellon (Qatar), University of Wisconsin, and BYU.\nWe have more than 25 college and university partners.\nCYRIN was also chosen by Cyber Ireland (part of Munster Technology University, a consortium of Irish universities) as its central training platform for government, academic and civilian personnel in Ireland for IT and cyber related workforce development training in that country.\nThrough these college and university partnerships, we have created several development efforts and new technology for the CYRIN platform.\nIn addition, this rich collaborative ecosystem allows us to work with subject matter experts in a variety of fields to develop iterations on other products.\nWe see the opportunity to develop SSKN as we work with and have access through these university partners to key industry users and potential industry beta-testing sites, which increases our development and business opportunities.\nThis gives us the ability to build out this product and even potentially develop SSKN as a simulated model that could reside on CYRIN and provide training and introductory access for future sales to both government and commercial partners.\nParticularly with our resellers, we find our outreach efforts are positively impacted when we can demonstrate the fidelity of a product in an online simulated environment.\nIn North America we have utilized such noted reseller partners as (ISC)2 and Info-Tech Research, who train and consult with industry and commercial subscribers across multiple industry sectors.\nIn Japan we work with Cornet Solutions, and they have secured several cybersecurity training contracts with commercial companies and are working with Japan’s Ministry of Defense (MoD) to bring CYRIN to that agency.\nAll these avenues give us an opportunity to promote and directly market a product like SSKN to a variety of end-users and systems integrators.\nOur CYRIN resellers, both domestically and internationally, give us not only opportunities and access to potential customers but also potential developers.\nIn this market there are several existing companies that provide knowledge graph solutions, and they run the gamut from established giants such as Oracle and IBM to long-time industry suppliers such as neo4j.23 The market has many layers, from startups like Siren, IndyKite, and Dfrnt, to more established concerns like Stardog and Interos.\nWe know from experience that these companies are more open to ideas, partnerships, integration and licensing situations.\nWith a new and rapidly 22 https://cyrin.atcorp.com/ 23 https://www.f6s.com/companies/knowledge-graph/mo Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n26",
        "34": "ATC-NY AF244-0001 F244-0001-0059 growing market, we see potential for opportunities to collaborate in some cases with established providers or partner with new entrants to the market.24 6.3 Revenue Forecast For this forecast, we have simplified the revenue as an annual license fee as noted below for different vertical markets.\nThe details below indicate our transition and timeline from a federal funded effort to a commercial application for sale to defense, government, and the private sector.\nThis is based on prior experience in the development of several SBIR-funded technologies that we have turned into commercial products.\nFor simplicity, we leave it here as an annual license fee, with different projections for commercial enterprises who may have additional needs in customer engagement.\nWe understand that a final accounting could differ from this model, as revenue could include customization, an upfront license fee, royalties per instance of the software delivered, and annual support and maintenance fees.\nWe assume a $350,000 annual license fee for the military and government sector.\nFor commercial enterprises, the actual form and price of a commercial license could differ significantly from this model and commercial revenue below shows some of that difference.\nWe have projected potential post-Phase II funding, based on other funding received for similar projects, although we realize there is no guarantee of that.\nWe believe we have the resources to carry this project through to commercial realization with or without additional funding after Phase II.\nTime Period Phase I Phase II Phase II Enhancement First deployment 2028 Revenue 2029 Revenue 2030 Revenue 2031 Federal Development Funding Military/ Government Revenue Commercial License Revenue Pro Forma Total Revenue $140,000 $1,000,000 $500,000 $350,000 $700,000 $700,000 $1,050,000 $350,000 $700,000 $1,500,000 $2,650,000 $800,000 $1,600,000 6.4 ATC-NY’s Proven Record of SBIR Commercialization ATC-NY has a proven track record at commercializing the results of SBIR and other federally funded research.\nThe company has a number of staff with advanced degrees in computer science, engineering, or mathematics.\nNo special software will be required to use SSKN as it can operate as an on-premises solution and accessed via any web browser over the organization’s network, such as the Air Force research and development labs.\nThe application can also be deployed as part of a cloud computing environment to integrate with other government and commercial enterprises’ analysis workflows that are cloud- based.\nWe have been doing this successfully with our CYRIN product, which resides in the cloud and provides virtual cybersecurity training and is available 24/7.\nFor government and defense department customers concerned about proper security options, SSKN can reside on their on- premises servers or become available through a FedRAMP-approved cloud provider.\n24 https://www.ventureradar.com/keyword/Knowledge%20graph Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n27",
        "35": "ATC-NY AF244-0001 F244-0001-0059 ATC-NY is experienced with commercializing Federally funded product development efforts using a variety of methods from direct sale to licensing, or integration with other product suites sold directly to end users or third-party integrators.\nIn this project, we expect to deliver SSKN directly to the Air Force while proving its concept so that it could be viable to other services and government agencies.\nFor other markets we could see licensing the product to a systems integrator or other prime contractors and suppliers to the DoD or commercial sector.\nA recent success relevant to this topic is ATCorp’s Shipboard Network AI Readiness System (SNAIRS), a commercial contract that builds on an SBIR project with the Office of Naval Research (ONR).\nOur SNAIRS project harnesses the capability to improve the shipboard network management tasks of the Navy’s Consolidated Afloat Networks and Enterprise Services (CANES) network by applying AI/ML filters that provide the analytical rigor needed to track and identify real time configuration status changes.\nSNAIRS also continuously monitors the system to identify issues and propose corrective actions.\nThe result is an AI/ML process that sifts through large amounts of data to find anomalous items, and items of interest, based on learned language structures and content within the data.\nMI Technical Solutions (MITS) is the Prime Contractor for SNAIR; ATCorp is the sole subcontractor providing AI/ML expertise.\nThis experience shows that the ATC-NY team has the skills, knowledge, resources, and track record to build SSKN to meet the needs of the Air Force as well as commercialize it for other DoD and government customers, and the private sector.\n7 Key Personnel ATC-NY proposes a project team with the mix of technical skills necessary to successfully create the proposed system, and the business skills required to commercialize the resulting products.\nThe Principal Investigator of this Phase I SBIR effort will be Mr.\nPaul Nicotera, a full-time employee of ATC-NY since 2015.\nMr.\nNicotera was the ML SME for the related DRAS and SIFT development efforts and has substantial experience in machine learning, graphical modeling, dynamic and stream data analytics.\nMr.\nOliver Ochs, a full-time employee of ATC-NY since 2021, will serve as Associate Principal Investigator.\nMr.\nOchs provides valuable experience in AI and ML automation and pipelines, data analysis and dataset preparation, user interface design, and software testing.\nDr.\nYuliy Tsank, a full-time employee of ATCorp since 2019, will support them.\nDr.\nTsank provides extensive experience in AI and ML model design, training, and testing methodologies, including probabilistic graphical models, LLMs, and deep learning.\nSenior management at ATC-NY and ATCorp will provide technical advice and support product development and commercialization activities.\nDr.\nRobert Joyce, Vice President of Software R&D at ATC-NY, will serve as a technical advisor for the project, providing project management oversight and product development expertise.\nDr.\nJoyce has been a key developer and technical advisor on many of ATC-NY’s R&D projects resulting in commercial products.\nMr.\nGene Proctor, Vice President of Business Development at ATCorp, will provide commercialization and business development advice and oversee commercialization activities.\nDr.\nKenneth Thurber, president and CEO of ATCorp, will provide management oversight and commercialization strategy.\nThe management oversight of Dr.\nJoyce, Dr.\nThurber, and Mr.\nProctor will be funded through the indirect cost pool.\nThe resume and roles of the key personnel participating in this effort are presented below.\nEveryone associated with this project is a U.S.\ncitizen.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n28",
        "36": "ATC-NY AF244-0001 F244-0001-0059 Staff Member Mr.\nPaul Nicotera Senior Software Engineer, Position ATC-NY Mr.\nOliver Ochs Dr.\nYuliy Tsank Software Engineer, ATC- NY Computer Scientist, ATCorp Dr.\nRobert Joyce VP Software R&D, Mr.\nGene Proctor VP Business ATC-NY Dr.\nKenneth Thurber Development, ATCorp President and CEO, ATCorp Role and Expertise Principal Investigator: AI/ML, graphical modeling, cybersecurity, tactical network modeling and threat analysis Associate P.I.: AI/ML pipelines, data analysis, user interfaces Support: AI/ML model design, LLMs, PGMs, data cleaning Technical Advisor: product development Commercialization and Business Development Advisor Commercialization Strategist Contract Staff Yes Yes Yes Indirect cost pool Indirect cost pool Indirect cost pool Principal Investigator: Mr.\nPaul Nicotera Senior Software Engineer, ATC-NY Education 2014 – M.S., Computer Science, State University of New York at Buffalo.\n2005 – M.E., Materials Engineering, Rensselaer Polytechnic Institute.\n2001 – B.S., Materials Engineering, Rensselaer Polytechnic Institute.\nExperience Summary Since joining ATC-NY in 2015, Mr.\nNicotera has developed data analysis, information assurance, and visualization solutions for a number of government applications, including geographic information systems, tactical networks, aviation sustainment, mission planning, supply chains, missile defense, space science, security markings, and software quality assurance.\nMr.\nNicotera has applied machine learning methods to detect patterns and anomalies in real data sources, including spacecraft sensor readings, satellite and drone image properties, network activities, software test records, maintenance logs, order fulfillment details, and security markings.\nMr.\nNicotera’s work has resulted in 16 granted patents.\nMr.\nNicotera served as PI for the WHAM project, DLA-funded Phase I work developing decision support and task automation for warehouse management in distribution and disposition operations, as part of DLA warehouse modernization programs.\nWHAM is an AI-based service that coordinates and integrates data from related systems, such as the Distribution Standard System (DSS), Warehouse Execution Systems (WES), Smart Warehouse systems, and human input to improve warehouse operations.\nWHAM applies explainable AI and trusted learning methods to ensure that system recommendations and automated behaviors are reliable and understandable.\nInstead of integrating directly into a specific commercial product for warehouse management, WHAM provides standard data analysis APIs for common systems and objectives, which are easily deployed across facilities and can be readily extended to new systems.\nMr.\nNicotera was the machine learning SME for the DRAS project, an Army-funded effort to improve data quality and facilitate Condition Based Maintenance of aircraft.\nDRAS (Data Refinery for Aviation Sustainment) applies data validation, statistical and machine learning models to detect and correct noise in flight events, vehicle, and IT maintenance datasets.\nDRAS recommends corrected values based on model predictions for data that is found to be invalid, such as conflicting, missing, duplicate, or statistically unlikely record values.\nThe DRAS proof-of-concept software Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n29",
        "37": "ATC-NY AF244-0001 F244-0001-0059 learns and applies decision trees, support vector machines, and artificial neural networks to produce cleaned vehicle and IT maintenance datasets, which result in significantly improved performance of predictive maintenance models.\nMr.\nNicotera supported the Predictor of Airport Capacity (PARC) project, a NASA-funded effort that involved designing Bayesian networks using the Bayes Server software application, and training these probabilistic models with large datasets of historical aircraft arrival and departure records.\nThe Bayesian analysis techniques were shown to enable improved forecasts of airport flight capacity for multiple U.S.\nmetroplex airspaces, providing significant potential to reduce delays and enhance runway utilization.\nMr.\nNicotera was the machine learning SME for CAJ, a Navy-funded effort to develop Cyber Analyst Journal software for intelligence gathering from Publicly Available Information (PAI).\nCAJ enables smart tagging of screenshots and records gathered during analysis of PAI.\nThis provides lookback and search capabilities for consumers of intelligence products to easily delve into high level results to understand why certain conclusions or recommendations were made.\nTags are extracted from screenshots of analysis tools using Optical Character Recognition (OCR).\nCAJ uses a state-of- the-art, open-source OCR engine for smart tagging functionality.\nMr.\nNicotera served as PI for the RAMS project, a NASA-funded Phase I effort to enable automatically selecting scientifically relevant sensor data at the point of collection, such as onboard spacecraft.\nRAMS, or Response Abstraction and Model Simplification, uses active learning to efficiently fine-tune event detection models based on experts’ data selection strategies.\nModels are then represented as quantized neural networks and run with specialized hardware and heterogeneous computing techniques to rapidly analyze data collected on a variety of constrained computing platforms.\nThe RAMS proof-of-concept prototype used an Edge Tensor Processing Unit to efficiently select interesting science data from a continuous stream of replayed NASA mission survey data.\nMr.\nNicotera was the machine learning SME for the Argus project, a Navy-funded effort to automate software testing and find latent errors in a program by analyzing large amounts of testing output.\nArgus uses a combination of Execution Driver and Instrumentation components to exercise a variety of code paths and capture the target program’s behavior.\nBig-data machine learning techniques autonomously analyze records of program behavior to find and prioritize anomalous behavior that may indicate and undiscovered software bug.\nArgus offers the capability to catch bugs with less time and cost than manual approaches.\nMr.\nNicotera was the machine learning SME for the SIFT project, a SOCOM-funded effort to integrate with existing and future security tools by federating disparate data sources into a unified form to search and interrogate.\nSIFT (Scalable Incident-response and Forensics Toolkit) enables information security analysts to import data streams from sensors and tools into datasets within the same context, enabling greater monitoring and investigative reports generated through advanced queries and machine learning threat detection algorithms.\nMr.\nNicotera previously supported the DocMark project, an Air Force-funded Phase II development effort focused on mitigating the risk of data loss through semi-automated correction of security markings using metadata and contextual features.\nDocMark employs a combination of parametric machine learning models and rule sets authored by subject matter experts to generate updated and corrected security markings for cross-domain, potentially sensitive documents, images, and video files.\nPrior to working at ATC-NY, Mr.\nNicotera specialized in artificial intelligence topics during his graduate studies in computer science.\nHe led a project that applied machine learning and statistical Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n30",
        "38": "ATC-NY AF244-0001 F244-0001-0059 biometrics to index users enrolled in an automatic speaker recognition system, which enabled significantly reduced identification processing time.\nHe has also developed computer vision applications, such as a program that segments foreground and background areas of photographs, as well as an algorithm that semantically labels eight different types of background segments in images.\nMr.\nNicotera currently holds a DoD clearance at the Secret level.\nSelected Patents J.\nSirianni, P.\nNicotera, E.\nChartier, J.\nPowers, Automated Software Bug Discovery and Assessment, U.S.\nPatent 11,494,295, November 8, 2022.\nJ.\nAl-Gharaibeh, W.\nEstey, P.\nNicotera, Systems and Methods for Document Image Processing Using Neural Networks, U.S.\nPatent 11,468,694, October 11, 2022.\nM.\nDonovan, P.\nNicotera, D.\nHollister, R.\nJoyce, J.\nPowers, Artificial Intelligence Modeling for Cyber-Attack Simulation Protocols, U.S.\nPatent 11,429,713, August 30, 2022.\nS.\nAloisio and P.\nNicotera, “Systems and Methods for Classification of Data Streams”, U.S.\nPatent 10,878,018, December 29, 2020.\nJ.\nAl-Gharaibeh, W.\nEstey, and P.\nNicotera, “Systems and Methods for Processing Document Images”, U.S.\nPatent 10,832,046, November 10, 2020.\nAssociate P.I.: Mr.\nOliver Ochs Software Engineer, ATC-NY Education 2020 – B.A., Computer Science, University of Colorado Denver, Denver CO.\nExperience Summary Oliver Ochs joined ATC-NY in 2021 and served as a Software Engineer for the MIPS project.\nMIPS is a memory analysis and optimization tool aimed at next-generation HPC memory architectures.\nMIPS directly instruments as-built optimized binaries, without requiring source code or modification of the software build process, models the behavior of the complete memory hierarchy of a system, and uses this analysis to produce intelligent, actionable advice on memory placement.\nMr.\nOchs is also a Software Engineer for the Cross Domain Network Administration (CNA) research effort sponsored by the U.S.\nNavy’s NAWCTSD Battle Lab.\nThe NAWCTSD Battle Lab runs many training and simulation systems to train Navy warfighters; each of these contain systems across multiple security domains.\nATCorp is building CNA, a Cross Domain Network Administration tool.\nCNA will allow these isolated security domains with devices and systems to connect to a centralized cross-domain network administration tool to provide the missing centralized control.\nMr.\nOchs was recently a Software Engineer for the GRIDMAPS effort.\nGRIDMAPS combines state- of-the-art cybersecurity modeling techniques with dedicated grid state analysis.\nGRIDMAPS utilizes state estimation and cybersecurity analysis tools to create grid restoration methodologies.\nMr.\nOchs has recently worked on developing methods for importing various grid exchange files and leveraging external frameworks to model one-line-diagrams for grid components and network areas.\nMr.\nOchs recently supported the Secure, Reliable Blockchain (SR-Blockchain) project, an Army- funded Phase II effort to adapt blockchain technology to Disconnected, Intermittent, or Limited/lossy (DIL) tactical networks.\nSR-Blockchain increases availability, validates data to prevent tampering, Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n31",
        "39": "ATC-NY AF244-0001 F244-0001-0059 and thwarts distributed denial-of-service attacks.\nSR-Blockchain gives warfighters access to valid Command and Control (C2) information that facilitates real-time decision making.\nSR-Blockchain overcomes limitations of other blockchain approaches deployed in DIL environments, including efficient message distribution, correct operation during network disconnects, dynamic adaptation to variable network performance, and scalable blockchain construction.\nPrior to his employment at ATC-NY, Mr.\nOchs served as a Research Assistant at Integrated Statistics, an Information Technology and Environmental Services company.\nDuring his time at Integrated Statistics, Mr.\nOchs Aided with training and testing machine learning models to identify and take stock of marine mammals from geospatial imagery.\nMr.\nOchs also developed several R scripts to get morphological measurements on whales from aerial imagery.\nSupport: Dr.\nYuliy Tsank Computer Scientist, ATCorp Education Ph.D., Computational Vision Science, University of California, Santa Barbara, 2019 B.A., Neurobiology, University of California, Berkeley, 2012 Experience Summary Since joining ATCorp, Yuliy Tsank has participated in multiple research and development projects with major machine learning and data analysis components involving the processing of image data, text data, categorical data, and numerical data.\nHe has experience using and customizing a variety of machine learning and neural network model types for supervised and unsupervised learning tasks.\nDr.\nTsank supported the FORS (Foreign Object Retrieval System) project, which is focused on the development of neural network object detectors to autonomously detect and remove foreign objects from airport taxiways.\nDr.\nTsank served as the PI for the IWUCT (Ideal Work Unit Code Tool) project, which focused on using neural networks to automate the classification of narrative text data in condition-based maintenance forms for the Air Force.\nHe supported DRAS (Data Refinement and Aviation Sustainment), a data-cleaning project using machine learning methods to clean and remove noise from Army Aviation data to improve maintenance and reliability of aircraft components and sub- components.\nHe also supported the RAMS (Response Abstraction and Model Simplification) project, which focused on the quantization and deployment of neural network models onto application-specific integrated circuits for eventual use in computationally constrained space environments, such as bandwidth-constrained NASA observatories and remotely-placed sensor platforms.\nHe supported the Predictor of Airport Capacity (PARC) project, a NASA-funded Phase II SBIR effort that applies Bayesian analysis techniques to historical data in order to generate improved predictions of airport capacity for Air Traffic Control and Air Traffic Management.\nHe supported SCD-Platform (Scalable Cyber Detection for Low-Bandwidth and Disconnected Networks), a project to identify potential threats/disruptions to the Defense Logistics Agency logistics network using machine learning anomaly detection techniques.\nAs a Health Data Science Fellow at Insight in San Francisco, Dr.\nTsank developed a web-based application to automate glaucoma detection from 3D medical images.\nDr.\nTsank built and trained a custom neural network model to output glaucoma probability and attention heatmaps to guide manual Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n32",
        "40": "ATC-NY AF244-0001 F244-0001-0059 diagnosis in difficult cases.\nHe developed a proof-of-concept for automated glaucoma detection to use with medical imaging data from 15X less-costly equipment.\nThe automated process he developed would require significantly less human input for possible use in the developing world in order to improve access to and quality of quality of vision care for timely interventions.\nAs a Graduate Research and Teaching Assistant at UC Santa Barbara, Dr.\nTsank developed and implemented computational models that accounted for looking-behavior to study human brain processing of faces.\nAs part of this work Dr.\nTsank optimized and trained neural network models to simulate human development with specific face stimuli to bypass ethically impossible experiments.\nDr.\nTsank also developed and implemented numerous statistical models including optimal eye- movements models for simulated visual impairment and for facial expression videos.\nDr.\nTsank designed visual perception experiments with eye-tracking and validated statistical models with human performance and behavioral data.\nAs part of his dissertation, Dr.\nTsank completed three large projects that focused on determining and characterizing the interaction of eye movements with representations of faces in the human brain.\nAll of the projects included major computational modeling efforts which involved building, training, and optimizing convolutional neural networks in Python, as well as building and optimizing Bayesian models.\nThe results of his dissertation showed that human experience with the kinds of faces that they see in their visual environment during development has major effects on the specificity of face processing in the brain relative to object processing, as well as effects on the ability to efficiently process faces with certain statistical properties.\nSelected Publications Tsank, Y., & Eckstein, M.\nP.\n(2017).\nDomain Specificity of Oculomotor Learning after Changes in Sensory Processing.\nThe Journal of Neuroscience: The Official Journal of the Society for Neuroscience, 37(47), 11469–11484.\nhttps://doi.org/10.1523/JNEUROSCI.1208-17.2017 Tsank, Y.\n(2019).\nFace Perception: The Interaction of Eye Movements with Internal Face Representations [UC Santa Barbara].\nhttps://escholarship.org/uc/item/2x64w4r5#main 8 Foreign Citizens Everyone associated with this project is a U.S.\ncitizen.\n9 Facilities/Equipment ATC-NY does not require any equipment from the Federal Government for the performance of the work proposed here.\nThe computers, networks, facilities, and other equipment required to conduct the proposed research are owned or leased by ATC-NY.\nFor the Phase I effort, ATC-NY will acquire (purchase or temporarily secure) any additional equipment required to carry out this SBIR effort.\nIn 2014, ATC-NY moved to a new 20,000-sq.-ft., state-of-the-art facility on a 17- acre campus several miles north of downtown Ithaca, NY.\nThe facility is cleared to the level of Secret for the U.S.\nDepartment of Defense.\nTwo large conference rooms include wired and wireless high-speed Internet access, large-screen wireless built-in monitors, and teleconference phones.\nEach staff member has at least one workstation running Windows 11 that is connected to shared laser printers, common data servers and backup devices.\nMany staff members have multiple-monitor setups for increased efficiency and multiple desktop setups for increased development flexibility.\nEach office has two VoIP ports and 10 Ethernet data ports, enabling ad-hoc experimentation networks to be set up at Use or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n33",
        "41": "ATC-NY AF244-0001 F244-0001-0059 gigabit speeds.\nMost common development languages, compilers, and interpreters are available on Windows, Linux, Android, Apple iOS, and BSD platforms.\nThe ATC-NY facility has multiple rack-mounted servers and high-end desktop computers, many of which are equipped with advanced GPU computational accelerators from Nvidia, AMD, and Intel.\nThese on-site resources can be used to perform computationally intensive workloads, such as ML and AI modeling and data analysis, including Large Language Model (LLM) training and test operations, as well as large Knowledge Graph (KG) processing and editing tasks.\nATC-NY is also equipped with several virtual machine servers for container and hypervisor experimentation.\nWe maintain an internal OpenStack Platform-as-a-Service cloud for development efforts and we have operational systems using VMware, VirtualBox, and KVM on multi-core, large memory servers with RAIDed disks.\nWe also maintain an extensive library of current and legacy operating system environments as virtual machines, both for experimentation and for multi-platform software testing.\nATC-NY has a facility security clearance (FCL) and is capable of generating and storing information at the SECRET level.\nThe company has maintained a COMSEC account and automated information system (AIS) processing approval when required.\nShould the need arise, the facility has three spaces that meet TOP SECRET classification requirements: no windows, solid walls and ceilings, separate air conditioning/heating and ventilation, no ducts, and solid-core doors with X-10 door locks.\nOther equipment includes a STE (Secure Terminal Equipment) and three GSA-approved storage containers with X-09 locks.\nATC-NY facilities meet all applicable environmental laws and regulations of the United States and the states of New York and California.\nThe facilities meet all laws in the following groupings: airborne emissions, waterborne effluents, external radiation levels, outdoor noise, solid and bulk waste disposal practices, and handling and storage of toxic and hazardous materials.\n10 Subcontractors/Consultants As a subcontractor, ATCorp provides valuable expertise in graphical modeling techniques, AI and ML training and inference methodologies, including large language models, as well as data source processing, cleaning, and analysis procedures.\n11 Prior, Current, or Pending Support of Similar Proposals or Awards No prior, current, or pending support for proposed work.\nUse or disclosure of data contained on this page is subject to the restriction on the first page of this volume.\n34",
        "42": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Duns Cage F244-0001-0059 AF244-0001 Synchronized Statistical Knowledge Network (SSKN) 11/05/2024 03:56:52 PM ATC - NY P.O.\nBox 422 , Trumansburg, New York, 14886 http://www.atcorp.com LE62V456GNB5 101321479 8V807 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 42.14%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (7%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) $139,931.32 $139,931.32 $0.00 $0.00 $0.00 $81,497.81 $0.00 $0.00 $0.00 $0.00 $0.00 $34,343.18 $115,840.99 $14,935.95 $14,935.95 -$0.00 $9,154.39 $139,931.32 $0.00 $0.00",
        "43": "Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 42.14%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (7%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Computer and Information Research Scientist/ Principal Investigator (Paul Nicotera) Computer and Information Research Scientist/ Associate PI (Oliver Ochs) Subtotal Direct Labor (DL) Labor Overhead (rate 71.94%) x (DL) Total Direct Labor (TDL) Subcontractor Costs Subcontractor- Architecture Technology Corporation Subcontractor/Consultant Budget Information Category / Individual-TR $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $58.00 244 27.86 $3942.75 $18,094.75 $41.00 559 27.86 $6385.23 $29,304.23 $47,398.98 $34,098.83 $81,497.81 Computer and Information Research Scientist (Testing, Oversight) Subcontractor Overhead (SO) Subtotal Subcontractor Labor (SL) Other Direct Cost Type | Total Subcontractor Other Direct Costs 1 Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC1) Rate/Hour Estimated Hours Cost $76.50 66 $5,049.00 $9,886.95 $14,935.95 Vendor Cost $0.00 $14,935.95 $14,935.95",
        "44": "G&A (rate 42.14%) x Base (TDL+TOH) Cost Sharing Profit Rate (7%) Total Estimated Cost TABA Year 2 Direct Labor Costs Category / Individual-TR Computer and Information Research Scientist/ Principal Investigator (Paul Nicotera) Subtotal Direct Labor (DL) Labor Overhead (rate 71.94%) x (DL) Total Direct Labor (TDL) Subcontractor Costs Subcontractor- Architecture Technology Corporation Subcontractor/Consultant Budget Information Category / Individual-TR $34,343.18 -$0.00 $9,154.39 $139,931.32 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $58.00 0 27.86 $0.00 $0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Cost Computer and Information Research Scientist (Testing, Overview) $76.50 0 Vendor Subcontractor Overhead (SO) Subtotal Subcontractor Labor (SL) Other Direct Cost Type | Total Subcontractor Other Direct Costs 1 Total Subcontractor Costs (TSC) 1 Total Subcontractor Costs (TSC1) G&A (rate 42.14%) x Base (TDL+TOH) Cost Sharing Profit Rate (7%) Total Estimated Cost TABA Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Richard Smith Phone: (607) 257-1975 Phone: rsmith@atcorp.com $0.00 $0.00 $0.00 Cost $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00",
        "45": "Title: Proposal Owner If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: Yes Audit Agency Name: DCAA - Upstate Branch Audit Agency POC: Scott McCarthy Address: 5795 Widewaters Pkwy, 2nd Floor, Dewitt, New York,13214 Phone: (518) 448-6216 Email: scott.mccarthy@dcaa.mil Select the Type of Payment Desired: Partial payments",
        "46": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Computer and Information Research Scientist Principal Investigator Master's Degree Computer and Information Research Scientist Associate PI Bachelor's Degree 23 3 244 $58.00 27.86 $18,094.75 559 $41.00 27.86 $29,304.23 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\nRate used is the provisional rate approved by DCAA for 2024 Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nActual salary as of 10/1/24 Direct Labor Cost ($): Year2 $47,398.98 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Computer and Information Research Scientist Principal Investigator Master's Degree 23 0 $58.00 27.86 $0.00 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\nRate is based on provisional rate approved by DCAA Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nLabor is based on actual rates as of 11/1/24 Direct Labor Cost ($): $0.00",
        "47": "Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) Overhead Comments: Rate used is the provisional rate approved by DCAA for 2024 Overhead Cost ($): Year2 Labor Cost Overhead Rate (%) Overhead Comments: Rate is based on DCAA approved provisional rate.\nOverhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Subcontractor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nRate used is the provisional rate approved by DCAA for 2024 G&A Cost ($): Year2 G&A Rate (%): Apply G&A Rate to Overhead Costs?\n$47,398.98 71.94 $34,098.83 71.94 $0.00 $34,098.83 42.14 YES YES NO $34,343.18 42.14 YES",
        "48": "Apply G&A Rate to Direct Labor Costs?\nApply G&A Rate to Subcontractor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nRate is based on DCAA approved provisional rate.\nG&A Cost ($): Sum of all G&A Costs is ($): Subcontractor/Consultants Base Subcontractor/Consultant: Architecture Technology Corporation YES NO $0.00 $34,343.18 Budget Contact Name Budget Contact Title Budget Contact Phone Budget Contact Email Mr.\nAkeem Adewusi Contracts Manager (952) 829-5864 contracts@atcorp.com Do you have a letter of commitment from the subcontractor/consultant?\nDocument uploaded for the letter of commitment: • F244 0001 0059_ATCorp Letter of Intent.docx Are you able to provide detailed budget information for this subcontractor/consultant?\nYES YES Total Cost($) : $14,935.95 Detailed Budget Information Labor Category Description Hours Rate Cost Computer and Information Research Scientist Testing, Oversight 66 $76.50 $5,049.00 Type Amount Explanation Additional Costs",
        "49": "Overhead: $9,886.95 based on DCAA approved provisional rate G&A: Profit: Category Description Vendor Cost Other Direct Costs Year2 Subcontractor/Consultant: Architecture Technology Corporation Budget Contact Name Budget Contact Title Budget Contact Phone Budget Contact Email Mr.\nAkeem Adewusi Contacts Manager (952) 829-5864 contracts@atcorp.com Do you have a letter of commitment from the subcontractor/consultant?\nDocument uploaded for the letter of commitment: • F244 0001 0059_ATCorp Letter of Intent.docx Are you able to provide detailed budget information for this subcontractor/consultant?\nTotal Cost($) : Detailed Budget Information YES YES $0.00 Labor Category Description Hours Rate Cost Computer and Information Research Scientist Testing, Overview 0 $76.50 $0.00 Additional Costs Type Amount Explanation Overhead: $0.00 Based on DCAA approved provisional rate",
        "50": "G&A: Profit: Category Description Vendor Cost Other Direct Costs Total Subcontractors/Consultants Cost ($): Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: No cost sharing on this effort Profit Rate (%): Profit Explanation: Give the work proposed we feel the rate is appropriate.\nTotal Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: No cost sharing on this effort Profit Rate (%): Profit Explanation: based on work proposed we feel that the rate is reasonable Total Profit Cost ($): Total Proposed Amount ($): $14,935.95 -$0.00 7 $9,154.39 -$0.00 7 $9,154.39 $139,931.32",
        "51": "SBIR Company Commercialization Report ATC-NY INC DISCLAIMER: Information provided herein is privileged and confidential, and not subject to disclosure, pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nThis information shall only be used or disclosed for evaluation purposes.\nPrivileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 1/22",
        "52": "SBIR Company Commercialization Report Total Investments: Total Sales: Total Patents: $24,788,269.23 Company Information Address: $38,397,687.75 89 1610 TRUMANSBURG RD ITHACA, NY 14850-9213 United States Government Designated Phase III Funding: $4,020,667.00 SBC Control ID: SBC_000000460 Company Url: http://www.atcorp.com Company POC Title: Controller Commercialization POC Title: Controller/Contract Administrator Full Name: Richard a Smith Full Name: Richard A Smith Phone: Email: 6072571975 Ext 7102 rsmith@atcorp.com Phone: Email: (607) 257-1975 Ext 7102 rick@atc-nycorp.com Additional Company Information % Revenue for last fiscal year from SBIR/STTR funding: 29.0% Year Founded: 1983 Total revenue for last fiscal year: $1,000,000 - $4,999,999 # Employees Currently: 12 Year first Phase I award received: # SBIR/STTR Phase I Awards: 1984 91 Year first Phase II award received: # SBIR/STTR Phase II Awards: 1985 36 # Employees at first Phase II award: Mergers and Acquisition within past 2 years: 15 No Spin-offs resulting from SBIR/STTR: IPO resulting from SBIR/STTR | Year of IPO: No No | N/A Patents resulting from SBIR/STTR | #Patents: List of Patents: Yes | 89 US 7,467,417 B2; US 7,496,959 B2; US 7,716,470 B2; US 7,748,040 B2; US 7,818,804 B2; US 7,886,049 B2; US 7,908,281 B2; US 8,015,211 B2; US 8,176,557 B2; US 8,286,249 B2; US 8,458,805 B2; US 8,474,047 B2; US 8,510,860 B2; US 8,640,238 B2; US 8,756,237; US 8,839,426 B1; US 8,862,803; US 8,898,285; US 8,987,396; US 9,076,342; US 9,083,741; US 9,081,911; US 9,094,449; ; US 9,191,391; US 9,229,936; US 9,384,677; US 9,473,526; US 9,501,304; US 9,766.986; US 9,769,250; US 9,838,415; US 9,983,857; US 10,007,498; US 10,026.509; US 10,057,298; US 10,067.787; US 10,065,493; US 10,078.510; US 10,083,624; US 10,200,401; US 10,200,406; US 10,284,592; US 10,346,612; US 10,346,628; US 10,372,428; US 10,402,179; US10,412,114; US10,412,116; US 10,452,466; US 10,534,604; US 10,540,502; US 10,554,685; US 10,558,809; US 10,600.335; US 10, 621,365; US 10,628,560; US 10,664,574; US 10,719.706; US ; 10,733,341; US10,777,093; US10,803,766; US10,872,539; US10,846,329; US10,853,060; US10,858,825; US10,812,562; US10,878,018; US 10,873,604; US 10,817,604; US 10,832,046; US10,846,329; US 10,853,060; US 10,862,938; US 10,868,825; US 10,872,539; US 10,873,604; US 10,878,018; US 10,885,393; US 10,909,244; US 10,909,257; US 10,942,716; US 10,949,338; US 10,970,159; US 11,010,472; US 11,010,495; US 11,042,369; US 11,042,647; US 11,048,502; US 11,057,438; US 11,062,591; US 11,122,079; US 11,128,654; US 11,138,159; US 11,181,903; IUS11,245,743; US 11,269,078; US11,275,940; US 11.302,215; US 11,349,894; US 11,354,386; US 11,403,405; US11,429,713; US 11,451, 577; US 11,461,477; US 11,468.694; US 11,474,596; US 11,494,295; US 11,508,253; US 11,509.,694; US 11,444,974; US 11,503,064; US 11,503,075; 11,522,904 Woman-Owned: No Socially and Economically Disadvantaged: No Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 2/22",
        "53": "SBIR Company Commercialization Report HUBZone-Certified: No SBC majority-owned by multiple VCOC, HF, PE firms | By what percent (%): No | N/A Additional Investment From Last Submitted Version (01-14-2022 11:34 AM) DoD contracts/DoD subcontracts Angel Investors Venture Capital Self Funded Private Sector Other Federal Contracts/Grants Other Sources Additional Investment Total Investment $0.00 $0.00 $0.00 $22,728,167.82 $1,033,117.00 $0.00 $0.00 $0.00 Current Version $0.00 $0.00 $0.00 $23,755,152.23 $1,033,117.00 $0.00 $0.00 $0.00 $23,761,284.82 $24,788,269.23 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 3/22",
        "54": "SBIR Company Commercialization Report Phase III Sales To DoD or DoD prime contractors Private Sector Export Markets Other Federal Agencies Additional commercialization by 3rd Party Revenue Other Customers Additional Sales Total Sales Government Phase III Contracts Last Submitted Version (01-14-2022 11:34 AM) $31,620,948.76 $2,761,144.49 $0.00 $2,166,055.29 $0.00 $0.00 $0.00 Current Version $33,117,007.18 $3,114,625.28 $0.00 $2,166,055.29 $0.00 $0.00 $0.00 $36,548,148.54 $38,397,687.75 Funding Obligated $4,020,667.00 $4,020,667.00 Last Submitted Version (01-14-2022 11:34 AM) Current Version Commercialization Narrative Commercialized Awards Listed below are the sales revenue and investment details resulting from the technology developed under these SBIR/STTR awards.\nTyphon: A Developer's Tool for Refactoring Legacy Software for Multi-threaded Operation 1 of 42 Agency/Branch: Department of Defense/Navy Manufacturing related Program/Phase/Year: SBIR/Phase II/2014 Subsidiaries No | N/A N/A Topic #: N132-099 Contract/Grant #: N68335-14-C-0322 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $168,613.86 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $224,488.72 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $224,488.72 Sales Total: $168,613.86 Government Designated Phase III Contracts Funding Agreement / Contract # N68335-17-C-0601 Agency NAVY Project Title Year Awarded Funding Obligated Typhon: A Developer's Tool for Refactoring Legacy Software for Multi-threaded Operation 2017 $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 4/22",
        "55": "SBIR Company Commercialization Report AppMon: Application Monitors for Not-Yet-Trusted Software 2 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: STTR/Phase II/2007 Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $339,540.32 3rd Party Revenue: $0.00 Other Customers: $0.00 $339,540.32 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Research Institution Number of months taken to negotiate the Allocation of Rights agreement: 1 Who initiated the technology?: Small Business Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: 70% 30% ASTER: Active Smart Targets for Effective Response 3 of 42 Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Topic #: OSD06-SP2 Contract/Grant #: FA9550-07-C-0127 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Who initiated the collaboration?: Program/Phase/Year: SBIR/Phase II/2003 Topic #: N/A Contract/Grant #: DAAH0103CR118 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $468,395.84 3rd Party Revenue: $0.00 Other Customers: $0.00 $468,395.84 Sales Total: Emile: The EventML Explorer Agency/Branch: National Aeronautics and Space Administration Program/Phase/Year: SBIR/Phase II/2013 Topic #: A1.20 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions No Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 4 of 42 Page 5/22",
        "56": "SBIR Company Commercialization Report Contract/Grant #: NNX13CL03C program?\nAchieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $0.00 Dod or DoD prime contractors: $369,452.71 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $214,855.12 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $214,855.12 Sales Total: $369,452.71 The Metadata Security Assertion Framework and Evaluation system (MetaSAFE) 5 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2008 Subsidiaries No | N/A N/A Topic #: AF071-068 Contract/Grant #: FA8750-08-C-0126 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Alcuin Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $3,078,265.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $1,807,827.22 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $1,807,827.22 Sales Total: $3,078,265.00 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2010 Subsidiaries No | N/A N/A Topic #: AF083-028 Contract/Grant #: FA8650-10-C-6123 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $1,208,166.50 3rd Party Revenue: $0.00 Other Customers: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 6 of 42 $1,593,356.00 $0.00 $126,902.00 $0.00 $0.00 $0.00 Page 6/22",
        "57": "SBIR Company Commercialization Report Other Sources: Investment Total: $0.00 $1,208,166.50 Sales Total: $1,720,258.00 TSPI: Transparent Software Protection Infrastructure 7 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2004 Subsidiaries No | N/A N/A Topic #: OSD03-005 Contract/Grant #: FA8650-04-C-8008 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $508,843.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $433,371.56 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $433,371.56 Sales Total: $508,843.00 PMAF, a Pedigree Management and Assessment Framework 8 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2006 Subsidiaries No | N/A N/A Topic #: AF05-105 Contract/Grant #: FA8750-06-C-0023 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $524,583.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $1,890,204.18 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $1,890,204.18 Sales Total: $524,583.00 Elan: The Event Logic Assistant 9 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: STTR/Phase II/2009 Subsidiaries No | N/A N/A Topic #: AF07-T019 Contract/Grant #: FA9550-09-C-0081 Achieved a cost No Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 7/22",
        "58": "SBIR Company Commercialization Report saving or cost avoidance?: Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Who initiated the collaboration?: Phase III Sales To $0.00 Dod or DoD prime contractors: $808,832.22 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $337,418.85 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $337,418.85 Sales Total: $808,832.22 Research Institution Number of months taken to negotiate the Allocation of Rights agreement: 1 Who initiated the technology?: Small Business Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: 70% 30% EPP: Empirical Privilege Profiling for Black-Box Software 10 of 42 Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: SBIR/Phase II/2006 Topic #: SB041-016 Contract/Grant #: W31P4Q-06-C-0134 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $368,500.18 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $204,614.00 $0.00 $0.00 $0.00 $368,500.18 Sales Total: $204,614.00 Fight-Through Nodes (FTN) 11 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2012 Subsidiaries No | N/A N/A Topic #: AF103-047 Contract/Grant #: FA8750-12-C-0088 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 $0.00 $1,916,614.89 Page 8/22",
        "59": "SBIR Company Commercialization Report Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $491,973.82 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $491,973.82 Sales Total: $1,916,614.89 CYDEST: CYber DEfense Simulation Trainer 12 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2006 Subsidiaries No | N/A N/A Topic #: AF05-077 Contract/Grant #: FA8650-06-C-6648 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $674,711.79 3rd Party Revenue: $0.00 Other Customers: $0.00 $1,676,943.00 $0.00 $86,518.00 $0.00 $0.00 $0.00 $674,711.79 Sales Total: $1,763,461.00 EXploit And Malware INcubator (EXAMIN) 13 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2007 Subsidiaries No | N/A N/A Topic #: OSD05-SP2 Contract/Grant #: FA8750-07-C-0106 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $372,984.62 3rd Party Revenue: $0.00 Other Customers: $0.00 $371,478.00 $0.00 $210,191.00 $0.00 $0.00 $0.00 $372,984.62 Sales Total: $581,669.00 Abstraction and Model Simplification to Identify Interesting Data (RAMS) Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 14 of 42 Page 9/22",
        "60": "SBIR Company Commercialization Report Agency/Branch: National Aeronautics and Space Administration Program/Phase/Year: SBIR/Phase I/2021 Topic #: S5 Contract/Grant #: 80NSSC21C0109 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $61,649.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $61,649.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Security Policy Modeling and Enforcement Tools for Clinical Workflows 15 of 42 Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: SBIR/Phase II/1997 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Topic #: Contract/Grant #: Achieved a cost saving or cost avoidance?: N/A N/A No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: CYRIN Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $80,000.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $80,000.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 16 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2019 Subsidiaries No | N/A N/A Topic #: AF182-005 Contract/Grant #: FA8751-19-C-A026 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $1,121,736.94 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 10/22",
        "61": "SBIR Company Commercialization Report Other Federal contract/grants: $0.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Government Designated Phase III Contracts Funding Agreement / Contract # USAF Agency USAF $0.00 Private Sector: $0.00 Export Market: $1,879,145.71 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $660,093.28 $0.00 $0.00 $0.00 $1,879,145.71 Sales Total: $1,781,830.22 Project Title Year Awarded Funding Obligated 2022 $0.00 HPC Obfuscation and Security Toolkit (HOST) 17 of 42 Agency/Branch: Department of Energy Manufacturing related Program/Phase/Year: SBIR/Phase II/2018 Subsidiaries No | N/A N/A Topic #: 03a Contract/Grant #: DE-SC0017195 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $123,795.79 3rd Party Revenue: $0.00 Other Customers: $0.00 $123,795.79 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 CYTAN (CYbersecurity for TActical Networks) 18 of 42 Agency/Branch: Department of Defense/Navy Manufacturing related Program/Phase/Year: SBIR/Phase II/2012 Subsidiaries No | N/A N/A Topic #: N111-083 Contract/Grant #: H92222-12-C-0048 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $269,343.70 3rd Party Revenue: $0.00 Other Customers: $0.00 $269,343.70 Sales Total: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 11/22",
        "62": "SBIR Company Commercialization Report Government Designated Phase III Contracts Funding Agreement / Contract # W56KGU-16-C-0083 Agency ARMY Project Title Year Awarded Funding Obligated Cytan 2016 $575,095.00 WITTS: White Team Training Suite 19 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2014 Subsidiaries No | N/A N/A Topic #: AF121-030 Contract/Grant #: FA8650-14-C-6511 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $1,236,394.65 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $1,934,999.76 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $1,934,999.76 Sales Total: $1,236,394.65 DroidChamber 20 of 42 Agency/Branch: Department of Defense/Army Manufacturing related Program/Phase/Year: SBIR/Phase I/2015 Subsidiaries No | N/A N/A Topic #: A15-058 Contract/Grant #: W81XWH-15-C-0133 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Government Designated Phase III Contracts Funding Agreement / Contract # W81XWH-19-C-0064 Agency ARMY Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $216,324.15 3rd Party Revenue: $0.00 Other Customers: $0.00 $216,324.15 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Project Title Year Awarded Funding Obligated DroidChamber 2019 $1,074,828.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 12/22",
        "63": "SBIR Company Commercialization Report Mobile Platforms to Support Network Forensics - Phase II 21 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2002 Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $4,709,404.33 3rd Party Revenue: $663,027.00 Other Customers: $0.00 $1,001,556.42 $0.00 $1,621,693.00 $0.00 $0.00 $0.00 $5,372,431.33 Sales Total: $2,623,249.42 Topic #: N/A Contract/Grant #: F30602-02-C-0161 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: MARS Phase II Agency/Branch: Department of Defense/Defense Health Agency Manufacturing related Subsidiaries No | N/A N/A Program/Phase/Year: SBIR/Phase II/2019 Topic #: DHA172-004 Contract/Grant #: W81XWH19C0035 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $104,055.81 3rd Party Revenue: $0.00 Other Customers: $0.00 $104,055.81 Sales Total: 22 of 42 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 TELTAN (TELemedicine over a TActical Network) 23 of 42 Agency/Branch: Department of Defense/Defense Health Agency Manufacturing related Subsidiaries No | N/A N/A Program/Phase/Year: SBIR/Phase II/2018 Topic #: DHP15-002 Contract/Grant #: W81XWH18C0137 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 13/22",
        "64": "SBIR Company Commercialization Report Other Federal contract/grants: $0.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $239,070.01 3rd Party Revenue: $0.00 Other Customers: $0.00 $239,070.01 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 WIRE – Web service Interface Revision Environment 24 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2009 Subsidiaries No | N/A N/A Topic #: AF073-026 Contract/Grant #: FA8750-09-C-0164 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $17,451,855.51 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $517,043.66 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $517,043.66 Sales Total: $17,451,855.51 SWARM, a System-Wide Application Randomization Mechanism 25 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase I/2015 Subsidiaries No | N/A N/A Topic #: AF151-038 Contract/Grant #: FA8750-15-C-0269 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $218,139.57 3rd Party Revenue: $0.00 Other Customers: $0.00 $218,139.57 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 DivA: Automated Generation of Logical Code Diversity 26 of 42 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 14/22",
        "65": "SBIR Company Commercialization Report Agency/Branch: Department of Defense/Navy Manufacturing related Program/Phase/Year: STTR/Phase II/2013 Subsidiaries No | N/A N/A Topic #: N11A-T023 Contract/Grant #: N00014-13-C-0048 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: STTR Specific Information Who initiated the collaboration?: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $401,856.66 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $214,283.62 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $214,283.62 Sales Total: $401,856.66 Research Institution Number of months taken to negotiate the Allocation of Rights agreement: 1 Who initiated the technology?: Small Business Percentage of proceeds going to the small business: Percentage of proceeds going to the research institution: 70% 30% ORIS: Peer to Peer Object Repository with Integrated Security 27 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2003 Subsidiaries No | N/A N/A Topic #: N/A Contract/Grant #: F30602-03-C-0041 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $462,982.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $1,057,604.61 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $1,057,604.61 Sales Total: $462,982.00 Chipotle: A Peer-to-Peer System for Highly Distributed and Fault Tolerant XML Data Management 28 of 42 Agency/Branch: Department of Defense/Missile Defense Agency Manufacturing related Subsidiaries No | N/A N/A Program/Phase/Year: SBIR/Phase II/2007 Topic #: MDA05-053 Contract/Grant #: HQ0006-07-C-7604 Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 15/22",
        "66": "SBIR Company Commercialization Report Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: MIPS Agency/Branch: Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $341,289.50 3rd Party Revenue: $0.00 Other Customers: $0.00 $341,289.50 Sales Total: Department of Defense/Defense Threat Reduction Agency Manufacturing related Subsidiaries No | N/A N/A Program/Phase/Year: SBIR/Phase II/2020 Topic #: DTRA172-003 Contract/Grant #: HDTRA220C0005 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: USB Steward Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $91,361.25 3rd Party Revenue: $0.00 Other Customers: $0.00 $91,361.25 Sales Total: Agency/Branch: Department of Defense/Army Manufacturing related Program/Phase/Year: SBIR/Phase II/2011 Subsidiaries No | N/A N/A Topic #: A10-130 Contract/Grant #: W9113M-11-C-0073 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $1,192,800.66 3rd Party Revenue: $0.00 Other Customers: $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 29 of 42 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 30 of 42 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 16/22",
        "67": "SBIR Company Commercialization Report Investment Total: $1,192,800.66 Sales Total: $0.00 iFUSE: Integrated FUselet Synthesis Environment 31 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2004 Subsidiaries No | N/A N/A Topic #: AF03-094 Contract/Grant #: FA8750-04-C-0070 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $565,771.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $429,274.85 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $429,274.85 Sales Total: $565,771.00 Typhon: A Developer's Tool for Refactoring Legacy Software for Multi-threaded Operation 32 of 42 Agency/Branch: Department of Defense/Navy Manufacturing related Program/Phase/Year: SBIR/Phase I/2013 Subsidiaries No | N/A N/A Topic #: N132-099 Contract/Grant #: N68335-13-C-0416 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Government Designated Phase III Contracts Funding Agreement / Contract # N68335-17-C-0601 Agency NAVY Project Title Year Awarded Funding Obligated Typhon: A Developers Tool for Refactoring Legacy Software for Multi-threaded Operation 2017 $2,370,744.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 17/22",
        "68": "SBIR Company Commercialization Report BotMesh 33 of 42 Agency/Branch: Department of Defense/Navy Manufacturing related Program/Phase/Year: SBIR/Phase II/2014 Subsidiaries No | N/A N/A Topic #: N111-083 Contract/Grant #: N66001-14-C-5203 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $538,092.56 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $249,343.70 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $249,343.70 Sales Total: $538,092.56 TELTAN: TELemedcine over a TActical Network 34 of 42 Agency/Branch: Department of Defense/Defense Health Agency Manufacturing related Subsidiaries No | N/A N/A Program/Phase/Year: SBIR/Phase I/2015 Topic #: DHP15-002 Contract/Grant #: W81XWH-15-C-0161 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $270,042.26 3rd Party Revenue: $0.00 Other Customers: $0.00 $270,042.26 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 DocMark: A Rule-based and Probabilistic Document Marking System 35 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2015 Subsidiaries No | N/A N/A Topic #: AF131-052 Contract/Grant #: FA8750-15-C-0032 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 18/22",
        "69": "SBIR Company Commercialization Report Other Federal contract/grants: $0.00 Other Federal Agencies: $249,440.40 Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $253,462.14 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $253,462.14 Sales Total: $249,440.40 VMCIS: A Cognitive Immune System for Virtual Machine-based Mission Critical Applications 36 of 42 Agency/Branch: Department of Defense/Navy Manufacturing related Program/Phase/Year: SBIR/Phase I/2013 Subsidiaries No | N/A N/A Topic #: OSD12-IA2 Contract/Grant #: N00014-13-P-1023 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Myelin: Enterprise Mobile Security Software Framework 37 of 42 Agency/Branch: Department of Defense/Navy Manufacturing related Program/Phase/Year: SBIR/Phase I/2013 Subsidiaries No | N/A N/A Topic #: N122-149 Contract/Grant #: N66001-13-P-5114 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 19/22",
        "70": "SBIR Company Commercialization Report N/A Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Manufacturing related Subsidiaries No | N/A N/A Program/Phase/Year: SBIR/Phase I/2000 Topic #: N/A Contract/Grant #: DAAH0101CR012 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $370,090.00 Other Customers: $0.00 $370,090.00 Sales Total: 38 of 42 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 DASH: Dynamic, flexible computational acceleration using specialized hardware 39 of 42 Agency/Branch: Department of Defense/Missile Defense Agency Manufacturing related Subsidiaries No | N/A N/A Program/Phase/Year: SBIR/Phase I/2015 Topic #: MDA14-012 Contract/Grant #: HQ0147-15-C-7106 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 DocMark: A Rule-based and Probabilistic Document Marking System 40 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase I/2013 Subsidiaries No | N/A N/A Topic #: AF131-052 Contract/Grant #: FA8750-13-C-0172 Achieved a cost saving or cost avoidance?: No Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 20/22",
        "71": "SBIR Company Commercialization Report Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Efficient Code Certification for Open Firmware 41 of 42 Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Program/Phase/Year: SBIR/Phase II/2001 Topic #: N/A Contract/Grant #: DAAH0102CR080 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $0.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $470,279.43 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $204,614.00 $0.00 $0.00 $0.00 $470,279.43 Sales Total: $204,614.00 WITTS: White Team Training Suite 42 of 42 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase I/2012 Subsidiaries No | N/A N/A Topic #: AF121-030 Contract/Grant #: FA8650-12-M-6332 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $0.00 Dod or DoD prime contractors: $1,236,394.65 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $1,236,394.65 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 21/22",
        "72": "SBIR Company Commercialization Report Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 02/16/2023 Page 22/22",
        "73": "Richard Smith, ATC - NY Oct 21, 2024 Oct 21, 2025"
    },
    "images": [],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "atcorp.com",
        "name": "N/A",
        "phone": "N/A"
    }
}