{
    "filename": "docNAC01FB7453539f259237316bc8d999fc87234dafc533a2c1a517af0bf1d8b11d11a9c9b8029b.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0001-0052 Proposal Title: Dynamically Routed Embeddings for Knowledge Graph Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0001 Firm Information Firm Name: Black River Systems Company, Inc.\nAddress: Website: UEI: DUNS: CAGE: 162 Genesee Street , Utica, NY 13502-4324 https://www.blackriversystems.com DL9DNJ5MGXM4 111305843 1E8L6 SBA SBC Identification Number: 000000683 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 105 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_000000683 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_000000683.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [ ] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [X] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [ ] Asian [ ] White [ ] Black or African American [X] Do not wish to Provide 14.\nEthnicity of the offeror: DO NOT WISH TO PROVIDE 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud- NO related crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Title Business Name Date Milissa M.\nBenincasa Milissa Beninca Vice President Black River Systems Company, In 06/10/2024 sa c.",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?\nWas your accounting system approved by the auditing agency?\nWas a rate agreement negotiated with the auditing agency?\nWas an overhead and/or cost audit performed?\nYES Last Audit Date: 05/11/2020 YES Last Update Date: 07/09/2009 YES Last Update Date: 01/28/2021 YES Date of Overhead Audit: 05/11/2020 Date of Cost Audit: 05/11/2020 Are the rates from the audit agreement used for this firms proposal?\nNO Firm Information: Agency Firm: Address: Point of Contact (POC) Name: POC Phone: POC Email: DCAA PO Box 2783 Glenville , New York 12325 Daniel Hanley (571) 448-8528 Daniel.Hanley@dcaa.mil Upload a copy of the audit information: • DCAA Email Regarding 2021 Billing Rates Submission Acceptance.pdf VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: The work under this SBIR will demonstrate the feasibility of dynamically routing and updating embeddings via message- passing actions chosen from a learned policy network.\nIn contrast to current knowledge graph neural networks, our novel",
        "5": "approach leverages the recent advancements in message-passing graph neural networks to develop an innovative framework for training dynamic knowledge graph neural networks.\nBlack River will adapt Cooperative Graph Neural Networks to knowledge graphs, demonstrating the efficiency of incorporating user modifications to a dynamic knowledge graph and using machine learned graph representations for knowledge graph analytic tasks.\nWe will autonomously identify subgraphs impacted by user changes and efficiently update knowledge graph representations without retraining over the entire graph to support graph analytics in time-constrained environments.\nAs a result, our approach will significantly reduce the time required for analyst data correction and enhancement, and it will improve the overall efficiency and reliability of knowledge graph analytics for situational awareness, pattern of life analysis, threat detection, and targeting operations.\nUser supervision of machine learning graph analytic suggested graph changes via human-machine teaming and our MVP graph visualization and editing tool will enhance analyst trust in knowledge graph analytics.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: Current Artificial Intelligence / Machine Learning approaches for structuring and storing data in knowledge graphs are incomplete and not fully trusted by analysts, necessitating manual corrections and additions.\nThis manual process is time- consuming and inefficient, particularly in urgent scenarios.\nDeveloping a novel method to dynamically update machine learning entity/relation embeddings based on user input and enabling analyst trust in knowledge graph analytics is of paramount importance.\nSuch a solution will significantly reduce the time required for data correction and enhancement, thereby improving the overall efficiency and reliability of knowledge graph analytic tasks.\nDynamic knowledge graph technology, particularly in the context of situational awareness, pattern of life analysis, threat detection, and targeting operations, holds significant potential for commercialization.\nThis technology can be effectively transitioned to various markets, including the Department of Defense, other federal agencies, and the private sector.\nDynamic knowledge graphs address critical needs in data integration, real-time analysis, and decision-making.\nThe technology's ability to adapt and update in real-time makes it invaluable for environments where timely and accurate information is crucial.\nLaw enforcement, Homeland Security, counterterrorism, and private investigators would greatly benefit from improved tools with the ability to help resolve entities and uncover hidden connections between aliases.\nAttention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary:",
        "6": "0 List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: Graph Neural Networks, Knowledge Graphs, Human-Machine Teaming, Dynamically Routed Embeddings, Machine Learning, Message Passing Frameworks, Graph Completion, Link Prediction VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW Subcontractor POW 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\n3.\nDuring the performance of the contract, the research/research and development will be performed in the United States.\n100% 0% YES YES 4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\n8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES YES NO NO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and",
        "7": "included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\n15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO NO 16.\nWhat percentage of the principal investigators total time will be on the project?\n40.9% 17.\nIs the principal investigator socially/economically disadvantaged?\n18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nNO NO VOL I - Contact Information Principal Investigator Name: Mr.\nJoshua Siddall Phone: (315) 732-7385 Email: siddall@brsc.com Address: 162 Genesee Street , Utica, NY 13502 - 1111 Corporate Official Name: Bruce Preiss Phone: (937) 409-5098 Email: DSIP@brsc.com Address: 162 Genesee Street , Utica, NY 13502 - 1111 Authorized Contract Negotiator Name: Mrs.\nTeresa Hecht Phone: (315) 732-7385 Email: hecht@brsc.com Address: 162 Genesee Street , Utica, NY 13502 - 1111 Form Generated on 11/03/2024 07:59:58 AM",
        "8": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 Dynamically Routed Embeddings for Knowledge Graph Enhancement 1.\nIdentification and Significance of the Problem or Opportunity Volume 2: Technical Volume Black River Systems is pleased to submit this Phase I SBIR proposal to address the critical challenge of enabling user interaction with dynamic knowledge graph analytics to enhance situational awareness, pattern of life analysis, threat detection, and targeting operations in time- constrained environments.\nCurrent Artificial Intelligence / Machine Learning (AI/ML) approaches for structuring and storing data in knowledge graphs are not fully trusted by analysts, requiring manual corrections and additions.\nThis process is time-consuming and inefficient, particularly in urgent scenarios.\nDeveloping a novel method to dynamically and rapidly update ML entity/relation embeddings based on user input and improving analyst trust in AI/ML knowledge graph analytics is of paramount importance.\nOur solution to this challenge will significantly reduce the time required for data correction and enhancement, thereby improving the overall efficiency and reliability of knowledge graph analytic tasks.\nThe use of AI/ML knowledge graph analytics will earn analyst trust via human-machine teaming.\nAdditionally, enabling user interaction with dynamic knowledge graph analytics directly contributes to the advancement of the Long Range Kill Web (LRKW) Integrated Product Team (IPT) initiative, and supports the Combat ID and Collaborative Combat Systems efforts.\nBy enabling analysts to interact with and supervise graph analytics, intelligence knowledge gaps can be filled in time-constrained environments, which will expedite the identification of high-value targets to provide a combat ID and permit the use of nontraditional target engagement kill-chains thereby expanding the LRKW.\nFurthermore, by efficiently updating learned graph representations, necessary changes based on new information collected across intelligence sources as well as analyst-driven changes can be quickly incorporated into existing knowledge graph representations and used to feed predictive graph analytics.\nFigure 1: Cooperative Knowledge Graph Neural Network (Co-KGNN) Overview Page 1 of 16",
        "9": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 Our approach, summarized in Figure 1, leverages the recent development of Cooperative Graph Neural Networks1 (Co-GNNs) to develop a novel framework for training Knowledge Graph Neural Networks (KGNNs).\nThe innovation of Co-GNNs as a message-passing Graph Neural Network (GNN) is that every graph entity is viewed as a player that can choose to either ‘listen’, ‘broadcast’, ‘listen and broadcast’, or to ‘isolate’.\nThis learned message-passing approach has distinct advantages over standard message propagation techniques and offers a more flexible and dynamic message-passing paradigm.\nIn this paradigm, each entity can determine its own message- passing strategy at each network layer based on its state and the state of its neighbors, effectively exploring the graph topology during network training.\nThis novel capability to learn a message- passing strategy has two very important innovations.\nFirst, the learned message-passing addresses a common issue with knowledge graph message-passing networks.\nSince not all entity and relation types are relevant to all neighboring entities, standard message-passing techniques can degrade the learned representations of the knowledge graph.\nSecondly, the learned and adaptive message- passing enables the graph network to decide which neighbors to broadcast messages to and which neighbors to listen to.\nThrough multiple GNN layers, Co-GNNs learn useful multi-hop paths through which to pass messages.\nOur approach adapts Co-GNNs to knowledge graphs and creates a Cooperative Knowledge Graph Neural Network (Co-KGNN) for dynamic knowledge graphs.\nIn our approach, relational embeddings are merged with entity embeddings to incorporate relation type understanding into learned features for entity message-passing policy learning and action selection.\nThe learned message-passing strategy is different for each local subgraph within a knowledge graph, which enables our approach to effectively learn the entities and relations in the knowledge graph that are impacted by a user change.\nThis smart dynamic routing of updated embeddings enhances knowledge graph understanding and provides a novel method to update machine learning entity/relation embeddings based on user input in a time-constrained environment.\nEmbedding updates are efficient and only require the Co-KGNN model to update embeddings via message-passing for neighbors and relations when and where message passing is beneficial.\nThis enables the model to determine the subgraph impacted by a user change.\nBy proving the feasibility of a novel set of capabilities for user interaction with dynamic knowledge graphs and user supervision of graph analytic tools via accepting and declining suggested analytic graph changes, we will demonstrate an efficient method for updating knowledge graph representations.\nOur approach will have a profound impact on analyst operational effectiveness, enabling faster and more accurate decision-making in critical situations.\n2.\nPhase I Technical Objectives The overarching objective of the tasks defined in this proposal is to develop a novel state-of-the- art technique to enable the efficient and effective update of knowledge entity/relation embeddings in support of graph analytical algorithms for situational awareness, pattern of life analysis, threat detection, and targeting operations in time-constrained environments.\nOur approach leverages recent advancements in message-passing Graph Neural Networks to develop a novel framework for training dynamic Knowledge Graph Neural Networks.\nAt the time of this writing, and to the best of our knowledge, we are the first to adapt Cooperative Graph Neural Networks to knowledge graphs.\nWe will demonstrate the feasibility of this novel approach to efficiently incorporate user modifications to a dynamic knowledge graph into machine learned graph representations for knowledge graph analytic tasks.\nPhase I will demonstrate the utility of the updated knowledge graph representations for knowledge graph completion and link prediction tasks to showcase 1 Ben Finkelshtein, Xingyue Huang, Michael Bronstein & ˙Ismail ˙Ilkan Ceylan (2024): Cooperative Graph Neural Networks.\narXiv:2310.01267 Page 2 of 16",
        "10": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 relevance for Air Force problems.\nTable 1 summarizes the Phase I objectives, challenges, and candidate innovations specific to the development of a novel framework to efficiently update knowledge entity/relation embeddings in time-constrained environments.\nTable 1: Phase I – Objectives and Challenges Objective Provide an efficient and effective method for updating knowledge entity/relation embeddings.\nEnable analysts to make corrections to the knowledge graph datastore and manually add additional relations and entities.\nRecommend additional changes to the knowledge graph in support of graph analytics in time-constrained environments.\nChallenge 1) Determine the minimal components of a graph impacted by a user change or by algorithm added information.\n2) Efficiently update the entity/relation embeddings without retraining the entire graph.\nData structured and stored by AI/ML based capabilities are not fully trusted by analysts and can be improved by human intuition and reasoning.\nUtilize user input to suggest additional updates to surrounding entities/relations in the knowledge graph in a time-constrained manner.\nInnovation Develop a novel and adaptive knowledge graph message passing network (Co-KGNN) that efficiently updates only the parts of the graph impacted by new information.\nDevelop an analyst on-the-loop AI/ML knowledge graph analytic via Human-Machine-Teaming that enables user supervision of the knowledge graph and datastore.\nEfficiently update the parts of the graph that are impacted by new information and utilize knowledge graph completion and link prediction to suggest graph changes to the analyst.\n3.\nPhase I Statement of Work The scope of work for this Phase I SBIR is summarized in Table 2 and includes the development of the components necessary to demonstrate the feasibility of a novel framework to efficiently update knowledge entity/relation embeddings to enhance situational awareness, pattern of life analysis, threat detection, and targeting operations in time-constrained environments.\nAll work will be performed by Black River Systems at our Syracuse, NY, Utica, NY, and Lakeville, MN locations, with the Principal Investigator performing in Syracuse, NY and onsite at the Air Force Research Laboratory (ARFL) in Rome, NY.\nTask # Title 1 2 3 4 Build a Dynamic Knowledge Graph Dataset Implement a Knowledge Graph Incremental Learning Framework Train an Incremental Learning Framework on a Dynamic Knowledge Graph Develop an MVP Graph Visualization and Editing Tool Table 2: Phase I - Statement of Work Description Build an initial knowledge graph using an available open-source knowledge database such as Wikidata2 and GDELT3.\nDevelop a novel knowledge graph message-passing network that only updates the parts of the graph impacted by new information, ensuring quick adaptation for graph analytical algorithms.\nTrain the knowledge graph message-passing network on a snapshot of a dynamic knowledge graph to learn a base set of embeddings.\nContinue to evolve these embeddings over additional temporal snapshots.\nTrain a triplet scoring function and classifier for knowledge completion and link prediction.\nLeverage open-source graph visualization software to build a Minimum Viable Product (MVP) graph visualization and editing tool that allows users to visually suggest entity/relation changes and edit the knowledge graph.\n2 Wikidata: https://www.wikidata.org/wiki/Wikidata 3 The GDELT Project: https://www.gdeltproject.org/ Page 3 of 16",
        "11": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 5 6 Evaluate Model Performance Demonstrate Incremental Learning for Knowledge Graph Analytics Tasks Implement metrics to monitor the performance of the knowledge entity/relation embeddings (e.g., accuracy, graph completeness, Mean Reciprocal Rank (MRR), and Hits at N (H@N)).\nDevelop a demonstration using the MVP graph visualization tool to exemplify how a user can interact with the novel knowledge graph message- passing network for knowledge graph data correction and enhancement via human-machine teaming.\nBlack River Systems will provide the following deliverables for Phase I: (1) a kickoff meeting within 30 days of contract award; (2) monthly cost and technical status reports; (3) a feasibility study and program final technical report; (4) a program review and prototype demonstration; (5) any software, algorithms, and documentation from items developed in Phase I; and (6) a Phase II proposal.\nA schedule of tasks and major events is included in Table 3.\nTable 3: Schedule and Milestones for Phase I Task # Task Description Months in Phase I 1 6   Build a Dynamic Knowledge Graph Dataset Implement a Knowledge Graph Incremental Learning Framework      Train Framework on a Dynamic Knowledge Graph     Develop an MVP Graph Visualization and Editing Tool   Evaluate Model Performance Demonstrate Incremental Learning for Graph Analytics Tasks  Kick-off, Status Reports, and Final Review       3 2 4 5 1 2 3 4 5 6 Task 1: Build Dynamic Knowledge Graph Dataset To support the research and development of an efficient and effective method for updating knowledge entity/relation embeddings, we will build a suitable initial dynamic knowledge graph dataset that evolves temporally with training, validation, and test snapshots.\nWe plan to leverage the WikidataEvolve4 dataset, which is a benchmark dataset designed for evaluating incremental knowledge embedding models.\nIt is derived from the revision history of Wikidata, resulting in a sequence of 9 million triple operations.\nThis dataset supports the assessment of both incremental and static embedding methods by providing incremental snapshots of an evolving knowledge graph.\nIt enables the evaluation of tasks like link prediction, making it a valuable resource for comparing the performance of different embedding techniques over time.\nAs part of this task, we will leverage the code available from the WikidataEvolve Github repository to create the dataset from Wikidata, as the dataset cannot be downloaded and must be compiled from the Wikidata datastore.\nWe will then edit the training, validation, and test snapshots to support knowledge graph completion in addition to link prediction.\nKnowledge graph completion and link prediction are synergistic tasks and the trained Co-KGNN model will enable graph analytic users to request what entity a query-entity is connected to (for a specified relation type) and to supervise the results.\nIn triplet form this is (head, relation, tpred), where tpred is the tail entity predicted by the network.\nLink prediction enables the graph analytic user to request by relation type if two entities are connected; in triplet form this is (head, rpred, tail), where rpred is the predicted relation type.\nA graph neural network that is trained for knowledge graph completion and link prediction that can efficiently support dynamic updates to the knowledge graph even in time-constrained environments will enhance analysts’ understanding for situational awareness, pattern of life analysis, threat detection, 4 WikidataEvolve: https://github.com/rlafraie/WikidataEvolve Page 4 of 16",
        "12": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 and targeting operations.\nWhile Wikidata is a general knowledge database and is not a temporal event driven database that is of particular interest to Air Force problems, by leveraging the WikidataEvolve dataset instance of Wikidata we can create a temporally evolving graph to demonstrate the feasibility of our method for efficiently updating entity/relation embeddings.\nWe can then demonstrate the generalization of our novel approach to Air Force relevant problems by showcasing the utility of our method to support the Air Force relevant graph analytic problems of knowledge graph completion and link prediction.\nSince data in Wikipedia is manually entered, we will perform fuzzy matching, deduplication detection, and entity resolution to ensure a uniform graph ontology and alignment between entities by using open-source tools such as Dedupe 5 that are designed for this purpose.\nIn Phase II, other Air Force relevant and event driven dynamic knowledge graph datasets will be utilized to develop and demonstrate a full-scale prototype for adaptive, interactive dynamic knowledge graphs.\nTask 2: Implement a Knowledge Graph Incremental Learning Framework Co-GNNs are a recent advancement in graph machine learning.\nCo-GNNs comprise two jointly trained “cooperating” message-passing neural networks, 1) an environment network η (for solving the given task), and 2) an action network π (for choosing the best actions).\nCo-GNNs are parameter-efficient, meaning they share the same action network across layers and, as a result, a comparable number of parameters to their baseline GNN models.\nA Co-GNN’s action network provides a novel dynamic learned message-passing method, where entities can choose their message-passing actions (i.e., 'listen', 'broadcast', 'listen and broadcast', or 'isolate').\nCo-GNNs employ an adaptive, asynchronous message-passing scheme where each entity in the graph can decide whether to listen to a particular entity at each layer of the GNN.\nThis message scheme can be adapted to dynamic knowledge graphs to provide an effective and efficient method for updating entity/relation embeddings.\nStandard message-passing schemes used by many neural network architectures for knowledge graphs are not adaptive and require embedding updates in a synchronous manner that cannot support the efficient update of entity/relations embeddings in time-constrained environments.\nCo-GNNs provide a more flexible and adaptive message-passing paradigm with the following distinct advantages.\n1) Subgraph-specific computation graphs that permit entities to determine their own strategies based on their state, creating computation graphs tailored to specific local neighborhoods.\nThis property of Co-GNNs is advantageous for updating a dynamic graph embedding with user changes, as it provides a data driven and graph topological approach to determine the subgraph impacted by a user’s change.\n2) Mitigation of Over-Smoothing and Over-Squashing by dynamically adjusting message passing.\nCo-GNNs address this common issue in GNNs where the entity and relation features become increasingly similar as the number of neural network layers increases.\n3) Enhanced expressive power over traditional GNNs.\nCo- GNNs are more expressive and are capable of handling complex graph structures and long-range dependencies.\nTo receive information from k-hop neighbors, a network needs at least k layers, which typically implies an exponential growth of an entity’s receptive field unless a dynamic message-passing method (such as employed by Co-GNNs) is used to selectively route messages only when it is beneficial for the graph analytic task being trained.\nLong-range tasks such as knowledge graph completion and link prediction necessitate propagating information between distant entities, but the number of hops in a GNN is limited by over-smoothing.\nHowever, Co- GNNs have demonstrated effectiveness for long range tasks since they can propagate only relevant task-specific information using a learned message-passing action policy.\nCo-GNNs can efficiently 5 Dedupe: https://github.com/dedupeio/dedupe Page 5 of 16",
        "13": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 filter irrelevant information by learning to focus on a relevant and beneficial path connecting two distant entities, thereby maximizing the information flow from the source to the target entity.\nTo adapt Co-GNNs to knowledge graphs and develop the proposed Co-KGNNs, a Co-GNN’s dynamic message-passing mechanism must be updated to handle heterogeneous relational data.\nThis requires updating Co-KGNN’s action network to allow entities to learn a dynamic message- passing policy that selectively propagates information based on the type and relevance of edge relationships.\nIt also requires updating the message passing aggregation methods of the Co-GNN environment network to incorporate relation embeddings along with entity embeddings into the message information being passed.\nWe will leverage the code base for Co-GNN 6 from the published paper1 as a starting point and utilize a GNN with learned linear neural layer(s) transforms of the feature embeddings as the base architecture for both the action and environment networks.\nWe will follow the Co-GNN paper’s recommendation and use sum aggregation for message- passing the embeddings for the action network and mean aggregation for the environment network.\nBy leveraging the novel innovations and message-passing scheme of Co-GNNs, we will improve the representation and inference capabilities of dynamic knowledge graph neural networks and support the efficient update of learned knowledge graph representations in time-constrained environments.\nTask 3: Train Framework on an Event Driven Dynamic Knowledge Graph To train an initial graph network on the knowledge graph dataset created under Task 1, we will first initialize entity and relation embeddings based on entity and relation text features, respectively.\nTo do this, we will use a suitable open-source text tokenizer such as “tekken” from Minstralk.ai to convert entity and relation labeled text descriptions into dense vector representations that capture semantic information.\nOnce the initial knowledge graph featuring initial entity and relation embeddings has been created, we will save the graph and develop a data loader for PyG (PyTorch Geometric7), which is a graph ML framework built upon Pytorch.\nUsing a partition of the training dataset, we will train a GNN for knowledge graph completion and link prediction using the Co-KGNN framework from Task 2.\nFigure 2 shows the training framework for our proposed Co-KGNN architecture.\nFor each training iteration, the action network π will be trained to predict, for each entity v, a probability distribution ‘p’ over the actions: 'listen', 'broadcast', 'listen and broadcast', or 'isolate' given its state and the state of its neighbors.\nThen, for each entity v, an action will be sampled and the environment network η will be utilized to update the state of each entity in accordance with the sampled actions.\nFor each relation where the action pair chosen includes both broadcast and listen, a message is constructed using the embeddings of the broadcasting entity and the relation itself.\nThis can be represented as: mij=f(hi,eij), where (hi) is the embedding of entity (i), and (eij) is the embedding of the relation or edge between entities (i) and (j).\n(f) is the learnable message linear network that combines relation embeddings with the entity embeddings to form the message.\nPassed messages from neighbors will then be aggregated and used to update an entity’s embeddings.\nA linear neural network function (u) will be used to combine the aggregated embeddings with the entities’ existing embeddings (this update function will allow the model to weight the importance of the incoming embeddings with the current embeddings).\nWe will experiment with different message functions (f) and update functions (u), using multi-layer linear neural networks or simple aggregation functions (sum, mean, etc.).\nWe will also experiment with 6 CO-GNN: https://github.com/benfinkelshtein/CoGNN 7 PyTorch Geometric: https://pytorch-geometric.readthedocs.io/ Page 6 of 16",
        "14": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 updating the relation embeddings based on the updated entity embeddings in addition to updating the entity embeddings alone.\nThis will enable us to understand if updating the relation embeddings is beneficial for knowledge graph completion and link prediction using Co-KGNN, or if including the relation embedding in the message function (f) is sufficient.\nFigure 2: Co-KGNN Training Framework We will also stack multiple GNN layers together at various depths to demonstrate the ability of the Co-KGNN to learn long-range dependencies and predict connections between distant links (i.e., multiple hop neighbors).\nThe capability to predict connection between distant entities in a knowledge graph is particularly relevant to Air Force operations, as there may be critically important links between distant entities that that current KGNNs and techniques cannot discover.\nOnce our adapted Co-KGNN model generates expressive representations for entities and relations based on their neighbor entities and relations, the knowledge graph embeddings will then be fed as inputs into a triplet scoring function (such as TransE, DistMult, ConvE or their numerous variants).\nWe will experiment to determine the scoring function that performs the best for our dataset and tasks.\nThe triplet scoring function acts as a decoder (with the KGNN the encoder) and models the interactions among entities and relations using the KGNN learned embeddings.\nTo train our model for knowledge graph completion and for link prediction tasks, our model will be trained as a classification problem using cross-entropy as the loss function to differentiate the true triplets from the randomly generated “fake” triplets.\nA triplet consists of (head entity, a relation type, and tail entity), and if a relation is bidirectional then the head and tail entities can be interchanged.\nWhen conducting the knowledge graph completion task for a triplet (h, r, tpred), we use all entities in the knowledge graph as candidates and train the model to select the best one as Page 7 of 16",
        "15": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 the tail entity.\nFor each candidate entity t′, we will evaluate its score for the triplet (h, r, t′) and choose the entity t' with the largest score predicted by the classifier as the tail entity.\nWe will explore various thresholding methods to address predictions with low confidence as well as the use of a null class to enable the model to predict no connection.\nThe same approach will be used for link prediction (h,rpred,t).\nSpecifically, we will use all relation types in the knowledge graph as candidates and select the best relation for given head and tail entities.\nFor each candidate relation r′, we will evaluate its score for the triplet (h, r′, t) and choose the relation r' with the largest score as the link between the head and tail entities.\nIf a user adds a new entity or relation type to the knowledge graph, then that new type will be encoded with an initial embedding using a tokenizer and message-passing will be used to update the locally impacted subgraph.\nIn this way, our Co- KGNN framework enables knowledge graph completion and link prediction for even newly added entity and relation types.\nDuring training, all triplets in the training data are treated as positive samples and negative samples are generated by corrupting the triplets in the data.\nSpecifically, for a triplet (h, r, t), we will corrupt it by replacing its tail entities with other entities in the knowledge graph, in the same way relations will also be corrupted to create negative samples.\nOur proposed Co-KGNN focuses on updating only the subgraph impacted by new information, ensuring quick adaptation for knowledge completion and link prediction.\nWe will explore using periodic full-batch retraining performed asynchronously from updating embeddings due to user changes.\nThis will ensure relevant and updated embeddings in time-constrained environments.\nIt will also allow us to archive a series of user changes and combine those incremental updates together with occasional full retraining of the knowledge graph to maintain overall accuracy of the action and environment networks.\nWe will create an automated self-supervised evaluation method that removes graph entities and relations from the knowledge graph and measures the Co-KGNN predictive performance for knowledge completion and link prediction.\nThis automated self- supervised evaluation method will ensure that the Co-KGNN’s predictive performance is maintained across the entire graph after a series of local subgraph updates from user changes.\nThe novel message-passing mechanism of cooperatively training both an action network and an environment network enables the Co-KGNN’s architectures to effectively explore the graph topology while learning.\nIt is this exploration that provides a distinct and novel advantage over alternative knowledge graph neural network methods (i.e., path-based methods and translation distance models).\nPath-based methods either randomly or heuristically navigate the graph topology, but do not explicitly learn a best action for updating an entity’s/relation’s embedding based on its state and the state of its neighbors.\nEven advanced methods such as meta-paths that try to address heterogenous relation types and hyper-links that try to address long-range dependencies between multiple hop neighbors do not account for state when updating embeddings nor do they learn from the data the best policy action for each entity and relation at each KGNN layer as is done by Co-KGNNs.\nFurthermore, translation distance models do not leverage the graph’s topology and use a decoder only approach by leveraging the initial tokenizer embeddings of the graph features and only operating on triplet pairs.\nIn contrast, a Co-KGNN not only leverages the graph topology through message-passing but also learns better feature representations by acting as an encoder that considers the graphs topology.\nThe Co-KGNN will also employ (in addition to the encoder) the same decoder operations used by the translation distance models for knowledge graph completion and link prediction.\nAs a result, message-passing KGNN’s are generally accepted to perform better than translational distance only models.\nPage 8 of 16",
        "16": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 Task 4: Develop an MVP Graph Visualization and Editing Tool To develop a software application that enables users to view and edit a dynamic knowledge graph, we will leverage JavaScript libraries like Sigma.js8 and Graphology9.\nSigma.js is a powerful library for rendering and interacting with network graphs in the browser using Web Graphics Library (WebGL), which allows for smooth visualization of large graphs.\nGraphology, on the other hand, provides a robust and multipurpose graph data structure that supports various graph types and algorithms.\nBy integrating these two libraries, we will develop an interactive web application where users can add, remove, and modify graph entities and relations in real-time.\nAn example graph visualization tool that was built using Sigma and Graphology is shown in Figure 3.\nThe application can support feature functionalities such as entity dragging, zooming, and searching, making it user-friendly and efficient for managing complex knowledge graphs.\nTo synchronize this application with our knowledge graph neural network implemented in PyTorch Geometric, we will use a Representational State Transfer (RESTful) Application Programming Interface (API).\nThe API will facilitate communication between the front-end application and the backend KGNN model.\nWhen a user makes changes to the knowledge graph, these updates are sent to the server via HyperText Transfer Protocol (HTTP) requests.\nThe server, running the PyTorch Geometric model, processes these updates, performs necessary computations, and returns the results to the client.\nThis process ensures that the knowledge graph remains consistent and up-to- date with the insights derived from the KGNN, enabling more advanced features like knowledge completion, predictive analytics, and automated reasoning based on the graph's structure.\nFigure 3: Example Graph Visualization Tool Written Using Sigma and Graphology8 8 Sigma.js.\nhttps://www.sigmajs.org/ 9 graphology: https://github.com/graphology/graphology Page 9 of 16",
        "17": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 Task 5: Evaluate Model Performance To evaluate the performance of our novel Co-KGNN we will the utilize the WikidataEvolve dataset from Task 1.\nWikidataEvolve provides a dynamic knowledge graph benchmark derived from the Wikidata knowledge base, segmented into intervals to reflect the evolving nature of knowledge graphs.\nWikidataEvolve divides the data into training and test sets for each interval, allowing for the assessment of KGNNs over time.\nPerformance can be evaluated using techniques like accuracy and graph completeness, which measure the correctness of predictions and the extent to which the graph is fully represented, respectively.\nAdditionally, rank-based measures are essential for evaluating the quality of knowledge graph completion and link prediction tasks.\nMetrics such as Mean Reciprocal Rank (MRR) and Hits@N are commonly used.\nMRR assesses the average rank of correct entities, while Hits@N measures the proportion of correct entities ranked within the top N positions.\nCollectively, these metrics will provide a comprehensive view of a model's predictive performance and its ability to generalize user changes and evolve knowledge graphs.\nTask 6: Demonstrate Incremental Learning for Knowledge Graph Analytics Tasks We will demonstrate the performance of our novel Co-KGNN using the WikidataEvolve test dataset and the MVP graph visualization and editing tool from Task 4.\nThe MVP graph editing tool will be used to add a new entity and relation to the knowledge graph.\nThis change will trigger the Co-KGNN to update the embeddings for the locally impacted subgraph using dynamic message-passing and enhance the model’s knowledge representation of the graph.\nThe Co-KGNN will use these updated embeddings to suggest to the user, via the MVP graph visualization tool, entities and relations for knowledge completion and link prediction.\nThe user will be able to utilize human-machine teaming to supervise the suggested changes to the knowledge graph by accepting and declining the suggestions.\nEach accepted change will trigger the Co-KGNN to update the embeddings for the locally impacted subgraph.\nThis demonstration will showcase the utility of cooperative knowledge graph neural networks to support dynamic knowledge graph analytics that enhance situational awareness, pattern of life analysis, threat detection, and targeting operations in time-constrained environments.\n4.\nRelated Work Contract: MALICE; Contract No.\nFA8750-23-C-1506 Customer: Mr.\nBrian Romano (AFRL/RI); Value: $7,453,627; Status: Active Government Point of Contact: Brian Romano, (312) 587-4218 Description: Black River’s Fusion of Multiple Motion Information Sources (FoMMIS) prototype provides a multi-INT, graph-based fusion capability.\nFoMMIS implements a dynamic heterogenous knowledge graph to automatically store, associate, and fuse multi-INT data sources within a non-destructive framework.\nKinematic, contextual, and feature data (e.g., frequency from Signals Intelligence (SIGINT) and color-vector from Imagery Intelligence (IMINT)) are updated within the graph as it is collected and processed, accounting for uncertainty.\nAssociation decisions are delayed as evidence is accumulated, such as the emitter type probabilities for aircraft and vessels.\nWe have previously demonstrated this multi-sensor fusion capability for the maritime domain using operational Moving Target Indicator (MTI) from Joint-STARS along with correlated Electronic Intelligence (ELINT) and Automatic Identification System (AIS) tracks.\nRelevance: FoMMIS showcases Black River’s experience with developing algorithms that create and manage dynamic heterogenous knowledge graphs to support analyst decision making.\nPage 10 of 16",
        "18": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 Additionally, FoMMIS was transitioned from an engineering prototype to the National Air & Space Intelligence Center (NASIC) by the Multi-source Analytics for Lucrative Intelligence in Contested Environments (MALICE) program as an analyst tool in C/C++ with a Java graphical user interface (GUI).\nContract: GENC4I; Contract No.\nFA8750-19-C-0202 Customer: Dr.\nEdward Verenich (AFRL/RI); Value: $2,000,000; Status: Active Government Point of Contact: Edward Verenich, PhD, (315) 709-9723 Description: The GENC4I effort aims to research, develop, and demonstrate the application of revolutionary Large Language Models (LLMs) on mission relevant warfighter focused problems.\nThis will create a question-answer agent that can be interacted with to more rapidly and robustly meet warfighter needs than current processes allow.\nInitial architectural progress is leveraging unclassified use cases, but parallel near-term focus shifts to high-side classified training and deployment.\nIn both cases, the chat agents will be accessible to external users to obtain imperative feedback from the user community.\nHigh-side development is taking place on a state-of-the-art Nvidia DGX H100 system, with 8x H100 graphics processing units (GPUs) supporting 640 gigabytes (GB) of memory and 32 petaflops 8-bit floating point representation (FP8) processing, allowing for scale and efficiency of real-world applications.\nRelevance: This project demonstrates Black River’s expertise and experience for building LLM applications as well as our hardware capacity for training and serving computationally intensive machine learning models such as LLMs.\nGENC4I require serving 30-70 billion parameter LLMs, fine-tuning on unique data, and creating a user interface.\nContract: MEADE; Contract No.\nFA8750-18-C-0077 Customer: Mr.\nPaul Payson (AFRL/RI); Value: $3,284,527; Status: Completed Aug2021 Government Point of Contact: Paul Payson, (315) 330-7911 (Retired) Description: For the Multi-source Exploitation Assistant for the Digital Enterprise (MEADE) program, Black River Systems developed a digital analyst-assistant as an extensible, client-server Question and Answer (Q&A) system that provides analysts with intuitive access to the wealth of technology and information within the digital enterprise.\nThe frontend of the system features a thin-client web-interface that provides the end-user with a single, intuitive access point to the underlying multi-source analytics and data, and the backend server hosts Natural Language Processing (NLP) pipelines and an AI reasoning system.\nA Goal-Oriented Message Translator (GOMT) implements the natural language processing and understanding pipelines that use analyst language to interpret human intent from the user input and structures a machine consumable request to seek an answer.\nThe Course-of-Action (COA) Reasoning system ingests this request and employs an expert rules engine to generate and execute a course-of-action in response to the received request.\nIt interacts with data repositories and analytics to produce an answer, and then composes and communicates the answer (with context) back to the user interface.\nThe digital analyst-assistant (Q&A system) demonstrated the ability to generate answers to a Request for Information (RFI) and provided a significant reduction to the analyst’s workload when responding to an RFI.\nRelevance: The MEADE program provided valuable insights regarding operator and analyst expectations for interacting with an automated system and human-machine teaming.\nPage 11 of 16",
        "19": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 5.\nRelationship with Future Research or Research and Development The tasks under this SBIR introduce and detail a novel approach to updating machine learning entity and relation embeddings based on user input in time-constrained environments.\nThe work under this SBIR will demonstrate the feasibility of dynamically routing and updating embeddings via message-passing actions chosen from a learned policy network.\nIn contrast to current knowledge graph neural networks, our novel approach to autonomously determine impacted subgraphs and efficiently update knowledge graphs does not require retraining over the entire graph to support graph analytics in time-constrained environments.\nAs a result, our approach will significantly reduce the time required for analyst data correction and enhancement, and it will improve the overall efficiency and reliability of knowledge graph analytics for situational awareness, pattern of life analysis, threat detection, and targeting operations.\nUser supervision of ML-based suggested graph changes via human-machine teaming through a graph visualization and editing tool will enhance analyst trust in knowledge graph analytics.\nTrusted AI/ML knowledge graph analytics will contribute to the Long Range Kill Web IPT, Combat ID, and Collaborative Combat Systems efforts through the identification of high-value entities and relations to expose nontraditional target engagement kill-chain options.\nOur approach uses a learned action network that optimizes the process of updating only the embeddings of neighbors and relations where message-passing is beneficial, allowing the model to autonomously identify the subgraph affected by user changes.\nBy demonstrating these capabilities for dynamic knowledge graphs, our Phase I approach provides a solid foundation to prepare Co-KGNNs for transition to operational data and integration in an Air Force relevant environment.\nPhase II will be used to perform additional in- depth research and to develop a full-scale prototype that supports user interactive dynamic knowledge graph analytics.\nUpon successful demonstration of an effective dynamic knowledge graph updating capability, the transitioned capability will significantly enhance analyst operational effectiveness, leading to faster and more accurate decision-making in critical situations.\nKnowledge graphs are utilized by intelligence analysis for entity resolution and positive Combat ID in tools such as Thresher’s SHARK.\nOur Co-KGNN has the potential to enhance the capabilities of such tools by providing a knowledge prediction capability in time-constrained environments.\nAll proposed personnel for Phase I have active TS/SCI clearances and, as applicable for Phase II, work can be performed in our Utica facility where we can store, process, and handle classified material up to TS/SCI.\nBlack River also supports numerous efforts at the ARFL Rome Research Site and can work onsite as appropriate for the project.\nFor Phase I, we plan to leverage the WikidataEvolve dataset as it will enable us to efficiently build a suitable dataset for research and development and will allow the effort to focus on the overarching objective of this SBIR, i.e., to develop a novel method to enable efficient and effective updating of knowledge entity/relation embeddings.\nThe Global Database of Events, Language, and Tone (GDELT) from the gdeltproject.org website provides an alternative, open license database with some Air Force relevant event types; however, additional effort outside of the scope of Phase I will be required to build a suitable ML ready dataset.\nTwo other Air Force relevant sources include the Integrated Crisis Early Warning System (ICEWS) (DARPA funded) and the POLitical Event Classification, Attributes, and Types (POLECAT) (CIA funded); these are both available in Harvard’s Dataverse10 but are not licensed for commercial use.\nHowever, these additional databases will be considered as relevant Phase II open sources of data.\nAdditional areas of research for Phase II include investigating the incorporation of multimodal data features such as images, longer text (i.e., documents), speech recordings, track data, etc.\ninto the knowledge graph.\n10 Dataverse: https://data.harvard.edu/dataverse Page 12 of 16",
        "20": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 Additionally, we can explore methods to embed effective representations of these optional feature types to further improve knowledge graph reasoning as well as knowledge completion and link prediction.\nThese enhancements directly support critical Air Force problems, as multi-INT data is beneficial to many situational awareness, pattern of life analysis, threat detection, and targeting operations problems.\nAdditionally, Phase II will continue the research of Phase I to enhance Co- KGNNs by exploring graph tasks that include: developing knowledge graph reasoning (i.e., uncovering implicit relationships and facts that are not explicitly stored in the graph), updating the graph’s underlying ontology/schema, highlighting conflicting information in the graph, highlighting information gaps, and ensuring graph alignment of overlapping entities and relations for autonomous sources with disparate data standards.\n6.\nCommercialization Strategy Market Need and Size: Dynamic knowledge graph technology, particularly in the context of situational awareness and pattern of life analysis, holds significant potential for use by other Federal Agencies and even direct commercialization.\nThe key aspects of data integration, real- time analysis, and decision-making are easily transitioned, and the technology's ability to adapt and update in real-time makes it invaluable in environments where timely and accurate information is crucial.\nLaw enforcement, Homeland Security, counterterrorism, and even private investigators would greatly benefit from improved tools with the ability to accurately describe businesses and individuals and uncover hidden connections.\nThe market for law enforcement technology is substantial, with the global law enforcement software market projected to reach $18.1 billion by 2026.\nKey market needs include: • Entity Resolution: Multiple aliases can obfuscate involvement in criminal activities and terrorist organizations.\nDynamic knowledge graphs can streamline the process of entity resolution, making it easier to identify and track individuals across various datastores.\nThe entity resolution market is expected to grow significantly, driven by the increasing need for accurate data integration and analysis.\n• Pattern Discovery: For law enforcement, counterterrorism, and private investigators, the ability to discover patterns in data can lead to more effective investigations and threat assessments.\nThe global market for predictive analytics, which includes pattern discovery, is expected to reach $35.45 billion by 2027.\nWe will target our technology to the following horizontal market segments: • Law Enforcement and Homeland Security: Emphasize the technology's potential to improve entity resolution and pattern discovery, aiding in the identification and tracking of criminal activities and terrorist threats.\n• Private Sector: Target industries such as financial services, healthcare, and cybersecurity, where dynamic knowledge graphs can enhance data integration, fraud detection, and risk management.\nCommercialization Strategy: Our commercialization strategy and roadmap are flexible and not specific to any single knowledge graph domain, but rather broadly appliable to any type of knowledge graph.\nTherefore, our approach to dynamically update entity/relation embeddings and allow users to interactively supervise graph expansion and knowledge exploration via human- machine teaming will enable us to develop modular solutions that can be customized to meet the specific needs of different market segments.\nThis approach allows for flexibility and scalability, ensuring that the technology is adaptable to various use cases.\nThe use of user-friendly interfaces Page 13 of 16",
        "21": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 and visualization tools that enable end-users to interact with and easily derive insights from knowledge graphs will help us to market our solution to targeted organizations and increase awareness of the benefits of dynamic knowledge graphs.\nUse case studies and success stories will demonstrate the technology's effectiveness in real-world applications.\nAdditionally, we plan to participate in industry conferences, webinars, and workshops to showcase our technology and engage with potential customers and partners.\nDynamic knowledge graph technology has the potential to revolutionize data integration and analysis across various sectors.\nTable 4: Estimated Revenue for Commercialization across Organization Types Funding Source Est.\nRevenue Schedule Technology Status DoD Programs Federal Agencies (DHS & FBI) State Law Enforcement Commercial Sector $2M – $4M $3M – $15M $2M – $10M $5M – $18M 0-1 years 1-3 years 2-4 years 1-5 years Product Maturation & Validation (TRL 8) Test, Verify, Field (TRL 9) Transition & Field (TRL 9) Technology Adaption & Transfer Experience Transitioning and Commercializing our Technology: In the last 10 years, Black River has won 5 SBIR Phase III contracts with over $285M in ceiling.\nOn these efforts, we have received over $167M in additional investment and sales, increased our workforce from 42 to 110 employees, and increased our number of office locations from three to eight.\nOur Ninja Counter- small Unmanned Aerial Systems (C-sUAS) family of products is a notable example that demonstrates our proficiency with operational support, hardware production, software development, system integration, testing, deployment, training, and maintenance.\nWe have fielded over 600 Ninja systems to over 200 sites worldwide for all service components and many organizations including the DoD, Department of State, and Department of Homeland Security (DHS).\nWe have developed robust processes for the procurement and manufacturing of systems, testing and performance validation, field support, network certification, training, and sustainment efforts that allow us to successfully commercialize our products.\nWe have established the blueprint to commercialize innovative technology and possess the in-house expertise to adapt our processes for new markets ensuring its widespread adoption and impact.\n(1) Knowledge Graph Market Size, Growth Outlook | 2023-2032.\nhttps://www.gminsights.com/industry-analysis/knowledge-graph-market (2) Semantic Knowledge Graphing Market Size Report, 2030 - Grand View Research.\nhttps://www.grandviewresearch.com/industry-analysis/semantic-knowledge-graphing-market- report (3) Knowledge Graph Market: Global Industry Analysis - MAXIMIZE MARKET RESEARCH.\nhttps://www.maximizemarketresearch.com/market-report/knowledge-graph-market/221742/ (4) Knowledge Graph Market worth $2.4 billion by 2028 - PR Newswire.\nhttps://www.prnewswire.com/news-releases/knowledge-graph-market-worth-2-4-billion-by- 2028---exclusive-report-by-marketsandmarkets-301972530.html Page 14 of 16",
        "22": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 7.\nKey Personnel Name and Title Qualifications Josh Siddall Senior Machine Learning Engineer Principal Investigator William Carver Lead Software Engineer Michael Blount Business Director/Senior Systems Engineer Clearance TS//SCI TS//SCI TS//SCI Mr.\nJosh Siddall: Georgia Technical Institute, M.S., Electrical Engineering, 2016, will lead the proposed project.\nMr.\nSiddall brings over 13 years of experience working in various aspects of Machine Learning, Computer Vision, Intelligence, Reconnaissance, and Surveillance (ISR), Geospatial Analytics, Patterns of Life, Data Mining, Kalman Filtering, Multi-Source Fusion, Radar Systems, Electro Magnetic Spectrum Operations (EMSO), and Counter- Unmanned Aerial Systems (C-UAS).\nHe also has expertise in machine learning and signal processing techniques applied to Overhead Imagery, Radar, SIGINT, Multi-Source Fusion, and Natural Language Processing.\nMr.\nSiddall is proficient in Python, MATLAB®, Pytorch, scikit-learn, and numerous other popular python packages.\nAdditionally, he has experience processing large datasets and working with common datastore software.\nMr.\nWilliam Carver: Rochester Institute of Technology, M.S, Computer Science, 2020, is a Lead Software Engineer at Black River with four years of software engineering experience in developing a range of MTI and tracking analytic solutions.\nUnder the Track Automation for Intelligence (TAFI) program the National Geospatial-Intelligence Agency (NGA), Mr.\nCarver with maintained and advanced the deployment of the Track Generation Pipeline software to the NGA/Research cloud environment.\nFor AFRL’s Semi- Autonomous Fusion Analytics, Research, and Infrastructure (SAFARI) program, Mr.\nCarver performed a significant role in software design and development.\nMost recently, in support of NASIC, Mr.\nCarver helped lead the full stack development of our web-based Telescope capability that presents analyzed track products from emerging sensor systems and the activity indicators generated from them using our Activity Assessment capability.\nMr.\nMichael Blount: Clarkson University, B.S., Electrical Engineering, 2003, is the ISR Business Director and has been a Systems Engineer with Black River for over 20 years.\nDuring this period, he has primarily worked in the multi- dimensional data association, tracking, multi-source data fusion, sensor resource management, cloud architecture, data synchronization, information fusion analytics, and distributed processing domains.\nMr.\nBlount brings first-hand experience with Intelligence Analysts and Operations Centers through his support of the Air Force, Army, Navy, USSOCOM, and Intelligence Community agencies.\nHe has designed and implemented numerous tracking applications, developed scalable fusion systems, performed system analyses, and led system engineering efforts from prototype development to field testing.\nMr.\nBlount currently is the Principal Investigator for the Multi-source Analytics for Lucrative Intelligence in Contested Environments (MALICE) contract with AFRL, where he oversees and technically advises for several projects directly with AFRL as well as external customers.\nMr.\nBlount’s wide spectrum of understanding the needs of Intel Analysts, experience with developing complex tracking, fusion, and autonomous resource management solutions (e.g., algorithms and systems), and performance analysis allows him to bring considerable knowledge to any system engineering initiative.\n8.\nForeign Citizens.\nOnly US citizens will be involved on this project, additionally, no foreign citizens nor individuals holding dual citizenship will be involved on this project.\n9.\nFacilities/Equipment.\nBlack River Systems is a small business headquartered at our wholly owned facility in Utica, NY with smaller offices in Lakeville, MN, Syracuse, NY, and Dayton, OH.\nBlack River Systems Page 15 of 16",
        "23": "Black River Systems Company, Inc.\nDynamically Routed Embeddings for Knowledge Graph Enhancement Topic #: AF244-0001 Proposal #: F244-0001-0052 consists of 110 employees, mainly computer scientists, systems engineers, mathematicians, and other varying technical disciplines.\nWe have focused on supporting the Department of Defense (DoD) and Intelligence Community (IC) with advanced mission capabilities for more than 25 years.\nNearly all our engineers maintain a SECRET clearance and 75% are cleared at the TS/SCI level.\nThe proposed work will be performed in our Syracuse office and as applicable in Utica where we have 19,000 square feet of office and laboratory space with the ability to store, process, and handle classified material up to TS/SCI.\nBlack River also supports numerous efforts at AFRL Rome and can work on site at AFRL as appropriate for the project.\nWe own the necessary office and equipment to effectively execute research and development (R&D) programs as well as the hardware resources and machine learning compute to support proof-of-concept demonstrations.\nNo equipment purchases are required to execute the proposed project.\nBlack River Systems’ onsite ML training hardware includes dedicated servers outfitted with processors ranging from 12 to 48 cores, 64GB to 512GB of RAM, and operating four NVidia Titan-V GPUs or four NVidia 3090 RTX GPUs.\nWe also have several workstations with Titan RTX GPUs, both unclassified and classified.\nWe actively develop on government-owned workstations with A100 GPUs and cloud instances for ML training.\nThe facilities to be used for this effort meet the environmental laws and regulations of federal, state, and local governments for, but not limited to, the following groupings: airborne emissions, waterborne effluents, external radiation levels, outdoor noise, solid and bulk waste disposal practices, and handling and storage of toxic and hazardous materials.\n10.\nSubcontractors/Consultants.\nAll work will be performed by Black River Systems Company Inc.\nNo subcontractors or consultant citizenship will be involved on this project.\n11.\nPrior, Current or Pending Support of Similar Proposals or Awards.\nNo prior, current, or pending support has been provided for proposed work.\n12.\nTechnical Data Rights.\nNo technical data rights are being asserted with this proposal.\nPage 16 of 16",
        "24": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Duns Cage F244-0001-0052 AF244-0001 Dynamically Routed Embeddings for Knowledge Graph 11/03/2024 07:59:54 AM Black River Systems Company, Inc.\n162 Genesee Street , Utica, New York, 13502 https://www.blackriversystems.com DL9DNJ5MGXM4 111305843 1E8L6 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 8.68%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8.0%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) $139,803.73 $139,803.73 $0.00 $0.00 $0.00 $119,109.22 $0.00 $0.00 $0.00 $0.00 $0.00 $10,338.68 $129,447.90 $0.00 -$0.00 $10,355.83 $139,803.73 $0.00 $0.00 $0.00",
        "25": "Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 8.68%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8.0%) Total Estimated Cost TABA Base Year Direct Labor Costs Category / Individual-TR Electrical Engineer/ Principal Investigator (Joshua Siddall) Electrical Engineer/ Staff Engineer-FY25 (Michael Blount) Computer and Information Research Scientist/ Software Engineer-FY25 (William Carver) Electrical Engineer/ Principal Investigator-FY26 (Josh Siddall) Electrical Engineer/ Staff Engineer-FY26 (Michael Blount) Computer and Information Research Scientist/ Software Engineer-FY26 (William Carver) Subtotal Direct Labor (DL) Labor Overhead (rate 156.33%) x (DL) Total Direct Labor (TDL) G&A (rate 8.68%) x Base (TDL+TOH) Cost Sharing Profit Rate (8.0%) Total Estimated Cost TABA $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $74.66 284 $114.71 20 $53.01 220 $78.39 100 $120.45 8 $55.66 45 $21,203.44 $2,294.20 $11,662.20 $7,839.00 $963.60 $2,504.70 $46,467.14 $72,642.08 $119,109.22 $10,338.68 -$0.00 $10,355.83 $139,803.73 $0.00",
        "26": "Year 2 Direct Labor Costs Category / Individual-TR Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost Not Specified/ Principal Investigator (Joshua Siddall) $78.39 0 Subtotal Direct Labor (DL) Labor Overhead (rate 156.33%) x (DL) Total Direct Labor (TDL) G&A (rate 8.68%) x Base (TDL+TOH) Cost Sharing Profit Rate (8.0%) Total Estimated Cost TABA Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Kelly Murer Phone: (315) 272-5181 Phone: murer@brsc.com Title: Proposal Owner $0.00 $0.00 $0.00 $0.00 $0.00 -$0.00 $0.00 $0.00 $0.00 If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: Yes Audit Agency Name: DCAA Audit Agency POC: Daniel Hanley Address: PO Box 2783, Glenville, New York,12325 Phone: (571) 448-8528 Email: Daniel.Hanley@dcaa.mil Select the Type of Payment Desired: Partial payments",
        "27": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Electrical Engineer Principal Investigator Master's Degree Electrical Engineer Staff Engineer- FY25 Bachelor's Degree Computer and Information Research Scientist Software Engineer- FY25 Master's Degree Electrical Engineer Principal Investigator-FY26 Master's Degree Electrical Engineer Staff Engineer- FY26 Bachelor's Degree Computer and Information Research Scientist Software Engineer- FY26 Master's Degree 14 21 4 14 21 4 284 $74.66 $21,203.44 20 $114.71 $2,294.20 220 $53.01 $11,662.20 100 $78.39 $7,839.00 8 $120.45 $963.60 45 $55.66 $2,504.70 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nThe period of performance crosses two Govt FYs.\nBlack River escalates by GFY; thus, there are labor category rates for FY25 and FY26.\nDirect labor rates are based on averages per labor category.\nDirect Labor Cost ($): Year2 $46,467.14 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Not Specified Principal Investigator Master's Degree 14 0 $78.39 $0.00 Are the labor rates detailed below fully loaded?\nNO Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nThe period of performance crosses two Govt FYs.\nBlack River escalates by GFY; thus, there are labor category rates for FY25 and FY26.\nDirect labor rates are based on averages per labor category.",
        "28": "Direct Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) Overhead Comments: Black River's overhead rate is approved yearly by DCAA.\nBlack River provides an incurred cost submission at the beginning of the year to DCAA.\nIt is reviewed by DCAA and approval is provided back to Black River.\nThe incurred cost submission breaks out Black River's costs for pool and base.\nOverhead Cost ($): Year2 Labor Cost Overhead Rate (%) Overhead Comments: Black River's overhead rate is approved yearly by DCAA.\nBlack River provides an incurred cost submission at the beginning of the year to DCAA.\nIt is reviewed by DCAA and approval is provided back to Black River.\nThe incurred cost submission breaks out Black River's costs for pool and base.\nOverhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nBlack River's G&A rate is approved yearly by DCAA.\nBlack River provides an incurred cost submission at the beginning of the year to DCAA.\nIt is reviewed by DCAA and approval is provided back to Black River.\nThe incurred cost submission breaks out Black River's costs for pool and base.\nG&A Cost ($): Year2 $0.00 $46,467.14 156.33 $72,642.08 156.33 $0.00 $72,642.08 8.68 YES YES $10,338.68",
        "29": "G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nBlack River's G&A rate is approved yearly by DCAA.\nBlack River provides an incurred cost submission at the beginning of the year to DCAA.\nIt is reviewed by DCAA and approval is provided back to Black River.\nThe incurred cost submission breaks out Black River's costs for pool and base.\nG&A Cost ($): Sum of all G&A Costs is ($): Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): 8.68 YES YES $0.00 $10,338.68 - 8.0 $10,355.83 - 8.0 $10,355.83",
        "30": "Total Proposed Amount ($): $139,803.73",
        "31": "SBIR Company Commercialization Report BLACK RIVER SYSTEMS COMPANY, INC.\nDISCLAIMER: Information provided herein is privileged and confidential, and not subject to disclosure, pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nThis information shall only be used or disclosed for evaluation purposes.\nPrivileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/01/2023 Page 1/10",
        "32": "SBIR Company Commercialization Report Total Investments: Total Sales: Total Patents: $59,688,748.00 Company Information Address: $199,626,510.00 0 162 GENESEE ST UTICA, NY 13502-4324 United States Government Designated Phase III Funding: $296,828,287.00 SBC Control ID: SBC_000000683 Company Url: https://www.blackriversystems.com Company POC Title: Vice President Commercialization POC Title: Business Development Director Full Name: Milissa Benincasa Full Name: Bruce K Preiss Phone: Email: 3157327385 benincasa@brsc.com Phone: Email: (937) 409-5098 preiss@brsc.com Additional Company Information % Revenue for last fiscal year from SBIR/STTR funding: 3.0% Year Founded: 1996 Total revenue for last fiscal year: $20,000,000 - $99,999,999 # Employees Currently: 106 Year first Phase I award received: # SBIR/STTR Phase I Awards: 2002 49 Year first Phase II award received: # SBIR/STTR Phase II Awards: 2004 26 # Employees at first Phase II award: Mergers and Acquisition within past 2 years: 40 No Spin-offs resulting from SBIR/STTR: IPO resulting from SBIR/STTR | Year of IPO: No No | N/A Patents resulting from SBIR/STTR | #Patents: List of Patents: No | N/A Woman-Owned: No HUBZone-Certified: No Socially and Economically Disadvantaged: No SBC majority-owned by multiple VCOC, HF, PE firms | By what percent (%): No | N/A Additional Investment From DoD contracts/DoD subcontracts $50,316,893.00 $59,688,748.00 Last Submitted Version (02-17-2021 10:20 AM) Current Version Angel Investors Venture Capital Self Funded Private Sector Other Federal Contracts/Grants Other Sources Additional Investment Total Investment $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $50,316,893.00 $59,688,748.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/01/2023 Page 2/10",
        "33": "SBIR Company Commercialization Report Phase III Sales To DoD or DoD prime contractors Private Sector Export Markets Other Federal Agencies Additional commercialization by 3rd Party Revenue Other Customers Additional Sales Total Sales Government Phase III Contracts Last Submitted Version (02-17-2021 10:20 AM) $31,983,021.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Current Version $189,057,204.00 $0.00 $7,155,054.00 $3,414,252.00 $0.00 $0.00 $0.00 $31,983,021.00 $199,626,510.00 Funding Obligated $92,500,000.00 $296,828,287.00 Last Submitted Version (02-17-2021 10:20 AM) Current Version Commercialization Narrative Black River Systems’ business model is to research, develop, and deliver products to the DoD services, Intelligence agencies, and other federal government organizations.\nAs such, we make every attempt to use the SBIR funds and other RDT&E funds to produce capabilities and ensure technology transition to the warfighters and agencies that protect U.S.\ninterests.\nWithin the past 10 years, Black River Systems has been awarded 5 separate SBIR Phase III efforts as a direct result of successful Phase I and Phase II SBIR research.\nThese combined efforts have generated a contract ceiling value of nearly $300 million that extends out through 2025.\nThe SBIR funds have allowed Black River Systems to innovate in areas that are beneficial to operational needs throughout the government and address the latest threats facing our nation and warfighters in the field.\nWe have successfully leveraged SBIR dollars to innovate, develop, and transition systems to address critical military missions such as base defense, time critical targeting, intelligence collection, processing exploitation and dissemination, tactical forces support, and the suppression of enemy air defenses.\nBlack River Systems has leveraged these SBIR efforts to acquire additional Research and Development funds to further investigate and explore related needs of the Army, Air Force, and Navy research laboratories.\nSpecifically, Black River has recently been awarded a SBIR Phase II with the Navy related to the detection, classification, and localization of acoustic signals from torpedo-like targets and we have an Army award on the detection, tracking, and identification of Unmanned Aircraft Systems (UAS) to determine intent.\nWe also completed a Phase II SBIR for the Air Force for the autonomous Command and Control (C2) of UAS swarms.\nPhase I and Phase II SBIRs represent less than 10% of Black River’s business revenue, but we have effectively leveraged these efforts such that SBIR Phase III programs comprise over 75% of our business revenue and this continues to grow.\nThe Operational Counter-sUAS Open Systems Architecture (OCOSA) SBIR Phase III contract was awarded to us as a direct result of a Direct-to- Phase II award for Counter small-Unmanned Aerial System (C-sUAS).\nOCOSA has a current contract ceiling of approximately $282M across RDT&E, Procurement, and Operations and Maintenance funding.\nOur company has already delivered over 400 C-sUAS systems to the warfighter with many more systems on order.\nWe have delivered systems to the Army, Navy, Air Force, and several other federal agencies such as the Department of Homeland Security (DHS), Customs and Border Protection (CBP), and Department of State (DoS).\nAs the threat from sUAS keeps evolving, it is expected that this area will continue to grow as we strive to protect our forces from new threats throughout the world.\nWith these deployments, Black River Systems is now pursuing maintenance and sustainment operations to sustain these systems for the foreseeable future.\nThe C-sUAS research has also been a huge collaboration area and has created numerous partnerships, sub-contracts, teaming relationships, and related business opportunities.\nWe have created an open system architecture and Software Development Kit (SDK) to simplify collaborations and enhancements to the design and expand the signature database within the architecture.\nThe Baseline Road Assisted Tracker (BRAT) is a very successful Ground Moving Target Indicator (GMTI) tracker that was enhanced and transitioned with a SBIR Phase III contract.\nBRAT can now utilize a machine learning capability to automatically characterize sensor systems and adjust/tune the algorithms to optimize tracking for a specific radar sensor system.\nThis effort was the direct result of the New Improved Models Based on Live Environments (NIMBLE) SBIR Phase I and Phase II efforts.\nThe Phase III effort has resulted in algorithm transitions to many AF, Army, Navy, and joint commands exploiting GMTI data from multiple service platforms.\nJust within the AF; direct users include the National Air and Space Intelligence Center (NASIC) and the Global Hawk operations cell.\nWithin the Army; BRAT is used by the Grey Eagle and Distributed Common Ground System (DCGS) operational cell.\nThe National Geospatial-intelligence Agency (NGA) is also utilizing BRAT to advance their program development.\nThis has enabled Black River to continue receiving support for BRAT advancement to include further development, continuous improvement, sustainment, and network certifications.\nThe Research of Accelerated GMTI Exploitation (RAGE) SBIR Phase I and Phase II led to a SBIR Phase III effort titled “Big Data Strategies for Multi- INT Activity Based Intelligence and Real-Time Analytics (BDSA)”.\nBlack River Systems was able to take our BRAT, NIMBLE and GMTI exploitation algorithms and build them into a cloud-based architecture utilizing many state of the art, commercial, big data algorithms allowing for the distribution of processing and storage across a cloud-based architecture of compute and storage nodes.\nThis effort directly increased the transition speed of advanced BRAT, NIMBLE and other GMTI exploitation capabilities to Air Force and NGA development platforms.\nAdaptive Decisions for Active and Passive Systems (ADAPS) is a SBIR Phase III effort awarded as a direct result from prior SBIR efforts in the performance prediction of a multi-static radar system.\nThis led to a 10 year, $15M, contract with AFRL to perform data collection, analysis, and performance predictions across a wide range of multi-static radars to include pod-based bistatic radars, over-the-horizon radars, and ground- based systems.\nAs a result, Black River has transitioned this research analysis to many government organizations such as DARPA, NASIC, Air Force Life Cycle Management Center (AFLCMC), and others.\nBlack River Systems has a robust and extensive commercialization strategy that includes transitions across multiple services, joint Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/01/2023 Page 3/10",
        "34": "SBIR Company Commercialization Report organizations, intelligence agencies, and many other federal agencies such as DHS, DoS, and the Bureau of Prisons (BoP).\nOur commercialization strategy includes both direct transitions as well as transitions to other contractors in direct support of specific customers.\nWe have developed robust processes for the procurement and manufacturing of systems, testing and performance validation, field support to the warfighters, network certification processes, training, and sustainment efforts that allow us to successfully commercialize our products.\nCommercialized Awards Listed below are the sales revenue and investment details resulting from the technology developed under these SBIR/STTR awards.\nPerformance Prediction for Airborne Multistatic Radar 1 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2013 Subsidiaries No | N/A N/A Topic #: AF121-163 Contract/Grant #: FA8650-13-C-1620 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Government Designated Phase III Contracts Funding Agreement / Contract # FA8650-17-C-1050 Agency USAF FA8650-15-C-1838 USAF Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $14,571,757.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $14,571,757.00 Sales Total: Project Title Year Awarded Passive Radar Illuminator Selector Manager Adaptive Decisions for Active/Passive Sensing (ADAPS) 2018 2015 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Funding Obligated $3,500,000.00 $11,071,757.00 Mitigation of Small Unmanned Aircraft Systems (sUAS) Threats 2 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2017 Subsidiaries No | N/A N/A Topic #: AF162-D001 Contract/Grant #: FA8650-17-C-9205 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nYes a.\nPrimary Agency: Air Force b.\nSystem/Program: Ninja c.\nPhase III Contract #: Phase III Sales To FA8750-19-C-0040 $22,886,061.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $183,654,472.00 $3,414,252.00 $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/01/2023 Page 4/10",
        "35": "SBIR Company Commercialization Report Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $7,155,054.00 $0.00 $0.00 $22,886,061.00 Sales Total: $194,223,778.00 Government Designated Phase III Contracts Funding Agreement / Contract # FA8750-19-C-0040 Agency USAF Project Title Year Awarded Funding Obligated Operational Counter-small Unmanned Aircraft System Open Systems Architecture (OCOSA) 2019 $282,256,530.00 Data Fusion Handoff 3 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2009 Subsidiaries No | N/A N/A Topic #: N06-109 Contract/Grant #: FA8750-09-C-0024 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $933,782.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $933,782.00 Sales Total: Validation of Automatic Ground Moving Target Indicator Exploitation Algorithms Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2015 Subsidiaries No | N/A N/A Topic #: AF131-038 Contract/Grant #: FA8750-15-C-0200 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $1,172,269.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/01/2023 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 4 of 15 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 5/10",
        "36": "SBIR Company Commercialization Report Investment Total: $1,172,269.00 Sales Total: $0.00 GMTI Forensics Analysis Tools 5 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2008 Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Topic #: AF071-061 Contract/Grant #: FA8750-08-C-0128 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: NASIC DMS b.\nSystem/Program: NA c.\nCost Savings: $0.00 d.\nCost Savings Type: life-cycle e.\nExplanation: This technology enables the users to do their job much more efficiently.\nThey spend 70% approximately of their time doing this capability manually and now they can do many more things and do a much better analysis.\nThe number cannot be calculated at thi Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Phase III Sales To $4,755,472.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $4,755,472.00 Sales Total: Integration of Human Cognition Agency/Branch: DOD / AF Program/Phase/Year: N/A/N/A/2008 Topic #: F071-083 Contract/Grant #: F8750-08-C-0112 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $1,410,723.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $1,410,723.00 Sales Total: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/01/2023 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 6 of 15 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 6/10",
        "37": "SBIR Company Commercialization Report Intelligent Integration of Human Cognition into the Fused Reasoning Process 7 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase I/2007 Subsidiaries No | N/A N/A Topic #: AF071-083 Contract/Grant #: FA8750-07-C-0100 Achieved a cost saving or cost avoidance?: Yes a.\nAgency/End user: NASIC b.\nSystem/Program: NA c.\nCost Savings: $0.00 d.\nCost Savings Type: None Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo e.\nExplanation: Analysts spend 70% more of their time analyzing rather than just doing the manual labor because of this work.\nAdditional Investment From DoD contract/subcontract: Other Federal contract/grants: Phase III Sales To $2,772,551.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $2,772,551.00 Sales Total: Innovative Multi-Channel Processing for Detection of Slow Moving and Crossing Targets Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: SBIR/Phase II/2007 Topic #: AF05-228 Contract/Grant #: W31P4Q-07-C-0207 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 8 of 15 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $5,142,009.00 Dod or DoD prime contractors: $2,683,204.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $5,142,009.00 Sales Total: $2,683,204.00 Airborne Graph Analytics Applications for Multi-sensor Fusion 9 of 15 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/01/2023 Page 7/10",
        "38": "SBIR Company Commercialization Report and Integration Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2018 Subsidiaries No | N/A N/A Topic #: AF161-131 Contract/Grant #: FA8650-18-C-1131 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $461,001.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $461,001.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Adaptive Tasking of Radar and Optical Sensors 10 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2006 Subsidiaries No | N/A N/A Topic #: AF05-025 Contract/Grant #: FA8718-06-C-0021 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $1,378,176.00 Dod or DoD prime contractors: $993,763.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $1,378,176.00 Sales Total: $993,763.00 Cloud Data Synchronization with Limited Bandwidth Communications 11 of 15 Agency/Branch: Department of Defense/Special Operations Command Program/Phase/Year: SBIR/Phase II/2018 Topic #: SOCOM163-005 Contract/Grant #: H92222-18-C-0014 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Phase III Sales To $100,000.00 Dod or DoD prime contractors: $0.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/01/2023 Page 8/10",
        "39": "SBIR Company Commercialization Report Other Federal contract/grants: $0.00 Other Federal Agencies: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $100,000.00 Sales Total: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Fusion of Multiple Motion Information Sources 12 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2017 Subsidiaries No | N/A N/A Topic #: AF161-056 Contract/Grant #: FA8750-18-C-0210 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $100,000.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $100,000.00 Sales Total: Space Based Radar (SBR) Bistatic Space Time Adaptive Processing (STAP) Agency/Branch: Department of Defense Manufacturing related Program/Phase/Year: SBIR/Phase II/2004 Subsidiaries No | N/A N/A Topic #: AF03-092 Contract/Grant #: FA8750-04-C-0231 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $100,000.00 Dod or DoD prime contractors: $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $100,000.00 Sales Total: Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/01/2023 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 13 of 15 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 Page 9/10",
        "40": "SBIR Company Commercialization Report Reducing Time for Forensic Analysis of Multi Sensor GMTI from Days to Hours 14 of 15 Agency/Branch: Department of Defense/Air Force Manufacturing related Program/Phase/Year: SBIR/Phase II/2012 Subsidiaries No | N/A N/A Topic #: AF103-053 Contract/Grant #: FA8750-12-C-0084 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo Phase III Sales To $3,614,302.00 Dod or DoD prime contractors: $1,274,475.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $3,614,302.00 Sales Total: $1,274,475.00 Anomaly Detection Agency/Branch: Department of Defense/Defense Advanced Research Projects Agency Program/Phase/Year: SBIR/Phase II/2009 Topic #: SB072-020 Contract/Grant #: W31P4Q-09-C-0278 Manufacturing related Subsidiaries No | N/A N/A Other contributing SBIR/STTR awards N/A Used in Federal or acquisitions program?\nNo 15 of 15 Achieved a cost saving or cost avoidance?: No Additional Investment From DoD contract/subcontract: Other Federal contract/grants: Angel Investors: Venture Capital: Self-Funded: Private Sector: Other Sources: Investment Total: Phase III Sales To $290,645.00 Dod or DoD prime contractors: $451,290.00 $0.00 Other Federal Agencies: $0.00 Private Sector: $0.00 Export Market: $0.00 3rd Party Revenue: $0.00 Other Customers: $0.00 $0.00 $0.00 $0.00 $0.00 $0.00 $290,645.00 Sales Total: $451,290.00 Privileged and confidential and not subject to disclosure pursuant to 15 U.S.C.\n638 (k)(4) and 5 U.S.C.\n552.\nLast Updated On: 06/01/2023 Page 10/10",
        "41": "Kelly Murer, Black River Systems Company, Inc.\nNov 03, 2024 Nov 03, 2025"
    },
    "images": [
        {
            "page": 8,
            "image_file": "docNAC01FB7453539f259237316bc8d999fc87234dafc533a2c1a517af0bf1d8b11d11a9c9b8029b_page8_img1.png",
            "hash": "e7b2184f38b896ac",
            "position": "Bottom Center"
        },
        {
            "page": 14,
            "image_file": "docNAC01FB7453539f259237316bc8d999fc87234dafc533a2c1a517af0bf1d8b11d11a9c9b8029b_page14_img1.png",
            "hash": "f0a11ff00f0fe991",
            "position": "Middle Center"
        },
        {
            "page": 16,
            "image_file": "docNAC01FB7453539f259237316bc8d999fc87234dafc533a2c1a517af0bf1d8b11d11a9c9b8029b_page16_img1.jpeg",
            "hash": "ba8bc5171d300e3f",
            "position": "Middle Center"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "blackriversystems.com",
        "name": "N/A",
        "phone": "N/A"
    }
}