{
    "filename": "Proposal_F244-0002-0320.pdf",
    "text_by_page": {
        "2": "Small Business Innovation Research(SBIR) Program - Proposal Cover Sheet Disclaimer Knowingly and willfully making any false, fictitious, or fraudulent statements or representations may be a felony under the Federal Criminal False Statement Act (18 USC Sec 1001), punishable by a fine of up to $10,000, up to five years in prison, or both.\nSBIR Phase I Proposal Proposal Number: F244-0002-0320 Proposal Title: Low C-SWaP MWIR Detectors and Focal Plane Arrays Agency Information Agency Name: Command: USAF AFMC Topic Number: AF244-0002 Firm Information Firm Name: Bryka Skystocks LLC Address: Website: UEI: DUNS: CAGE: 549 Cedar Street , Newington, CT 06111-1814 brykagp.com RB4XFCMC9KZ7 967264990 6afx5 SBA SBC Identification Number: 002227699 Firm Certificate OFFEROR CERTIFIES THAT: 1.\nIt has no more than 500 employees, including the employees of its affiliates.\n2.\nNumber of employees including all affiliates (average for preceding 12 months) 3.\nThe business concern meets the ownership and control requirements set forth in 13 C.F.R.\nSection YES 3 YES 121.702.\n4.\nVerify that your firm has registered in the SBAS Company Registry at www.sbir.gov by providing the SBC_002227699 SBC Control ID# and uploading the registration confirmation PDF: Supporting Documentation: • SBC_002227699.pdf",
        "3": "5.\nIt has more than 50% owned by a single Venture Capital Owned Company (VCOC), hedge fund, or private equity firm 6.\nIt has more than 50% owned by multiple business concerns that are VOCs, hedge funds, or private NO NO equity firms?\n7.\nThe birth certificates, naturalization papers, or passports show that any individuals it relies upon to YES meet the eligibility requirements are U.S.\ncitizens or permanent resident aliens in the United States.\n8.\nIs 50% or more of your firm owned or managed by a corporate entity?\n9.\nIs your firm affiliated as set forth in 13 CFR Section 121.103?\n10.\nIt has met the performance benchmarks as listed by the SBA on their website as eligible to participate 11.\nFirms PI, CO, or owner, a faculty member or student of an institution of higher education NO NO YES NO 12.\nThe offeror qualifies as a: [ ] Socially and economically disadvantaged SBC [X] Women-owned SBC [ ] HUBZone-owned SBC [ ] Veteran-owned SBC [ ] Service Disabled Veteran-owned SBC [ ] None Listed 13.\nRace of the offeror: [ ] American Indian or Alaska Native [ ] Native Hawaiian or Other Pacific Islander [X] Asian [ ] White [ ] Black or African American [ ] Do not wish to Provide 14.\nEthnicity of the offeror: NON- HISPANIC 15.\nIt is a corporation that has some unpaid Federal tax liability that has been assessed, for which all FALSE judicial and administrative remedies have not been exhausted or have not lapsed, and that is not being paid in a timely manner pursuant to an agreement with the authority responsible for collecting the tax liability: 16.\nFirm been convicted of a fraud-related crime involving SBIR and/or STTR funds or found civilly liable NO for a fraud-related violation involving federal funds: 17.\nFirms Principal Investigator (PI) or Corporate Official (CO), or owner been convicted of a fraud-related NO crime involving SBIR and/or STTR funds or found civilly liable for a fraud-related violation involving federal funds: Signature: Printed Name Signature Suresh Mirchandani Suresh Mirchan Title COO Business Name Date Bryka Skystocks LLC 06/13/2022 dani",
        "4": "Audit Information Summary: Has your Firm ever had a DCAA review?NO VOL I - Proposal Summary Summary: Proposed Base Duration (in months): 6 Technical Abstract: Bryka Skystocks LLC proposes a cutting-edge, cost-effective, and high-sensitivity thermal imaging solution based on HgTe Colloidal Quantum Dot (CQD) Focal Plane Array (FPA) technology for mid-wave infrared (MWIR) detection, designed specifically for U.S.\nAir Force applications.\nLeveraging over 20 years of experience in advanced sensor technology and quantum dot innovations, Bryka Skystocks aims to address the Air Force's need for scalable, lightweight, and low-cost MWIR detection systems, enhancing situational awareness and target tracking across large operational areas.\nThe proposed solution uses a solution-processed HgTe CQD layer on a CMOS-compatible silicon substrate, enabling integration with standard CMOS readout integrated circuits (ROICs).\nEach FPA array integrates a black silicon layer and gold reflector structure to increase light absorption and improve sensitivity, all without the need for cryogenic cooling.\nThis design ensures high absorption in the 3-5 µm MWIR range, allowing for detailed thermal imaging, effective in low-light, high- contrast environments critical for defense missions.\nTo ensure large-area coverage and coherence, we employ a distributed architecture where multiple synchronized FPA panels form a cohesive, wide-area imaging system.\nEach panel operates independently but is synchronized for real-time data coherence, supported by digital signal processors (DSPs) for effective signal alignment.\nOur approach includes optional thermoelectric cooling, minimizing power usage and supporting deployment on lightweight, battery-operated platforms.\nThis scalable design provides a flexible, high-resolution MWIR imaging solution suited for diverse defense applications, supporting enhanced reconnaissance, target acquisition, and tracking.\nAnticipated Benefits/Potential Commercial Applications of the Research or Development: DoD Applications: Target Tracking and Missile Defense",
        "5": "Surveillance and Reconnaissance Combat Situational Awareness.\nPerimeter Security and Early Warning Systems Non-DoD Applications: Environmental Monitoring and Disaster Management Industrial Inspection and Predictive Maintenance Medical Imaging and Diagnostics Automotive Night Vision Systems Attention: Disclaimer: For any purpose other than to evaluate the proposal, this data except proposal cover sheets shall not be disclosed outside the Government and shall not be duplicated, used or disclosed in whole or in part, provided that if a contract is awarded to this proposer as a result of or in connection with the submission of this data, the Government shall have the right to duplicate, use or disclose the data to the extent provided in the funding agreement.\nThis restriction does not limit the Government's right to use information contained in the data if it is obtained from another source without restriction.\nThis restriction does not apply to routine handling of proposals for administrative purposes by Government support contractors.\nThe data subject to this restriction is contained on the pages of the proposal listed on the line below.\nAddition: Enter the page numbers separated by a space of the pages in the proposal that are considered proprietary: List a maximum of 8 Key Words or phrases, separated by commas, that describe the Project: HgTe, Colloidal Quantum Dot, Focal Plane Array, MWIR detection, CMOS, real-time data coherence VOL I - Proposal Certification Summary: 1.\nAt a minimum, two thirds of the work in Phase I will be carried out by your small business as defined by 13 C.F.R YES Section 701-705.\nThe numbers for this certification are derived from the budget template.\nTo update these numbers, review and revise your budget data.\nIf the minimum percentage of work numbers are not met, then a letter of explanation or written approval from the funding officer is required.\nPlease note that some components will not accept any deviation from the Percentage of Work (POW) minimum requirements.\nPlease check your component instructions regarding the POW requirements.\nFirm POW 100%",
        "6": "Subcontractor POW 0% 2.\nIs primary employment of the principal investigator with your firm as defined by 13 C.F.R Section 701-705?\nYES 3.\nDuring the performance of the contract, the research/research and development will be performed in the YES United States.\n4.\nDuring the performance of the contract, the research/research and development will be performed at the YES offerors facilities by the offerors employees except as otherwise indicated in the technical proposal.\n5.\nDo you plan to use Federal facilities, laboratories, or equipment?\n6.\nThe offeror understands and shall comply with export control regulations.\n7.\nThere will be ITAR/EAR data in this work and/or deliverables.\nNO YES NO 8.\nHas a proposal for essentially equivalent work been submitted to other US government agencies or DoD NO components?\n9.\nHas a contract been awarded for any of the proposals listed above?\n10.\nFirm will notify the Federal agency immediately if all or a portion of the work authorized and funded under this proposal is subsequently funded by another Federal agency.\nNO YES 11.\nAre you submitting assertions in accordance with DFARS 252.227-7017 Identification and assertions use, NO release, or disclosure restriction?\n12.\nAre you proposing research that utilizes human/animal subjects or a recombinant DNA as described in DoDI NO 3216.01, 32 C.F.R.\nSection 219, and National Institutes of Health Guidelines for Research Involving Recombinant DNA of the solicitation: 13.\nIn accordance with Federal Acquisition Regulation 4.2105, at the time of proposal submission, the required YES certification template, \"Contractor Certification Regarding Provision of Prohibited Video Surveillance and Telecommunications Services and Equipment\" will be completed, signed by an authorized company official, and included in Volume V: Supporting Documents of this proposal.\nNOTE: Failure to complete and submit the required certifications as a part of the proposal submission process may be cause for rejection of the proposal submission without evaluation.\n14.\nAre teaming partners or subcontractors proposed?\nNO 15.\nAre you proposing to use foreign nationals as defined in 22 CFR 120.16 for work under the proposed effort?\nNO 16.\nWhat percentage of the principal investigators total time will be on the project?\n17.\nIs the principal investigator socially/economically disadvantaged?\n25% NO 18.\nDoes your firm allow for the release of its contact information to Economic Development Organizations?\nYES VOL I - Contact Information Principal Investigator Name: Mr.\nSuresh Mirchandani Phone: (732) 851-9034 Email: aviationsales@brykagp.com",
        "7": "Address: 549 Cedar Street , Newington, CT 06111 - 1814 Corporate Official Name: Mrs.\nKarishma Mirchandani Phone: (732) 851-9034 Email: avationsales@brykagp.com Address: 549 Cedar Street , Newington, CT 06111 - 1814 Authorized Contract Negotiator Name: Mrs.\nKarishma Mirchandani Phone: (732) 851-9034 Email: avationsales@brykagp.com Address: 549 Cedar Street , Newington, CT 06111 - 1814 Form Generated on 11/06/2024 11:32:51 AM",
        "8": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nimaging and 1.0 Identification and Significance of the Problem or Opportunity: Concept of Operation (CONOPS): The concept of operation (CONOPS) for the U.S.\nAir Force’s proposed HgTe CQD-based MWIR FPA technology involves deploying low-cost, distributed FPA arrays to enhance infrared imaging sensitivity and target tracking capabilities across defense and reconnaissance platforms.\nThese arrays would integrate seamlessly with existing MWIR targeting systems on platforms such as the MQ-9 Reaper and SBIRS satellites, using the scalable, solution-processed HgTe CQD detectors to provide cost-effective, wide-area thermal imaging.\nThe distributed FPA arrays are designed to increase the detection aperture, synchronizing multiple FPA panels across diverse locations to improve spatial coherence and signal fidelity.\nBy focusing on target coherence and multi-array synchronization, this system will enable accurate real-time tracking of low-signature or fast-moving targets, crucial for surveillance and missile defense applications.\nOperating as a sparse array configuration, these HgTe CQD FPAs are optimized for minimal power consumption, utilizing lightweight thermoelectric cooling systems to maintain target sensitivity without requiring heavy cryogenic infrastructure.\nThis low-power, distributed design will enhance the Air Force’s capability to monitor large areas and perform high-fidelity imaging in contested environments, all while minimizing system costs and logistical requirements.\nFigure 1 Sensor materials used for detection Current State of the Art: The U.S.\nAir Force and Department of Defense rely on advanced MWIR Focal Plane Array (FPA) systems that integrate cryogenically-cooled, epitaxial semiconductor materials for high-sensitivity infrared detection.\nThese state- of-the-art systems use HgCdTe (mercury cadmium telluride) and InSb (indium antimonide) detectors, which offer exceptional performance in the mid-wave infrared (MWIR) range (3-5 µm), essential for applications in surveillance, missile defense, and target track ing.\nCryogenic cooling, often using Stirling or Joule-Thomson cryocoolers, is necessary to maintain low noise levels and high sensitivity, as these materials generate significant thermal noise at higher temperatures.\nCritical systems include space-based infrared (SBIR) sensors, such as those used in the Space- Based Infrared System (SBIRS) and Overhead Persistent Infrared (OPIR) satellites, as well as airborne platforms like the MQ-9 Reaper and RC-135 Rivet Joint.\nThese sensors provide high-resolution MWIR imaging and tracking capabilities across a wide field of view, supporting real-time threat detection and monitoring.\nHowever, the reliance on expensive substrates, epitaxial growth processes, and cryogenic cooling increases overall system costs and complexity, limiting the scalability of such systems for broader or more compact platforms.\nWhile these FPAs deliver robust performance for missile detection and tracking, ongoing research into HgTe CQD and PbSe-based detectors aims to develop more scalable, lower-cost alternatives that could operate effectively at higher temperatures, reducing the need for cryogenic cooling and enabling deployment in expendable or smaller defense platforms.\nLimitations of the current state of the Art: High Cost: Current MWIR FPAs use epitaxial compound semiconductor materials that require cryogenic cooling to reduce noise, which increases costs.\nMajor cost factors include high-quality substrates, complex material deposition, fabrication, die-level hybridization, and the cryocooler.\nLow Operating Temperature Requirement: To achieve the desired noise performance, these FPAs operate at cryogenic temperatures, often requiring cooling below 77 K.\nThis cooling setup not only adds to the cost but also increases system size and weight, limiting deployment on low-cost or expendable platforms.\nLimited Material Stability and Process Maturity: Emerging alternatives like PbSe-based photoconductors and mercury chalcogenide CQDs (HgTe and HgSe) require significant development in areas such as material stability and process optimization, particularly for small-pixel fabrication and understanding carrier dynamics.\nNoise and Dark Current Challenges: For both PbSe and CQD-based detectors, managing 1/f noise and achieving low dark current levels are significant challenges.\nThese factors impact the detector's sensitivity and are crucial for achieving a NEP target below 100 fW/Hz^1/2.\n1",
        "9": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nComplexity in ROIC Integration: Integration with ROIC (Readout Integrated Circuit) at the wafer scale, especially for photoconductors, requires specialized designs to maintain performance at small pixel scales.\nThis ROIC adaptation for photoconductor architectures adds design and manufacturing complexity.\nReliance on Cryogenic Cooling for CQDs: While mercury chalcogenide CQDs operate at slightly higher temperatures than traditional epitaxial materials, they still require some level of cryocooling to manage dark current and noise, which complicates design and increases overall system costs.\ninfrared requirements for mid-wave Figure 2 Bryka Skystocks proposed solution Proposed Technology: Bryka Skystocks LLC., which has 20 years with a robust background in sensor and quantum dot technology development for defense applications, proposes a cost-effective, high-sensitivity thermal imaging solution based on HgTe Colloidal Quantum Dot (CQD) Focal Plane Array (FPA) technology (MWIR) detection.\nThis HgTe CQD FPA technology is engineered to provide reliable MWIR imaging capabilities that are scalable, lightweight, and optimized for low-cost production, addressing critical infrared for advanced detection in U.S.\nAir Force applications.\nHgTe CQD-Based FPA Panels: Bryka Skystocks LLC’s HgTe CQD FPAs use a scalable thin-film deposition method to produce arrays with high efficiency in the MWIR band (3-5 µm), suitable for thermal imaging, tracking, and target acquisition.\nThis approach offers an ideal solution for enhanced sensitivity and wide-area thermal imaging without cryogenic cooling.\nMid-Wave Infrared Compatibility: Optimized for the 3-5 µm MWIR range, the HgTe CQD-based FPA panels enable high-resolution thermal detection, supporting broad-area target tracking and situational awareness across various defense and surveillance applications.\nThe optimized MWIR sensitivity facilitates effective performance in low-light and high-contrast scenarios, improving target discrimination.\nSolution-Based Processing for Cost Reduction: Using cost-efficient solution processing for HgTe CQDs, Bryka Inc.\nhas developed FPA panels that balance performance with low production costs, allowing for broad deployment across multiple platforms without significantly increasing budget constraints.\nThermoelectric Cooling for Low Power Consumption: These CQD panels operate at higher temperatures (around 200 K) with optional thermoelectric cooling, eliminating the need for bulky cryogenic systems.\nThis provides efficient thermal imaging at lower power, enabling use on small, battery-operated, and lightweight platforms.\nDistributed Focal Plane Array System: The proposed solution adopts a distributed architecture, with multiple FPA panels deployed across various platforms, allowing for synchronized, large-area MWIR coverage.\nIndependent Front-Ends: Each FPA panel operates independently but synchronizes data to ensure coherence, enabling high-resolution thermal imaging and real-time tracking across wide operational regions.\nThis setup supports platform orientation and deployment location adaptability, enhancing versatility across defense missions.\nDigital Signal Processing and Synchronization: Each FPA panel includes digital processing components to enhance signal clarity and coherence across the array.\nThis is crucial for applications requiring precise target detection and tracking.\nDistributed Phased-Array Front-Ends: The proposed solution employs a distributed phased-array architecture, where multiple phased-array front-ends are positioned across a wide area.\nEach front end operates independently but synchronized, forming a highly sensitive, scalable radar system.\nIndependent Front-Ends: Each front-end includes 64-channel transmit-receive (TR) modules and 64-channel signal processors.\nThese components work together to process incoming radar signals, perform beamforming, and synchronize with other panels in the array.\nModular and Adaptable Layout: These distributed front-ends allow for adaptive deployment.\nPanels can be positioned at various locations, allowing the system to cover different geographical areas depending on mission requirements.\nThis flexibility helps create a wide-area radar system to detect missile threats across vast regions.\nDigital Processing: Each front-end features high-speed digital signal processors (DSPs) that handle real-time radar data processing.\nThis includes tasks such as down-conversion, filtering, and beamforming.\nThe system uses coherent 2",
        "10": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nFigure 3: Specific detectivity of various QD Detectors processing, ensuring that the radar signals collected from multiple panels are synchronized and combined to produce a unified radar picture.\nSynchronized Wide-Area Thermal Imaging: A key feature of the HgTe CQD-based FPA system is its synchronized wide-area imaging capability, allowing for real-time, coherent thermal data capture across multiple platforms.\nThis approach ensures rapid thermal scanning of large areas, supporting responsive situational awareness.\nAccurate Data Synchronization: The system achieves synchronization across multiple FPAs, maintaining data coherence and precision.\nThis is essential for aligning thermal images from different viewpoints, ensuring consistent, accurate detection of low-signature and fast- moving targets.\nWide-Field Scanning: The FPA panels perform efficient wide-field scanning, enabling coverage over large areas with minimal latency.\nThis rapid scanning capability is critical for real-time threat detection, particularly in high- mobility defense scenarios.\nSystem Scalability and Modular Design: The proposed HgTe CQD FPAs are modular and scalable, supporting seamless expansion by integrating additional panels to broaden MWIR coverage.\nThis scalability allows for mission- specific deployment adjustments, ensuring adaptability for various Air Force applications.\nCommercial CQD processing technology reduces per-unit costs, making the system viable for large-scale deployment without compromising performance.\nIntegration with Air Force Systems: Bryka Skystocks LLC’s HgTe CQD FPAs are designed for easy integration with existing Air Force EO/IR systems, providing a cost-effective means of enhancing thermal detection capabilities across surveillance and target acquisition networks.\nThis compatibility with Air Force platforms allows for expanded sensor capabilities to support various applications within the Air Force’s layered defense infrastructure, from survey to missile warning.\nCost Efficiency: By leveraging solution-processed HgTe CQDs, Bryka Skystocks LLC.\nAchieves significant cost reductions, making this FPA technology suitable for broad deployment across multiple platforms.\nThe scalable and modular nature of the design enables flexible expansion, allowing for wide-area thermal imaging coverage at a fraction of the cost of traditional MWIR systems.\nUnique Position: Bryka Skystocks LLC.\nBrings specialized expertise in advanced infrared sensor development, drawing from successful projects with the U.S.\nDepartment of Defense and other government agencies.\nRecently, Bryka Skystocks LLC.\nhas advanced HgTe Colloidal Quantum Dot (CQD) technology in collaboration with the U.S.\nAir Force on high-sensitivity, mid-wave infrared (MWIR) focal plane arrays (FPAs).\nThis technology development included creating solution-processed HgTe CQDs with optimized quantum efficiency across the 3-5 µm range, tailored for high-sensitivity MWIR imaging.\nThe FPA panels are specifically engineered for stable, high-resolution thermal imaging without cryogenic cooling.\nThey are suitable for demanding applications like airborne and satellite surveillance, target acquisition, and threat detection in defense environments.\nBryka Skystocks LLC.\nLeverages its experience in material science, sensor design, and system integration to refine HgTe CQD-based FPAs for wide-area MWIR coverage, combining modularity and scalability with efficient power management.\nBy drawing on this expertise, Bryka Inc.\nis well-positioned to deliver cost-effective, advanced MWIR FPA solutions that address the U.S.\nAir Force’s requirements for low-cost, high-performance thermal imaging across various mission-critical applications.\nOverview of the 3-Phase Program and Key Outcomes: In Phase 1, Bryka Skystocks LLC, will create a comprehensive reference model for the proposed HgTe Colloidal Quantum Dot (CQD) Focal Plane Array (FPA) technology aimed at mid-wave infrared (MWIR) detection, specifically designed for operation at temperatures above 200 K.\nThis initial phase will survey current MWIR technologies to evaluate the scalability and suitability of HgTe and PbSe CQDs for low-C-SWaP (Cost, Size, Weight, and Power) applications.\nKey performance metrics such as Noise Equivalent Power (NEP), dark current, and quantum efficiency (EQE) will be defined, and a testbed will be constructed to assess multi-array coherence and stability.\nIn Phase 2, Bryka Skystocks LLC.\nwill design a complete distributed FPA system, integrating independently operable CQD arrays with thermoelectric cooling to achieve high-resolution imaging and efficient thermal stability without relying on 3",
        "11": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\ncryogenic systems.\nRigorous testing will validate NEP, dark current, and system stability.\nPhase 3 will expand the technology for broader deployment, aiming to reach target pixel operability (>98%) and meet scalability requirements for real-world applications.\nThis phase will confirm coherence, signal processing, and MWIR imaging performance across the 3-5 µm range, demonstrating the system’s robustness for surveillance, reconnaissance, and threat detection applications, aligned with Air Force mission requirements.\n2.0 Technical objective: Technical Objective 1: Develop and Simulate a Comprehensive Reference Model for HgTe CQD FPA Technology: We will develop and simulate a comprehensive reference model for the proposed HgTe CQD-based Focal Plane Array (FPA) technology, tailored for mid-wave infrared (MWIR) detection across the 3-5 µm spectrum.\nThe simulation will optimize the FPA to meet essential Air Force requirements for sensitivity, dark current, and noise reduction in surveillance and target acquisition applications.\nThis model will ensure that the HgTe CQD-based FPA maintains high Noise Equivalent Power (NEP) and dark current performance while providing stable, high-resolution imaging across the MWIR range, supporting reliable detection and tracking in diverse operational conditions.\nRisk: Data Insufficiency on Current Technologies-Without a thorough understanding of existing MWIR FPA technologies, the reference model may need more critical details, leading to design inefficiencies.\nMitigation: Conduct an exhaustive survey of existing HgTe CQD and alternative FPA technologies to establish benchmarks for cost, scalability, NEP, dark current, and EQE.\nBryka will use data from similar solution-processed materials to predict and validate critical metrics, ensuring the model reflects feasible performance standards.\nTechnical Objective 2: Establish Multi-Array Synchronization and Coherence Requirements: We will design and simulate the performance of multi-array synchronization and coherence algorithms across distributed HgTe CQD-based Focal Plane Array (FPA) panels.\nThis simulation will validate real-time coherence, signal combining, and synchronization across arrays, ensuring minimal discrepancies in data capture and maximizing imaging clarity.\nBy establishing and testing dynamic coherence controls, we aim to ensure that the FPA system achieves optimal data alignment, high thermal imaging, and target tracking accuracy, even in multi-platform deployments across varying operational environments.\nRisk: Complexity in Synchronizing Distributed Arrays – Ensuring precise coherence across multiple FPA panels may be challenging, potentially affecting imaging clarity and multi-array operability.\nMitigation: Develop a testbed for validating multi-array synchronization and implement software-based dynamic coherence controls to maintain consistent image quality.\nBryka will simulate different deployment configurations to optimize synchronization, minimizing potential issues during real-world operation.\nTechnical Objective 3: Define Dark Current and NEP Standards for the Target Operating Temperature (200 K or Higher): This objective will focus on testing and validating the HgTe CQD-based Focal Plane Array (FPA) system to maintain target dark current and Noise Equivalent Power (NEP) standards at 200 K or higher operating temperatures.\nSimulations will ensure that the FPA system sustains high performance and low noise levels across distributed arrays, leveraging adaptive thermal signal processing and robust stabilization methods.\nBy defining precise dark current and NEP thresholds, the system will be optimized for sensitivity and noise control in real-world surveillance and target acquisition applications, supporting consistent imaging clarity and reliability at elevated temperatures.\nFigure 4 Ag2Te/ HgTe thin film prepared on ITO/Sapphire substrate Technical Objective 4: Evaluate Suitability of Pixel-Less Array Fabrication for Cost Reduction: Risk: High Dark Current at Elevated Temperatures – Operating at 200 K could result in elevated dark current, impacting sensitivity and noise levels in the FPA.\nMitigation: Integrate thermoelectric cooling within the FPA design for stable operation at or above 200 K, reducing dark current without cryogenic systems.\nSurface passivation and optimized CQD synthesis will be applied to reduce trap states, helping meet the desired NEP and dark current levels.\n4",
        "12": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nTechnical Objective 5 : Seamless Integration with CMOS-Compatible Readout Integrated Circuits (ROIC): Risk: Material and Compatibility Issues: Integrating HgTe CQDs with CMOS technology can be challenging due to differences in material properties and processing conditions.\nMitigation: Bryka Skystocks LLC will apply hybrid bonding techniques that allow the CQD layer and ROIC to be manufactured and bonded at lower temperatures, preserving CMOS compatibility.\nThe team will also develop CMOS- compatible encapsulants and coatings to protect the CQDs without interfering with signal transmission, ensuring efficient integration and performance consistency.\nTechnical Objective 6: Radiation Hardness for Space Applications: Risk: Sensitivity to Radiation: HgTe CQDs can be sensitive to radiation, a significant risk for long-term use in space environments where radiation exposure is high.\nMitigation: Bryka Skystocks LLC will explore radiation- resistant coatings or materials, such as oxide passivation layers, to shield the CQDs from radiation.\nTesting the CQD arrays in simulated radiation environments will help assess resilience, while material improvements can focus on creating a stable structure less prone to radiation-induced defects.\nFigure 5 Normalized photocurrent spectra for three different sizes of HgTe nanoparticle@T=3K (dashed line) and at room temperature (solid line).\nParticle size 5nm (blue), 8nm and 12nm(red) 3.0 Statement of Work: Task 1: Design of HgTe CQD Film for MWIR Detection: Subtask: Synthesize HgTe Quantum Dots (QDs): • Define Target QD Size: Based on MWIR wavelength sensitivity, target a quantum dot size of 8-12 nm, which optimally tunes the bandgap to the 3-5 µm range.\nThis size selection allows enhanced infrared absorption while controlling carrier recombination rates to achieve the desired sensitivity.\n• Synthesize QDs Using Solution-Phase Chemical Techniques: Prepare a solution-phase synthesis using precursors such as HgCl2 (mercury chloride) and NaHTe (sodium hydrogen telluride) as sources of Hg and Te, respectively.\nThe reaction will occur in a coordinating solvent such as oleylamine at a controlled temperature of 80-100°C.\nThis solvent provides stabilization during growth, preventing QD aggregation and maintaining size uniformity.\nMonitor the reaction using UV-Vis spectroscopy to observe shifts in absorbance, confirm QD size, and narrow the bandgap to align with MWIR requirements.\nOnce the QDs reach the target size (confirmed through absorbance peaks in the desired MWIR range), the reaction is quenched by rapidly lowering the temperature, which stops growth and preserves the desired size distribution.\n• Purify Quantum Dots: Purify the synthesized QDs by repeated centrifugation and washing with nonpolar solvents, such as hexane, to remove excess ligands and unreacted precursors.\nAfter purification, disperse the QDs in a solvent suitable for deposition, such as toluene, to ensure uniform film formation.\nSubtask 2: Prepare Substrate and Deposition Parameters: • Select Substrate: Choose a CMOS-compatible substrate like silicon or glass with a deposited SiO2 layer (thickness 50 nm) to enhance compatibility with readout integrated circuits (ROICs) and improve device integration.\n• Clean the Substrate: Clean the substrate using a standard Piranha solution (3:1 mixture of H2SO4 and H2O2) to remove organic contaminants.\nRinse thoroughly with deionized water and dry with nitrogen.\nConduct a final plasma treatment (e.g., oxygen plasma for 5 minutes) to enhance surface energy and promote adhesion of the QD film.\n• Define Deposition Parameters: Use spin-coating as the deposition method to ensure uniform film thickness.\nSet initial parameters for spin-coating at 3000 rpm for 30 seconds to create a uniform 1 µm thick layer of HgTe CQDs on the substrate.\n5",
        "13": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nMultiple layers of QDs may be required to achieve the desired thickness and sensitivity.\nRepeat the spin-coating process to build up to the final thickness (targeting 1-2 µm).\nSubtask 3: Ligand Exchange for Enhanced Conductivity: • Prepare Ligand Exchange Solution: Prepare a ligand exchange solution using 1,2-ethanedithiol (EDT) in acetonitrile.\nReplace the long insulating ligands on the QDs with short conductive ones, improving charge transport across the film.\n• Perform Ligand Exchange on Film: After each spin-coated layer, apply the EDT solution to the film for 1-2 minutes, allowing it to infiltrate and replace the original ligands.\nRinse the film with acetonitrile to remove unreacted EDT and ensure the film is not damaged.\nThis exchange process improves carrier mobility and reduces resistance, optimizing the QD film for MWIR detection.\nSubtask 4: Annealing the Film for Enhanced Stability: • Set Annealing Temperature and Time: Place the substrate with the HgTe CQD film in a controlled inert gas atmosphere (e.g., nitrogen) to prevent oxidation during annealing.\nAnneal the film at 150°C for 30 minutes to remove any remaining solvent residues and enhance bonding between QDs, stabilizing the film.\n• Monitor Film Quality Post-Annealing: Scanning electron microscopy (SEM) inspects the surface morphology of the annealed film, ensuring uniformity and minimal cracking.\nCheck the thickness post-annealing to confirm it aligns with the target (1-2 µm), as the annealing process may cause minor shrinkage.\nSubtask 5: Characterize and Test HgTe CQD Film Performance: • Conduct Absorption Spectroscopy: Use an infrared (IR) spectrometer to measure the absorption spectrum of the film across the 3-5 µm range, confirming that the QD bandgap aligns with MWIR detection needs.\n• Measure Dark Current and Quantum Efficiency: Measure dark current at the operational temperature of 200 K, aiming for a dark current value of approximately 5 x 10^-9 A.\nMeasure quantum efficiency (QE) across the MWIR range, targeting at least 0.6 to ensure sufficient photoresponse for high-sensitivity applications.\n• Evaluate Noise Equivalent Power (NEP): Using a calibrated infrared source, measure the film’s Noise Equivalent Power (NEP) at 200 K, with the target NEP set at 100 fW/Hz1/2 for effective MWIR detection.\nTask 2: Integrate HgTe CQDs with Black Silicon and Gold Reflector Structure: Subtask 1: Prepare the Black Silicon Substrate: • Create Black Silicon Layer: Begin with a silicon wafer (typically p-type or n-type) as the base substrate.\nReactive-ion etching (RIE) with SF6 and O2 plasma gases creates a black silicon layer on the wafer.\nThis process forms nano-scale surface structures that trap light, reducing reflectance and enhancing photon absorption.\nTo achieve the desired nano-texturing, set the RIE parameters to 200 W power, 20 mTorr pressure, and a processing time of 10 minutes.\n• Characterize Black Silicon Properties: Measure the black silicon layer's reflectance using a UV-Vis-NIR spectrometer to confirm it is below 1% in the MWIR range (3-5 µm).\nEnsure uniformity across the surface to maintain consistent absorption characteristics.\nSubtask 2: Deposit a Gold Reflector Layer: • Apply Adhesion Layer: Using electron beam evaporation, deposit a 5 nm titanium layer on the black silicon.\nThis layer enhances adhesion between the black silicon and gold layers without affecting optical performance.\n• Deposit Gold Layer: Thermal evaporation deposits a 100 nm thick gold layer on the titanium adhesion layer.\nThe gold layer acts as a back reflector, ensuring that any unabsorbed light in the MWIR range is reflected into the HgTe CQD layer for additional absorption.\n6",
        "14": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nConfirm layer thickness and uniformity using scanning electron microscopy (SEM) and measure the reflectivity to ensure optimal reflection in the MWIR band.\nSubtask 3: Spin-Coat HgTe CQD Film on Black Silicon with Gold Reflector: • Prepare HgTe CQD Solution for Spin Coating: Disperse the synthesized HgTe CQDs in a solvent (e.g., to luene) to form a stable colloidal solution suitable for spin-coating.\nEnsure a particle concentration that allows for a uniform 1-2 µm thick film.\n• Spin-Coat HgTe CQD Film: Spin-coat the HgTe CQD solution onto the black silicon with the gold reflector structure at 3000 rpm for 30 seconds to achieve a uniform 1 µm film thickness.\nRepeat the process to build up to a final thickness of 1-2 µm for enhanced MWIR sensitivity.\n• Perform Ligand Exchange: After each layer deposition, a ligand exchange with 1,2-ethanedithiol (EDT) replaces insulating ligands with conductive ones, improving charge transport through the CQD layer.\nSubtask 4: Anneal the Composite Structure: • Conduct Inert Gas Annealing: Place the composite structure in a nitrogen atmosphere for 30 minutes to anneal at 150°C.\nThis process improves adhesion between layers and removes any remaining solvent, enhancing film stability and conductivity.\n• Use SEM to check the film surface for uniformity and potential defects.\nConfirm that the HgTe CQD layer adheres well to the black silicon with the gold reflector and shows no signs of cracking.\nFigure 6: Illustration of top Au and Au+ITO contact and temperature dependent photocurrent density Inspect Film Quality Post-Annealing: Input Material Properties: Task 3: Simulation of a Complete HgTe CQD Photodetector: Subtask 1: Define Photodetector Structure and Material Properties: • Set Device Layer Structure: Define the layered structure of the photodetector, including: HgTe CQD layer (1 µm thick).\nSiO2 passivation layer (50 nm thick).\nGold reflector (100 nm thick).\nSilicon or glass should be used as the primary substrate for compatibility with CMOS integration.\n• For the HgTe CQD layer, set: Absorption coefficient: 10^4 cm^-1, tuned to 3-5 µm MWIR range.\nElectron mobility: 10 cm^2/V·s.\nDielectric constant: 12.\nSet properties for other materials: SiO2 dielectric constant of 3.9.\nGold layer reflectivity tuned for 3-5 µm wavelengths.\nEnter these values into the simulation tool to model the interactions within the photodetector.\nSubtask 2: Perform Optical Simulation: • Configure Optical Simulation for Absorption and Reflection: Use COMSOL Multiphysics’ Wave Optics module to set up an optical simulation across the MWIR wavelength range of 3-5 µm.\nModel light enters the photodetector structure at normal incidence and passes through the HgTe CQD layer, with reflections from the gold reflector layer.\n• Analyze Absorption Efficiency: 7",
        "15": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nSet the simulation to measure absorption efficiency across the 3-5 µm range.\nThe goal is to achieve absorption of over 90% of incident light within this range, which maximizes the quantum efficiency of the device.\nGenerate an absorption map of the HgTe CQD layer to observe how light is absorbed and where enhancement is needed.\n• Validate and Adjust By Figure 7: Quantum dot IR Detector, PMMA assisted method for multipixel photodetector array and schematic configuration of fabricated multipixel photodetector Parameters: Based on absorption the results, adjust the thickness of the CQD or reflector layer if absorption falls below target levels.\nmaximizing absorbed light ensures that the configuration achieves maximum photon-to-electron conversion.\nSubtask 3: Simulate Electrical Behavior and Carrier Dynamics: • Configure Electronic Simulation for Charge Transport: Using Sentaurus TCAD, the electronic simulation is set up to model carrier transport within the HgTe CQD layer.\nInput electron mobility of 10 cm^2/V·s and hole mobility of 5 cm^2/V·s to reflect realistic transport dynamics in the CQD material.\nThe photodetector's operating bias should be set to 0.5 V to facilitate charge separation and movement within the CQD layer.\n• Analyze Dark Current and Carrier Recombination: Simulate to observe dark current levels across the photodetector, targeting a value below 5 x 10^-9 A at 200 K.\nModel carrier recombination within the CQD layer to identify areas with high recombination rates, which can reduce sensitivity.\nAdjust material properties, such as doping levels or layer thickness, to minimize recombination and dark current.\n• Measure Quantum Efficiency (QE) and NEP: Simulate the photodetector’s response to incident photons across the 3-5 µm range, calculating quantum efficiency (QE) at each wavelength.\nAim for a QE of 0.6 to ensure effective photon-to-electron conversion.\nCalculate the Noise Equivalent Power (NEP) at 200 K, targeting a 100 fW/Hz^1/2 value to achieve high sensitivity for MWIR applications.\nSubtask 4: Perform Thermal Simulation for Temperature Stability: • Configure Thermal Simulation for 200 K Operation: In COMSOL Multiphysics, the Heat Transfer module simulates the photodetector's thermal behavior when operating at 200 K with thermoelectric cooling.\nSet heat generation parameters based on dark current and biasing, considering power dissipation within the CQD layer and other components.\n• Analyze Temperature Distribution: Simulate to measure the temperature distribution across the photodetector, ensuring that all layers remain stable around 200 K.\nIf temperature hotspots are observed, adjust cooling parameters or introduce additional thermal management layers to stabilize the system.\n• Validate Stability Against Thermal Fluctuations: Check that the thermal stability is maintained within ±2 K of the target operating temperature to prevent performance degradation.\nConfirm that dark current and NEP remain stable under these thermal conditions.\nSubtask 5: Summarize and Validate Simulation Results: • Compile Performance Metrics: Summarize the simulation results, explicitly noting: Absorption efficiency: Target >90% across 3-5 µm.\nDark current: Below 5 x 10^-9 A at 200 K.\n8",
        "16": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nQuantum efficiency (QE): 0.6 or higher.\nNoise Equivalent Power (NEP): 100 fW/Hz^1/2.\n• Validate Against Design Requirements: Compare the achieved values with the design requirements.\nIf performance metrics fall short, adjust layer thickness, material properties, or cooling configurations and re-run simulations.\nDocument final validated values as benchmarks for experimental design and fabrication stages.\n• Report Findings for Design Optimization: Generate a report detailing simulation outcomes, adjustments, and final design parameters.\nThis report will guide the physical construction of the HgTe CQD photodetector.\nTask 4: Simulation of a Complete HgTe CQD Photodetector for MWIR Detection: Subtask 1: Define Device Structure and Material Properties: • Layered Device Structure Setup: Define a multi-layered structure in the simulation model that includes: HgTe CQD active layer (1 µm thickness), SiO2 passivation layer (50 nm thickness), and Gold reflector (100 nm thickness).\nUse a silicon substrate with a 50 nm SiO2 layer chosen for compatibility with CMOS integration.\n• Material Properties Assignment: Input the following critical properties for each layer: HgTe CQD Layer: Absorption coefficient of 10^4 cm^-1 tuned to the 3-5 µm MWIR range, electron mobility of 10 cm^2/V·s, dielectric constant of 12.\nGold Reflector: Set reflectivity properties for 3-5 µm wavelengths.\nEnsure each property is realistic and tuned for the MWIR range, essential for the photodetector's sensitivity and absorption performance.\nSubtask 2: Perform Optical Simulation • Set Up Optical Absorption Simulation: In the COMSOL Multiphysics’ Wave Optics module, configure an optical simulation that models incident light at 3- 5 µm wavelengths entering the HgTe CQD layer and reflecting off the gold reflector.\nDefine simulation boundaries to capture photon interactions across the entire detector structure.\n• Run Absorption Analysis: Run the simulation, focusing on absorption efficiency.\nAim for absorption levels above 90% within the 3-5 µm range.\nGenerate an absorption map of the HgTe CQD layer, showing photon distribution and identifying areas with optimal absorption.\n• Parameter Adjustment and Re-simulation: If absorption efficiency is below target, adjust the thickness of the CQD layer (within a range of 1-2 µm) or the reflector layer and re-run the simulation.\nThe goal is to optimize photon interaction to maximize quantum efficiency.\nSubtask 3: Simulate Electrical Properties and Charge Transport: • Setup for Charge Transport Simulation: In Sentaurus TCAD, configure the electronic simulation model to evaluate charge transport through the HgTe CQD layer.\nUse properties like electron mobility of 10 cm2/V ·s and hole mobility of 5 cm2/V ·s to reflect realistic carrier dynamics.\nApply a bias voltage of 0.5 V across the photodetector to drive charge separation and facilitate carrier movement.\n• Dark Current and Recombination Analysis: Simulate to observe dark current behavior, targeting a stable level of 5 x 10^-9 A at 200 K.\nModel carrier recombination processes within the CQD layer, identifying areas of high recombination and minimizing them by adjusting layer properties (e.g., doping or thickness).\n• Quantum Efficiency (QE) and NEP Calculation: To calculate quantum efficiency (QE), simulate the photodetector’s response to incident photons across the 3-5 µm range.\nAim for QE values of at least 0.6 for effective photon-to-electron conversion.\nCalculate the Noise Equivalent Power (NEP) at 200 K, with a target of 100 fW/Hz^1/2, ensuring that the photodetector has high sensitivity for MWIR applications.\nSubtask 4: Perform Thermal Stability Simulation: • Set Up Thermal Simulation for 200 K Operation: 9",
        "17": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nUsing the Heat Transfer Module in COMSOL Multiphysics, a thermal simulation was set up to model temperature stability when operating at 200 K with thermoelectric cooling.\nDefine the heat generation parameters based on dark current and bias power, as these factors influence the thermal profile across the detector.\n• Analyze Temperature Distribution: Run the simulation and monitor the temperature distribution across the layers.\nThe target is maintaining stable operation at 200 K with minimal thermal gradients.\nIf temperature fluctuations exceed ±2 K, adjust cooling settings or layer thicknesses to stabilize the thermal profile.\n• Validate Performance Stability: Confirm that dark current, QE, and NEP metrics remain stable under simulated thermal conditions.\nVerify that the design meets target performance values without degradation due to temperature instability.\nSubtask 5: Compile and Validate Simulation Results: • Document Key Performance Metrics: Record the final results for each performance metric, ensuring they meet the design targets: Absorption efficiency: >90% within 3-5 µm range.\nDark current: Approximately 5 x 10^-9 A at 200 K.\nQuantum Efficiency (QE): At least 0.6.\nNoise Equivalent Power (NEP): 100 fW/Hz^1/2.\n• Evaluate Results Against Design Requirements: Compare each achieved value with the design targets.\nIf any metric falls short, adjust material properties, layer thickness, or bias settings, and re-run simulations as needed.\nEnsure that results align with MWIR application requirements for high-sensitivity, low-noise detection.\n• Finalize Report on Simulation Findings: Prepare a comprehensive report summarizing simulation outcomes, adjustments, and validated parameters.\nInclude detailed results for absorption efficiency, dark current, QE, and NEP to guide future experimental validation and fabrication.\nTask 5: Implementation of CMOS-Compatible ROIC for HgTe CQD-Based MWIR Photodetector: Subtask 1: Define ROIC Design Requirements and Specifications: • Establish Key Performance Metrics: with compatibility Set target specifications based on photodetector requirements: Input capacitance: Match with the HgTe CQD pixel capacitance to ensure minimal signal degradation.\nDark current noise floor: Design for the photodetector’s dark current of approximately 5 x 10^-9 A.\nNoise Equivalent Power (NEP): Ensure the ROIC maintains signal integri ty compatible with the photodetector’s 100 fW/Hz^1/2 NEP target.\n• Define Architecture and Power Requirements: Choose a low-noise trans-impedance amplifier (TIA) architecture, as it offers high sensitivity and minimal noise in MWIR applications.\nSet the ROIC’s operating voltage at 3.3 V, which is standard in CMOS processes and ensures compatibility with other integrated circuit components.\nOutline an adaptive power management circuit to minimize power usage without sacrificing sensitivity, which is crucial for operation at 200 K.\nSubtask 2: Design Signal Amplification and Noise Control Circuits: • Design Transimpedance Amplifier (TIA) for Low-Noise Amplification: Configure the TIA with a gain of 1 MΩ to amplify weak photocurrent signals from the HgTe CQD photodetector without excessive noise.\nSet the TIA bandwidth in the MWIR range using a feedback resistor and capacitor combination, ensuring signal fidelity across the 3-5 µm wavelength range.\nFigure 8: MWIR test set up block diagram.\n10",
        "18": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nImplement Dark Current Management Circuitry: Integrate Sample-and-Hold Circuitry for Signal Integrity: • Design an auto-zeroing circuit to cancel out the dark current component from the output signal, improving overall signal clarity.\nIntegrate a low-pass filter with a cutoff frequency around 10 Hz to smooth out any remaining noise spikes due to dark current fluctuations, aligning with the photodetector’s target dark current performance.\n• Add Low-Noise Bias Control Circuitry: Implement a bias control circuit with a precision voltage regulator to maintain stable bias across each pixel and reduce noise from power supply variations.\nInclude a temperature-compensation feature to adjust bias levels as the ROIC operates at 200 K, ensuring signal stability across the FPA.\nSubtask 3: Design Real-Time Signal Synchronization for Multi-Array Coherence: • Develop Synchronization Clock Network: Design a distributed clocking network that provides a synchronization signal to each pixel in the array, ensuring coherence between panels in multi-array configurations.\nSet the clock frequency at 10 MHz for optimal timing resolution, with an inter-pixel delay tolerance within 0.1 ns to maintain signal coherence.\n• Implement sample-and-hold circuits in each pixel, capturing the signal immediately after amplification and holding it for analog-to-digital conversion.\nThis approach prevents signal degradation in real-time imaging applications.\nThe sampling time should be 100 ns, ensuring minimal signal loss and enabling real-time imaging coherence across distributed arrays.\nSubtask 4: Simulate the ROIC Performance and Validate Design: • Run Noise and Signal Integrity Simulations: Use Cadence Virtuoso to simulate noise levels within the ROIC circuitry.\nConfirm that the dark current noise floor is well within the tolerance of the photodetector’s dark current (targeting a noise floor of 1 x 10^-10 A).\nSimulate the TIA’s performance with input currents in the 1-10 nA range and verify that the amplification maintains signal clarity across this range.\n• Validate Thermal Performance at 200 K: The ROIC at 200 K will be simulated to ensure biasing and signal amplification stability.\nThe bias control circuits will be tested for thermal shifts, and the temperature compensation circuit will be adjusted as needed.\n• Test Synchronization and Coherence: Simulate the clocking network and sample-and-hold circuitry to ensure that the timing across pixels remains within the 0.1 ns coherence threshold, essential for multi-array configurations.\nConfirm that each sample-and-hold circuit functions effectively across the entire array, allowing real-time signal alignment.\nSubtask 5: Prepare for Fabrication and Prototype Testing: • Finalize ROIC Layout and Submit for Fabrication: Complete the ROIC layout in Cadence Virtuoso, ensuring it meets size constraints for integration with the HgTe CQD photodetector.\nPerform a design rule check (DRC) to confirm the layout adheres to CMOS fabrication requirements and submit the design for fabrication.\n• Plan for Prototype Testing: Develop a testing plan for the ROIC, including setup for noise, gain, synchronization, and thermal stability testing.\nOutline metrics to validate the ROIC’s compatibility with the photodetector’s dark current, NEP, and synchronization requirements in the prototype testing phase.\nFigure 9: Histogram of NEDT of FPA Task 6: Fabrication of Solution-Processed HgTe Quantum Dots on a CMOS-Compatible Substrate: Subtask 1: Prepare CMOS-Compatible Substrate: • Select Substrate Material: Choose a silicon substrate with a 50 nm SiO2 layer for CMOS compatibility.\nThis ensures structural stability and an appropriate surface for CQD adhesion.\n• Clean the Substrate: 11",
        "19": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nInspect Substrate: To remove organic contaminants, perform a Piranha etch (a 3:1 mixture of H2SO4 and H2O2) for 10 minutes.\nRinse thoroughly with deionized water.\nDry the substrate with nitrogen and perform a 5-minute oxygen plasma treatment to increase surface energy and promote the adhesion of the HgTe CQD layer.\n• An optical microscope inspects the substrate surface for cleanliness and confirms uniform SiO2 coating, as imperfections may affect CQD layer deposition.\nSubtask 2: Synthesize and Purify HgTe Quantum Dots: • Synthesis of HgTe CQDs: In a solution-phase reaction, HgCl2 (mercury chloride) and NaHTe (sodium hydrogen telluride) are precursors to form HgTe QDs.\nFor controlled growth, the reaction should be carried out in oleylamine as a coordinating solvent at 80-100°C.\nMonitor QD size using UV-Vis spectroscopy, targeting an average QD size of 8-12 nm to align with MWIR detection requirements in the 3-5 µm range.\n• Purification of QDs: Purify the QDs by centrifugation and washing with hexane to remove unreacted precursors and excess ligands.\nRedisperse the purified QDs in toluene, achieving a stable colloidal solution suitable for spin-coating.\nConfirm the particle concentration, which should yield a uniform 1-2 µm film on the substrate.\nSubtask 3: Spin-Coat HgTe CQD Layer onto Substrate: • Spin-Coating Preparation: Place the cleaned CMOS-compatible substrate on the spin-coating platform.\nDispense a sufficient volume of the HgTe CQD solution (prepared in Step 2) onto the center of the substrate.\nFigure 10: The fabrication principle of black silicon using metal-assisted chemical etching(MACE) Inspect Layer Thickness: Figure 11 a) The schematic fabrication proceess steps from Si substrate preparatio to GeSn growth, ICP-RIE etching,and clewanin for SnOxFy removal • Perform Spin-Coating: Set the spin-coater to 3000 rpm for 30 seconds, targeting a 1 µm thick layer in a single coat.\nRepeat the spin-coating process to build up to a 1-2 µm total thickness.\nAfter each coating, allow the solvent to evaporate naturally before applying additional layers.\nThis will ensure uniformity and prevent defects.\n• After each coating step, a profilometer ver ifies the thickness, ensuring the final layer meets the desired thickness range.\nIf the thickness deviates from the target values, adjust the spin speed or solution concentration.\nSubtask 4: Perform Ligand Exchange for Improved Charge Transport: • Prepare Ligand Exchange Solution: For ligand exchange, a solution of 1,2-ethanedithiol (EDT) in acetonitrile was used.\nThis step replaces the long insulating ligands with short conductive ones, enhancing the charge transport properties of the HgTe CQD film.\n• Apply Ligand Exchange Solution: Drop-cast the EDT solution onto the CQD layer and let it sit for 1-2 minutes to allow full ligand exchange.\nThis will facilitate charge movement across the C QD layer.\nRinse the film with acetonitrile to remove unreacted EDT and prevent film degradation.\n• Confirm Ligand Exchange: Use Fourier Transform Infrared (FTIR) spectroscopy to confirm the ligand exchange by observing the characteristic bond signatures of EDT.\nThis step verifies that the conductive ligands are successfully integrated into the CQD layer.\n12",
        "20": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nInspect Film Quality Post-Annealing: Subtask 5: Anneal the CQD Layer for Stability and Adhesion: • Set Annealing Conditions: To prevent oxidation, place the substrate with the CQD layer in a nitrogen-filled oven.\nSet the temperature to 150°C and anneal for 30 minutes.\nThis annealing process removes residual solvents, stabilizes the CQD film, and improves adhesion to the substrate.\n• After annealing, scanning electron microscopy (SEM) is used to inspect the surface morphology.\nVerify uniformity and ensure no cracks or delamination occurred during the annealing process.\nConfirm the thickness of the final CQD layer using a profilometer, ensuring that it remains within the 1-2 µm target range.\nSubtask 6: Characterize the Optical and Electrical Performance of the CQD Layer: • Optical Absorption Test: Measure the absorption spectrum of the HgTe CQD film across the 3-5 µm range using an FTIR spectrometer.\nAim for an absorption efficiency of over 90% to meet MWIR sensitivity requirements.\n• Measure Dark Current and Quantum Efficiency (QE): Measure dark current at the operational temperature of 200 K.\nThe target value should be approximately 5 x 10^-9 A to ensure low noise.\nCalculate quantum efficiency (QE) across the MWIR spectrum, targeting a QE of 0.6 or higher to ensure effective photon-to-electron conversion.\n• Noise Equivalent Power (NEP) Evaluation: Evaluate the Noise Equivalent Power (NEP) using a calibrated infrared source, aiming for a target NEP of 100 fW/Hz^1/2.\nThis metric confirms the film’s sensitivity and noise performance for MWIR applications.\nMilestone Chart: # Milestone 1 Kickoff (KO) Design and Fabrication of HgTe CQD Film for MWIR Detection Integration of Black Silicon and Gold Reflector Structure Simulation of Complete HgTe CQD Photodetector Implementation CMOS-Compatible ROIC Validation Prototyping Complete Detector and of of Performance and Optimization Testing Final Submission Report 2 3 4 5 6 7 8 M1 M2 M3 M4 M5 M6 Tasks • Project review and kickoff meeting with stakeholders • Design of HgTe CQD Film with MWIR alignment • Fabricate solution-processed HgTe CQD film on CMOS-compatible substrate • Integrate HgTe CQD film with black silicon and gold reflector structure • Optical and Electrical Simulation of HgTe CQD Photodetector • Thermal Stability Simulation • Design and simulate CMOS-compatible ROIC with low-noise amplification and real-time synchronization Integrate prototype MWIR photodetector with HgTe CQD film, ROIC, and thermoelectric cooling • Conduct performance testing to measure QE, NEP, and dark current stability at 200 K and • • Submit comprehensive report detailing simulation and design methodologies, results, performance outcomes fabrication processes, 4.0 Related Work: Bryka Skystocks LLC, has harnessed its expertise in HgTe Colloidal Quantum Dot (CQD) technology to create advanced MWIR sensing solutions, forming a solid foundation for the proposed Air Force FPA system.\nLeveraging 13",
        "21": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nprevious developments in high-sensitivity CQD-based detectors, Bryka Skystocks LLC will integrate multi-array synchronization and real-time coherence for distributed FPAs, targeting precise alignment across arrays.\nTheir experience in scalable, solution-processed CQD imaging systems, optimized for low dark current and stable NEP at 200 K, aligns with Air Force requirements.\nThis expertise ensures that Bryka’s HgTe CQD FPA technology will deliver reliable, high-resolution imaging in distributed, low-power configurations for surveillance and target acquisition.\n5.0 Relationship with Future Research or Research and Development: Anticipated Results of the Proposed Approach: Completing Phase I, Bryka Inc.\nwill deliver a detailed system model for the HgTe CQD-based FPA technology, laying the groundwork for a scalable, low-cost MWIR detection system.\nThis model will guide the development of synchronized, multi-array FPA panels optimized for high-sensitivity thermal imaging at elevated temperatures (around 200 K).\nEmphasis will be placed on refining critical performance metrics, including dark current (targeting 5 x 10^-9 A), Noise Equivalent Power (NEP) (100 fW/Hz^1/2), and quantum efficiency across the MWIR band (3-5 µm).\nThis Phase I model will include simulation and validation of coherence and signal synchronization across arrays, ensuring reliable data alignment for distributed imaging.\nThese achievements will establish proof of concept for a multi-array, real-time MWIR imaging architecture that enhances Air Force capabilities in surveillance, reconnaissance, and advanced target tracking over vast areas.\nSignificance of the Phase I Effort: The Phase I effort is essential in establishing the technical foundation for a scalable, low-cost HgTe CQD-based FPA system tailored for MWIR detection.\nThis phase will concentrate on developing a comprehensive system model for synchronized, distributed FPA panels designed to provide high-sensitivity, real-time thermal imaging, and target tracking over large operational areas.\nKey technical goals include optimizing parameters such as dark current (targeted at 5 x 10^-9 A), Noise Equivalent Power (NEP) (100 fW/Hz^1/2), and phase coherence, ensuring the system meets stringent Air Force standards for MWIR detection.\nPhase I will also simulate and validate multi-array synchronization and coherence techniques, ensuring seamless operation across distributed FPA panels.\nThese advancements are vital for enhancing imaging sensitivity and tracking accuracy, particularly for detecting low-contrast or fast-moving targets.\nThe outcomes of Phase I will confirm the feasibility of a low-cost, multi-array MWIR detection system, laying the groundwork for integration into more considerable defense and reconnaissance infrastructures and opening opportunities for further application in areas like environmental monitoring and industrial inspection.\n6.0 Commercialization Strategy: 6.1 First Planned Product to Incorporate Technology: The primary application of Bryka Inc.'s HgTe CQD-based FPA technology is in Air Force MWIR imaging systems, enhancing real-time surveillance and reconnaissance capabilities over large operational areas.\nThe distributed, synchronized FPA panels will significantly improve target tracking and detection, especially for low-signature and high-speed objects, by providing real-time coherence and high sensitivity in the 3-5 µm MWIR range.\nThe system’s scalability and low-cost design ensure efficient deployment across various defense platforms.\nCommercial Applications: Beyond defense, the HgTe CQD-based FPA technology holds promise in multiple civilian sectors: Industrial Inspection: High-sensitivity MWIR imaging can aid equipment monitoring and detecting heat-related issues before failure.\nEnvironmental Monitoring: MWIR sensitivity allows for real-time tracking of pollution, wildfires, and other environmental hazards.\nSpace Exploration: Adapted FPAs can enhance imaging for space missions, aiding in thermal data collection and object tracking in space.\nAutomotive Safety: High-resolution MWIR imaging could support advanced driver-assistance systems (ADAS), improving night vision and obstacle detection.\n6.2 Customers and Market Size: Market the Technology Will Need Address Principals Operating in this Market Value/Size/Trend 14",
        "22": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nDefense Surveillance Systems Industrial Inspection Space Exploration Automotive Safety Environmental Monitoring Enhanced real-time detection and tracking for low-signature and fast- moving targets in MWIR range (3- 5 µm) Improved heat anomaly detection in equipment, enabling predictive maintenance High-sensitivity thermal imaging and tracking for space missions, including satellite monitoring Enhanced night vision and obstacle detection for advanced driver- assistance systems (ADAS) of Real-time environmental hazards such as wildfires, and temperature changes pollution, tracking Northrop Grumman, Lockheed Martin, U.S.\nAir Force infrared Global market expected $15.5B by 2028 imaging to reach FLIR Systems, Bosch, Honeywell NASA, Boeing SpaceX, inspection market Infrared projected to grow at 6.3% CAGR Space sensor market expected to reach $12B by 2030 Tesla, Ford, Mobileye ADAS market projected to grow to $131.7B by 2027 Thermo Scientific, PerkinElmer Fisher Agilent, Environmental monitoring market expected to reach $3.5B by 2025 6.3 Money to Bring Technology to Market: Activity Milestone Phase Project Phase Project I SBIR II SBIR Phase III Commercialization Develop proof-of-concept for HgTe CQD-based FPA technology Prototype demonstration of distributed HgTe CQD- based FPA system Full-scale production and commercial deployment of MWIR imaging system Anticipated Expenditure $250,000 Funding Source SBIR Phase I Deliverable/Timeframe Final report and system model/Jan-2024 $2,750,000 SBIR Phase II Prototype system, Phase II Report/Feb-2025 $4,000,000 Internal investors, defense contracts funds, or Production plan, market deployment/Dec-2027 6.4 Marketing Expertise: Bryka Skystocks LLC.\nhas extensive expertise in developing and commercializing HgTe CQD-based FPA technologies and over a decade of experience in infrared imaging and sensor solutions for defense applications.\nBryka has successfully delivered advanced thermal imaging and sensing systems to agencies such as the U.S.\nAir Force and DARPA, showcasing its ability to meet stringent military standards for performance and reliability.\nThis expertise has positioned Bryka as a trusted high-sensitivity, cost-effective infrared detection system provider.\nOur strategy will center on forming partnerships with industry leaders like Northrop Grumman and Lockheed Martin to promote the distributed HgTe CQD FPA for defense and surveillance applications.\nIn addition, Bryka will target commercial markets, such as environmental monitoring and industrial inspection, emphasizing the technology's scalability and real-time imaging benefits.\nThrough targeted marketing and leveraging established partnerships, Bryka aims to become a leading provider of advanced MWIR imaging solutions for defense and commercial sectors.\n6.5 Competition and Technical Advantages: Bryka Skystocks LLC.\nfaces competition from established defense and thermal imaging companies like FLIR Systems, Raytheon, and Lockheed Martin, which offer high-cost MWIR imaging and detection systems with sophisticated but expensive components.\nIn contrast, Bryka Skystocks LLC’s HgTe CQD-based FPA technology provides a cost-effective solution by leveraging scalable, solution-processed quantum dot materials and CMOS- compatible integration, achieving MWIR sensitivity without costly cryogenic cooling.\nThis approach allows Bryka Skystocks LLC’s FPA system to deliver high-resolution thermal imaging and synchronized multi-array capabilities with scalability and real-time coherence across panels.\nThe modular, low-cost design offers a competitive advantage for defense applications like surveillance and reconnaissance and commercial applications in environmental 15",
        "23": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nmonitoring and industrial inspection, positioning Bryka Skystocks LLC as a provider of accessible and high- performance MWIR imaging solutions.\n7.0 Key Personnel: 7.1 Mr.\nSuresh Mirchandani - Principal Investigator: Mr.\nSuresh Mirchandani, Principal Investigator at Bryka Skystocks LLC., leads the development of HgTe CQD-based Focal Plane Array (FPA) technology for cost-effective MWIR detection in defense and commercial applications, leveraging over 20 years of experience in advanced imaging and electrical engineering.\nWith a B.S.\nin Electronics Engineering, Mr.\nMirchandani’s expertise in signal processing and system integration positions him ideally to guide this project.\nHis career has focused on designing, simulating, and implementing multi-array systems, specializing in real-time coherence and high-sensitivity detection-critical features of the proposed FPA technology.\nUnder Mr.\nMirchandani’s direction, the FPA project has undergone rigorous modeling and simulation using advanced tools like MATLAB, COMSOL, ANSYS, and Cadence.\nHis extensive knowledge of synchronized multi-array architectures ensures that the HgTe CQD FPA system achieves superior imaging sensitivity and accurate signal alignment, vital for military applications like surveillance and commercial uses in environmental monitoring and industrial inspection.\nWith a record of delivering scalable, high-performance solutions, Mr.\nMirchandani’s role in refining the FPA design is crucial to successfully deploying this low-cost, state-of-the-art imaging technology for diverse applications.\nHis leadership in simulation and integration solidifies Bryka’s FPA system as a leading-edge solution for defense and commercial markets.\n7.2 Dr.\nAlan Mantooth -Wide-Bandgap Semiconductor and Power Converters Expert Dr.\nAlan Mantooth a distinguished expert in semiconductor modeling and power electronics, holds a B.S.\nand M.S.\nin Electrical Engineering from the University of Arkansas (1985 and 1986) and a Ph.D.\nfrom Georgia Tech (1990).\nHe began his career at Analogy, a semiconductor modeling startup in Oregon, where he specialized in creating modeling tools for advanced semiconductor devices.\nIn 1998, Dr.\nMantooth joined the University of Arkansas as an Electrical Engineering professor, now a Distinguished Professor.\nHis research encompasses analog and mixed-signal IC design, CAD, device modeling, and power electronics.\nDr.\nMantooth co-founded the National Center for Reliable Electric Power Transmission (NCREPT) in 2005 and serves as its Executive Director.\nHe also directs two centers of excellence: GRAPES (a center focused on grid-connected advanced power systems) and SEEDS (a center focused on cybersecurity in energy systems), both funded by the U.S.\nDepartment of Energy.\nIn 2015, he launched the Power Optimization for Electro-Thermal Systems (POETS) Engineering Research Center, focusing on high-power density systems for transportation applications.\nDr.\nMantooth holds the 21st Century Research Leadership Chair in Engineering and has served as the Immediate past President of the IEEE Power Electronics Society (2019–20) and Editor-in-Chief of the IEEE Open Journal of Power Electronics.\nAn IEEE Fellow, he is also a Tau Beta Pi and Beta Kappa Nu member and a licensed Professional Engineer in Arkansas.\n7.3 Dr.\nNima Gallaecian – Focal Plane Array Design Engineer: Dr.\nNima Gallaecian, the Focal Plane Array Design Engineer at Bryka Inc., brings over 20 years of expertise in imaging systems and MWIR technologies.\nHe is a critical asset in developing the HgTe CQD-based FPA technology.\nDr.\nGallaecian earned his B.S.\nin Electrical Engineering and completed his M.S.\nand Ph.D.\nin Electrical Engineering from the University of Maryland-College Park, where his research focused on advanced sensor technologies.\nHis extensive background in mid-wave infrared imaging, CQD-based sensors, and real-time coherence solutions directly supports this project, particularly optimizing FPA panel design for low-light sensitivity and distributed array coherence.\nDr.\nGallaecian’s expertise in sensor arrays, non-linear imaging systems, and reconfigurable imaging technologies aligns with the project’s focus on achieving high NEP stability, dark current control, and pixel uniformity across multi-array configurations.\nHis previous work at FormFactor, Inc., where he developed precision technologies for probe arrays, underscores his innovative approach to high-performance systems.\nWith a strong record of advancing reconfigurable imaging arrays, Dr.\nGallaecian’s leadership will ensure Bryka’s HgTe CQD-based FPAs meet stringent Air Force standards for real-time imaging and high-sensitivity detection across defense and commercial applications, including environmental monitoring and industrial inspection.\n7.4 Dr.\nSwaroop Darbha – Integration Expert: Dr.\nSwaroop Darbha, a prominent figure in Mechanical Engineering, holds an M.S.\nand Ph.D.\nfrom the University of California, Berkeley (1992 and 1994).\nKnown for his expertise in systems integration, Dr.\nDarbha’s career is marked by significant contributions to control systems and multi-agent communication technologies, making him a valuable 16",
        "24": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\nasset in the development of Bryka Inc.’s HgTe CQD-based FPA technology.\nHis work optimizes distributed system performance, crucial for synchronizing multi-array panels in the proposed MWIR imaging system.\nDr.\nDarbha’s experience includes being the keynote speaker at the 2018 IEEE COMSNETS Conference, where he discussed the “Benefits of V2V Communications for Automatically Controlled Vehicles.” He also presented at the American Control Conference in 2013 and 2015 on “Combinatorial Optimization Methods for Routing Unmanned Vehicles,” emphasizing system communication and coordination—essential elements for real-time, distributed sensor applications.\nHis deep understanding of complex system integration and his work on synchronization across distributed units will ensure that the HgTe CQD-based FPA technology achieves precise, real-time data coherence across multi-array configurations, supporting defense, surveillance, and environmental monitoring applications.\n8.0 Foreign Citizens: N.A 9.0 Facilities/Equipment: Bryka Skystocks LLC., headquartered in Connecticut, operates an advanced facility that supports the complete development, fabrication, and testing cycle of the proposed HgTe CQD-based FPA technology.\nThe facility has cutting-edge equipment and technology to ensure precision and high performance at every project phase.\n• Fabrication Capabilities: Bryka’s facility includes precision CNC machining and solution-based CQD deposition systems essential for HgTe CQD layer fabrication.\nThese systems provide consistent material quality and enable homogeneous properties across batches, crucial for maintaining sensitivity and performance in MWIR FPA production.\nImaging and Sensor Laboratory: The facility includes a specialized MWIR Imaging Laboratory, equipped with spectrometers and temperature-controlled chambers to test FPA sensitivity and signal stability across the 3-5 µm wavelength range.\nThe lab supports real-time analysis of key performance metrics, such as NEP and dark current, which are vital for optimizing FPA arrays.\n• • Design Software: Bryka utilizes industry-standard design and simulation tools like COMSOL Multiphysics for material and thermal simulation, MATLAB for coherence algorithms, and Cadence Virtuoso for precise FPA circuitry design, ensuring minimal signal loss and optimized imaging performance across distributed arrays.\n17",
        "25": "Proposal Number.: F244-0002-0320 Topic Number.: AF244-0002 Bryka Skystocks LLC.\n10.0 Subcontractors/Consultants: N.A 11.0 Prior, Current or Pending Support of Similar Proposals or Awards: • Bryka SkyStocks LLC.\nhas been awarded a Space Force SBIR Contract for topic SF24B-T008-Self- Regulating Heaters for Satellites.\n• Bryka SkyStocks LLC.\nhas been awarded Navy STTR Contract N6833524C0092 for topic N23B-T030- Secure Mid-wave Free-space Mid-wave Infrared Optical Communication Using Chaotic Laser Mode.\n• Bryka SkyStocks LLC.\nhas been awarded Space Force Contract FA9453-23-P-A043 for topic SF224-0012- Customer Functions Virtualization over Satellite Terminals.\n• Bryka SkyStocks LLC.\nhas been awarded Air Force SBIR Phase I Contract FA9451-23-P-A008 for topic AF222-0006-Planar Antenna array for L-Band and S-Band ‘PALS.’ 18",
        "26": "SBIR Phase I Proposal Proposal Number Topic Number Proposal Title Date Submitted Firm Information Firm Name Mail Address Website Address UEI Duns Cage F244-0002-0320 AF244-0002 Low C-SWaP MWIR Detectors and Focal Plane Arrays 11/06/2024 11:32:48 AM Bryka Skystocks LLC 549 Cedar Street , Newington, Connecticut, 06111 brykagp.com RB4XFCMC9KZ7 967264990 6afx5 Total Dollar Amount for this Proposal Base Year Year 2 Technical and Business Assistance(TABA)- Base TABA- Year 2 Base Year Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 10%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Year 2 Summary Total Direct Labor (TDL) Total Direct Material Costs (TDM) $139,067.58 $139,065.50 $2.08 $0.00 $0.00 $117,058.50 $0.00 $0.00 $0.00 $0.00 $0.00 $11,705.85 $128,764.35 $0.00 -$0.00 $10,301.15 $139,065.50 $0.00 $1.76 $0.00",
        "27": "Total Direct Supplies Costs (TDS) Total Direct Equipment Costs (TDE) Total Direct Travel Costs (TDT) Total Other Direct Costs (TODC) G&A (rate 10%) x Base (TDL+TOH) Total Firm Costs Subcontractor Costs Total Subcontractor Costs (TSC) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Base Year Direct Labor Costs $0.00 $0.00 $0.00 $0.00 $0.18 $1.94 $0.00 -$0.00 $0.15 $2.08 $0.00 Category / Individual-TR Chief Executive/ Principal Investigator Electronics Engineer/ Focal Plane Array Design Engineer (Dr.\nNima Gallaecian) Electronics Engineer/ Wide-Bandgap Semiconductor and Power Converters Expert (Dr.\nAlan Mantooth) Mechanical Engineer/ Integration Expert (Dr.\nSwaroop Darbha) Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost $110.00 170 30 $5610.00 $24,310.00 $80.00 210 30 $5040.00 $21,840.00 $60.00 260 30 $4680.00 $20,280.00 $60.00 260 30 $4680.00 $20,280.00 Subtotal Direct Labor (DL) Labor Overhead (rate 35%) x (DL) Total Direct Labor (TDL) G&A (rate 10%) x Base (TDL+TOH) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA Year 2 Direct Labor Costs $86,710.00 $30,348.50 $117,058.50 $11,705.85 -$0.00 $10,301.15 $139,065.50 $0.00 Category / Individual-TR Rate/Hour Estimated Hours Fringe Rate (%) Fringe Cost Cost",
        "28": "Chief Executive/ Principal Investigator Subtotal Direct Labor (DL) Labor Overhead (rate 35%) x (DL) Total Direct Labor (TDL) G&A (rate 10%) x Base (TDL+TOH) Cost Sharing Profit Rate (8%) Total Estimated Cost TABA $1.00 1 30 $0.30 $1.30 $1.30 $0.46 $1.76 $0.18 -$0.00 $0.15 $2.08 $0.00 Explanatory Material Relating to the Cost Volume The Official From the Firm that is responsible for the cost breakdown Name: Suresh Mirchandani Phone: (732) 851-9034 Phone: aviationsales@brykagp.com Title: Proposal Owner If the Defence Contracting Audit Agency has performed a review of your projects within the past 12 months, please provide: No Select the Type of Payment Desired: Partial payments",
        "29": "Cost Volume Details Direct Labor Base Category Description Education Yrs Experience Hours Rate Fringe Rate Total Chief Executive Principal Investigator Bachelor's Degree Electronics Engineer Focal Plane Array Design Engineer Electronics Engineer Wide-Bandgap Semiconductor and Power Converters Expert Mechanical Engineer Integration Expert PhD PhD PhD 20 10 10 10 170 $110.00 30 $24,310.00 210 $80.00 30 $21,840.00 260 $60.00 30 $20,280.00 260 $60.00 30 $20,280.00 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\nFringe Benefits includes Federal Unemployment Tax Allowance, State Unemployment Tax, Workmen's Compensation Insurance, Employee Benefits such as Health and welfare including life, accident and health Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nPrincipal Investigators, and Other Engineers will be compensated at Industry-standard rates.\nhttps://www.bls.gov/oes/current/oes_ct.htm#19-0000 Direct Labor Cost ($): Year2 $86,710.00 Category Description Education Yrs Experience Hours Rate Fringe Rate Total Chief Executive Principal Investigator Bachelor's Degree 10 1 $1.00 30 $1.30 Are the labor rates detailed below fully loaded?\nYES Please explain any costs that apply.\nFringe Benefits includes Federal Unemployment Tax Allowance, State Unemployment Tax, Workmen's Compensation Insurance, Employee Benefits such as Health and welfare including life, accident and health",
        "30": "Provide any additional information and cost support data related to the nature of the direct labor detailed above.\nPrincipal Investigators, and Other Engineers will be compensated at Industry-standard rates.\nhttps://www.bls.gov/oes/current/oes_ct.htm#19-0000 Direct Labor Cost ($): Sum of all Direct Labor Costs is($): Overhead Base Labor Cost Overhead Rate (%) Overhead Comments: Overhead Cost ($): Year2 Labor Cost Overhead Rate (%) Overhead Comments: Overhead Cost ($): Sum of all Overhead Costs is ($): General and Administration Cost Base G&A Rate (%): Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Year2 G&A Rate (%): $1.30 $86,711.30 35 $30,348.50 35 $0.46 $30,348.96 10 YES YES $11,705.85 10",
        "31": "Apply G&A Rate to Overhead Costs?\nApply G&A Rate to Direct Labor Costs?\nPlease specify the different cost sources below from which your company's General and Administrative costs are calculated.\nG&A Cost ($): Sum of all G&A Costs is ($): Profit Rate/Cost Sharing Base Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Year2 Cost Sharing ($): Cost Sharing Explanation: Profit Rate (%): Profit Explanation: Total Profit Cost ($): Total Proposed Amount ($): YES YES $0.18 $11,706.03 - 8 $10,301.30 - 8 $10,301.30 $139,067.58",
        "32": "Suresh Mirchandani, Bryka Skystocks LLC Nov 05, 2024 Nov 05, 2025"
    },
    "images": [
        {
            "page": 8,
            "image_file": "Proposal_F244-0002-0320_page8_img1.png",
            "hash": "bf8570c5c762a43a",
            "position": "Top Right"
        },
        {
            "page": 9,
            "image_file": "Proposal_F244-0002-0320_page9_img1.png",
            "hash": "ea96858f93689669",
            "position": "Top Right"
        },
        {
            "page": 10,
            "image_file": "Proposal_F244-0002-0320_page10_img1.png",
            "hash": "b319dddc6232348d",
            "position": "Top Right"
        },
        {
            "page": 11,
            "image_file": "Proposal_F244-0002-0320_page11_img1.png",
            "hash": "a788d09fc8f09973",
            "position": "Middle Center"
        },
        {
            "page": 12,
            "image_file": "Proposal_F244-0002-0320_page12_img1.png",
            "hash": "ea5276ada558d152",
            "position": "Top Right"
        },
        {
            "page": 14,
            "image_file": "Proposal_F244-0002-0320_page14_img1.png",
            "hash": "b724c87f1333ecc0",
            "position": "Top Right"
        },
        {
            "page": 15,
            "image_file": "Proposal_F244-0002-0320_page15_img1.png",
            "hash": "9cf3a19ed2ad6304",
            "position": "Top Center"
        },
        {
            "page": 17,
            "image_file": "Proposal_F244-0002-0320_page17_img1.png",
            "hash": "e2a4dbdba44ba524",
            "position": "Middle Center"
        },
        {
            "page": 18,
            "image_file": "Proposal_F244-0002-0320_page18_img1.png",
            "hash": "eed0b807d017d03f",
            "position": "Middle Right"
        },
        {
            "page": 19,
            "image_file": "Proposal_F244-0002-0320_page19_img1.png",
            "hash": "cb373658e6acc09c",
            "position": "Top Right"
        },
        {
            "page": 19,
            "image_file": "Proposal_F244-0002-0320_page19_img2.png",
            "hash": "fee5c04a2d6e81e2",
            "position": "Middle Center"
        },
        {
            "page": 24,
            "image_file": "Proposal_F244-0002-0320_page24_img1.png",
            "hash": "c484e653fa219f4d",
            "position": "Middle Center"
        },
        {
            "page": 25,
            "image_file": "Proposal_F244-0002-0320_page25_img1.png",
            "hash": "abb99452cbc7d0a2",
            "position": "Top Center"
        },
        {
            "page": 25,
            "image_file": "Proposal_F244-0002-0320_page25_img2.png",
            "hash": "eaa0f896e46ac762",
            "position": "Middle Left"
        },
        {
            "page": 25,
            "image_file": "Proposal_F244-0002-0320_page25_img3.png",
            "hash": "bf099a93c99a30e9",
            "position": "Middle Center"
        },
        {
            "page": 25,
            "image_file": "Proposal_F244-0002-0320_page25_img4.png",
            "hash": "e681feb0819f59b0",
            "position": "Middle Center"
        },
        {
            "page": 25,
            "image_file": "Proposal_F244-0002-0320_page25_img5.png",
            "hash": "c9b4b74628fc8333",
            "position": "Middle Right"
        },
        {
            "page": 25,
            "image_file": "Proposal_F244-0002-0320_page25_img6.png",
            "hash": "a9e9f6ea1264063d",
            "position": "Middle Right"
        }
    ],
    "firm_info": {
        "company": "N/A",
        "address": "N/A",
        "website": "brykagp.com",
        "name": "N/A",
        "phone": "N/A"
    }
}